{
	"version": "https://jsonfeed.org/version/1",
	"title": "Jen Kramer",
	"icon": "https://micro.blog/jen4web/avatar.jpg",
	"home_page_url": "http://learnnocode.dev/",
	"feed_url": "http://learnnocode.dev/feed.json",
	"items": [
		
			{
				"id": "http://jen4web.micro.blog/2021/06/17/tell-students-what.html",
				"title": "Tell students what isn't important to worry about in the assignment",
				"content_html": "<p>Instructor labels &ndash;</p>\n\n<p>Green circle = the assignment</p>\n\n<p>Gray circle = what students think is important</p>\n\n<p>Include a section in the assignment that clearly spells out what you DON&rsquo;T care about for grading. It&rsquo;s as important as the rubric you use for grading.</p>\n\n<p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">At least perfect the right thing. <a href=\"https://t.co/nTtyT5gQuE\">pic.twitter.com/nTtyT5gQuE</a></p>— Janis Ozolins (@OzolinsJanis) <a href=\"https://twitter.com/OzolinsJanis/status/1405367040332926979?ref_src=twsrc%5Etfw\">June 17, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n",
				"content_text": "Instructor labels --\n\nGreen circle = the assignment\n\nGray circle = what students think is important\n\nInclude a section in the assignment that clearly spells out what you DON'T care about for grading. It's as important as the rubric you use for grading.\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">At least perfect the right thing. <a href=\"https://t.co/nTtyT5gQuE\">pic.twitter.com/nTtyT5gQuE</a></p>— Janis Ozolins (@OzolinsJanis) <a href=\"https://twitter.com/OzolinsJanis/status/1405367040332926979?ref_src=twsrc%5Etfw\">June 17, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n",
				"date_published": "2021-06-17T07:15:00-04:00",
				"url": "http://learnnocode.dev/2021/06/17/tell-students-what.html",
				"tags": ["Teaching Tips","Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/05/16/im-back.html",
				"title": "I'm back!",
				"content_html": "<p>#30DaysofHTML ended 2 weeks ago. My last teaching semester at Harvard ended yesterday.</p>\n\n<p>In my educational video course, where I was a student, I created a video reflecting on #30DaysofHTML.\n<a href=\"https://youtu.be/R9WW-KlKVC8\">youtu.be/R9WW-KlKV&hellip;</a></p>\n\n<p>I&rsquo;m returning to blogging shortly, now that I have some time.</p>\n\n<p>Also, I need a job. My Harvard teaching gig is up on June 30, but there isn&rsquo;t much for me to do between now and then.</p>\n",
				"content_text": "#30DaysofHTML ended 2 weeks ago. My last teaching semester at Harvard ended yesterday. \n\nIn my educational video course, where I was a student, I created a video reflecting on #30DaysofHTML.\n[youtu.be/R9WW-KlKV...](https://youtu.be/R9WW-KlKVC8)\n\nI'm returning to blogging shortly, now that I have some time.\n\nAlso, I need a job. My Harvard teaching gig is up on June 30, but there isn't much for me to do between now and then.\n",
				"date_published": "2021-05-16T10:39:06-04:00",
				"url": "http://learnnocode.dev/2021/05/16/im-back.html",
				"tags": ["Video","Studio news","Teaching Reflections","Personal reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/04/01/how-to-make.html",
				"title": "How to make HTML exciting again",
				"content_html": "<p><img src=\"uploads/2021/480d999f5d.png\" width=\"853\" height=\"141\" alt=\"#30DaysofHTML banner graphic.\" /></p>\n\n<p>Today I received the best compliment on my #30DaysofHTML course, even before it launches.</p>\n\n<p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I don&rsquo;t know how you&rsquo;ve managed it, but you&rsquo;ve gotten me all excited about HTML.</p>— ოarῐa ᥨaῃ𝙜әr 🚁😷💉🇺🇸 (@mlanger) <a href=\"https://twitter.com/mlanger/status/1377610956323229700?ref_src=twsrc%5Etfw\">April 1, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n\n<p>This gets to the heart of why I started this challenge and my thinking behind it.</p>\n\n<h3>How HTML is normally taught</h3>\n\n<p>HTML is the scaffolding behind a web page. It&rsquo;s as exciting as framing a house, or <a href=\"https://jen4web.substack.com/p/use-the-full-frontend-or-create-junk\">playing bass or drums in a rock band</a>. In other words, there&rsquo;s some artistry, but it&rsquo;s underappreciated by most. Done right, it&rsquo;s in the shadow of way more exciting and interesting elements of the project. However, without it, nothing else matters &ndash; HTML is foundational to a website.</p>\n\n<p>When developers teach new developers HTML, it&rsquo;s presented as a necessary evil. As little time as possible is spent on it, because everyone wants to get on to making things pretty and interactive &ndash; neither of which is a thing with HTML. Quick quick, here&rsquo;s a tag, here&rsquo;s an attribute, open/close things &ndash; whew, let&rsquo;s move on.</p>\n\n<p><strong>As a result, HTML is the mushroom of the web world. It&rsquo;s kept in the dark, and it eats a lot of crap by people who see nothing to love.</strong></p>\n\n<h3>I love mushrooms</h3>\n\n<p><em>The purpose of the Hypertext Markup Language is to identify the parts of the web page: paragraphs, lists, headings, links, addresses, quotations, and so much more.</em> How many times have I said this sentence in 20 years of teaching?</p>\n\n<p>But finally, I made a connection: <strong>HTML is intimately tied to the story of the website.</strong></p>\n\n<p>Everyone wants to be heard and understood. Everyone wants their story heard. <strong>Great HTML is the way to communicate your story to the world.</strong></p>\n\n<p>When I was 14 months old and hungry, I would pull on my mother&rsquo;s pant leg, point to the counter looming over my head, and grunt, &ldquo;Cookie.&rdquo; (Or so my mother says. I do not remember.) She would respond by giving me fruit, crackers, a bowl of dry Cheerios, or whatever else a 14 month old eats. Not a cookie, no matter hard I tried. Or she&rsquo;d tell me it was almost dinner time and go away and leave her to finish it.</p>\n\n<p>Consider that your crappy HTML is telling this same story. If your website is nothing but one &lt; div &gt; after another, you&rsquo;re just saying COOKIE COOKIE COOKIE. You&rsquo;re 14 months old, with a limited grasp of vocabulary.</p>\n\n<p><img src=\"uploads/2021/0fad8710f2.jpg\" width=\"409\" height=\"426\" alt=\"Cartoon  - semantic HTML overwhelmed by divitis\" /></p>\n\n<h3>Telling the wrong story </h3>\n\n<p>So. How do you convince developers, who just love everything pretty and interactive, that their framing sucks and doesn&rsquo;t work? Their code that sits on top of it works just fine. Framing is SO BORING.</p>\n\n<p>Well, accessibility, of course! It&rsquo;s absolutely critical. Accessibility should start at the beginning. It should always be incorporated in the site. Good accessibility starts with meaningful HTML.</p>\n\n<p>But &ndash; what the accessibility advocates are doing is not effective to get developer attention. They are, unfortunately, ignored for the most part.</p>\n\n<p>We&rsquo;ve (maybe) gotten (some) busy developers to feel guilty about their bad HTML. But changing it takes effort. Learning what HTML elements are available takes time and research. Time that could be spent learning the latest JavaScript framework.</p>\n\n<p>Time for a new story with new framing.</p>\n\n<h3>#MakeHTMLExcitingAgain</h3>\n\n<p>If we focus on HTML&rsquo;s syntax, that&rsquo;s not interesting. What&rsquo;s interesting is the meaning conveyed behind the elements. Why choose one element over another? How does that element contribute to the website&rsquo;s story?</p>\n\n<p>30DaysofHTML incorporates the following concepts:</p>\n\n<ul>\n<li><p>Focus on the meaning behind the elements. When should something be used or not used?</p></li>\n\n<li><p>Don&rsquo;t overwhelm with all of the edge cases and complexity. Provide just enough information to feel like you know a little bit, and provide links to everything else.</p></li>\n\n<li><p>Identify any misconceptions about the element. HTML looks like English. The &lt; address &gt; element, for example, looks like it&rsquo;s for a postal address. However, it can be used for any contact information associated with an article or website author, including phone numbers, email address, social media links, or even geographic coordinates. Who knew that? That&rsquo;s interesting and fun and different.</p></li>\n\n<li><p>Remove the pretty and interactive, so learners are forced to focus on the scaffolding. We aren&rsquo;t concerned with cross-device presentation or UX or anything else. It&rsquo;s black text on a white page. There&rsquo;s nothing else to do here&hellip; by design.</p></li>\n\n<li><p>Encourage application, reflection, and discussion. Not only should there be a little reading, but there should be some examples and problems to try too. Maybe the occasional quiz. Encourage readers to share their work and comment on each other&rsquo;s markup and approaches. Put the discussion on the meaning we&rsquo;re trying to convey.</p></li>\n\n<li><p>And finally, make it fun. Make some fun graphics, throw in a few emojis, use all of the web writing techniques to break up content with headings and lists. Write in a fun and informal style.</p></li>\n</ul>\n\n<h3>Hook 'em with a hook</h3>\n\n<p><a href=\"https://jen4web.substack.com/p/address\">&ldquo;&lt; address &gt; should be used for addresses. You guessed that already. But what kind of addresses, and in what context?&rdquo;</a></p>\n\n<p>Draw the reader in. Make them curious. Conflict is interesting. The lure of something that perhaps you don&rsquo;t know is intriguing.</p>\n\n<p>I also sent out a <a href=\"https://jen4web.substack.com/p/twas-the-night-before-30daysofhtml\">&ldquo;Night Before&rdquo;</a> email, explaining what to expect and how it will all work. This sets anxious learners at ease, and it sets expectations and generates interest. It also sets metrics for what success looks like.</p>\n\n<p><h3>Give them a familiar format</h3></p>\n\n<ul>\n<li><p>The &ldquo;X Days&rdquo; format is popular at this moment. People talk about #100DaysofCode and #100DaysofNoCode and such. Why not #30DaysofHTML? Fortunately, it explains everything you need to know in the hashtag. 30 days, talking about HTML.</p></li>\n\n<li><p>Email is the format for delivery. It&rsquo;s simple, easy, and everyone has it. Using Substack, I also create a website, and it has interesting discussion features for sharing work.</p></li>\n\n<li><p>In Silicon Valley speak, &ldquo;reduce friction.&rdquo; The email goes in your inbox. You read it when you&rsquo;re ready. Another appears tomorrow. You&rsquo;re getting 30 emails in 30 days. What&rsquo;s not to love?</p></li>\n</ul>\n\n<h3>Time to start!</h3>\n\n<p>This is the start of my 30 day journey. I hope to learn more about HTML, but mostly, I hope to learn more about offering instruction in this format. What works and what falls flat? What is the response? What would I do differently next time?</p>\n\n<p>I&rsquo;ll write more about this in May.</p>\n",
				"content_text": "<img src=\"uploads/2021/480d999f5d.png\" width=\"853\" height=\"141\" alt=\"#30DaysofHTML banner graphic.\" />\n\nToday I received the best compliment on my #30DaysofHTML course, even before it launches.\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">I don't know how you've managed it, but you've gotten me all excited about HTML.</p>— ოarῐa ᥨaῃ𝙜әr 🚁😷💉🇺🇸 (@mlanger) <a href=\"https://twitter.com/mlanger/status/1377610956323229700?ref_src=twsrc%5Etfw\">April 1, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\nThis gets to the heart of why I started this challenge and my thinking behind it.\n\n<h3>How HTML is normally taught</h3>\n\nHTML is the scaffolding behind a web page. It's as exciting as framing a house, or [playing bass or drums in a rock band] (https://jen4web.substack.com/p/use-the-full-frontend-or-create-junk). In other words, there's some artistry, but it's underappreciated by most. Done right, it's in the shadow of way more exciting and interesting elements of the project. However, without it, nothing else matters -- HTML is foundational to a website.\n\nWhen developers teach new developers HTML, it's presented as a necessary evil. As little time as possible is spent on it, because everyone wants to get on to making things pretty and interactive -- neither of which is a thing with HTML. Quick quick, here's a tag, here's an attribute, open/close things -- whew, let's move on.\n\n**As a result, HTML is the mushroom of the web world. It's kept in the dark, and it eats a lot of crap by people who see nothing to love.**\n\n<h3>I love mushrooms</h3>\n\n*The purpose of the Hypertext Markup Language is to identify the parts of the web page: paragraphs, lists, headings, links, addresses, quotations, and so much more.* How many times have I said this sentence in 20 years of teaching?\n\nBut finally, I made a connection: **HTML is intimately tied to the story of the website.**\n\nEveryone wants to be heard and understood. Everyone wants their story heard. **Great HTML is the way to communicate your story to the world.**\n\nWhen I was 14 months old and hungry, I would pull on my mother's pant leg, point to the counter looming over my head, and grunt, \"Cookie.\" (Or so my mother says. I do not remember.) She would respond by giving me fruit, crackers, a bowl of dry Cheerios, or whatever else a 14 month old eats. Not a cookie, no matter hard I tried. Or she'd tell me it was almost dinner time and go away and leave her to finish it.\n\nConsider that your crappy HTML is telling this same story. If your website is nothing but one < div > after another, you're just saying COOKIE COOKIE COOKIE. You're 14 months old, with a limited grasp of vocabulary.\n\n<img src=\"uploads/2021/0fad8710f2.jpg\" width=\"409\" height=\"426\" alt=\"Cartoon  - semantic HTML overwhelmed by divitis\" />\n\n<h3>Telling the wrong story </h3>\n\nSo. How do you convince developers, who just love everything pretty and interactive, that their framing sucks and doesn't work? Their code that sits on top of it works just fine. Framing is SO BORING.\n\nWell, accessibility, of course! It's absolutely critical. Accessibility should start at the beginning. It should always be incorporated in the site. Good accessibility starts with meaningful HTML.\n\nBut -- what the accessibility advocates are doing is not effective to get developer attention. They are, unfortunately, ignored for the most part. \n\nWe've (maybe) gotten (some) busy developers to feel guilty about their bad HTML. But changing it takes effort. Learning what HTML elements are available takes time and research. Time that could be spent learning the latest JavaScript framework.\n\nTime for a new story with new framing.\n\n<h3>#MakeHTMLExcitingAgain</h3>\n\nIf we focus on HTML's syntax, that's not interesting. What's interesting is the meaning conveyed behind the elements. Why choose one element over another? How does that element contribute to the website's story?\n\n30DaysofHTML incorporates the following concepts:\n\n* Focus on the meaning behind the elements. When should something be used or not used? \n\n* Don't overwhelm with all of the edge cases and complexity. Provide just enough information to feel like you know a little bit, and provide links to everything else.\n\n* Identify any misconceptions about the element. HTML looks like English. The < address > element, for example, looks like it's for a postal address. However, it can be used for any contact information associated with an article or website author, including phone numbers, email address, social media links, or even geographic coordinates. Who knew that? That's interesting and fun and different.\n\n* Remove the pretty and interactive, so learners are forced to focus on the scaffolding. We aren't concerned with cross-device presentation or UX or anything else. It's black text on a white page. There's nothing else to do here... by design.\n\n* Encourage application, reflection, and discussion. Not only should there be a little reading, but there should be some examples and problems to try too. Maybe the occasional quiz. Encourage readers to share their work and comment on each other's markup and approaches. Put the discussion on the meaning we're trying to convey.\n\n* And finally, make it fun. Make some fun graphics, throw in a few emojis, use all of the web writing techniques to break up content with headings and lists. Write in a fun and informal style.\n\n<h3>Hook 'em with a hook</h3>\n\n[\"< address > should be used for addresses. You guessed that already. But what kind of addresses, and in what context?\"] (https://jen4web.substack.com/p/address)\n  \n  Draw the reader in. Make them curious. Conflict is interesting. The lure of something that perhaps you don't know is intriguing.\n  \n  I also sent out a [\"Night Before\"] (https://jen4web.substack.com/p/twas-the-night-before-30daysofhtml) email, explaining what to expect and how it will all work. This sets anxious learners at ease, and it sets expectations and generates interest. It also sets metrics for what success looks like.\n  \n  <h3>Give them a familiar format</h3>\n  \n*  The \"X Days\" format is popular at this moment. People talk about #100DaysofCode and #100DaysofNoCode and such. Why not #30DaysofHTML? Fortunately, it explains everything you need to know in the hashtag. 30 days, talking about HTML.\n  \n*  Email is the format for delivery. It's simple, easy, and everyone has it. Using Substack, I also create a website, and it has interesting discussion features for sharing work.\n  \n*  In Silicon Valley speak, \"reduce friction.\" The email goes in your inbox. You read it when you're ready. Another appears tomorrow. You're getting 30 emails in 30 days. What's not to love?\n\n<h3>Time to start!</h3>\n\nThis is the start of my 30 day journey. I hope to learn more about HTML, but mostly, I hope to learn more about offering instruction in this format. What works and what falls flat? What is the response? What would I do differently next time?\n\nI'll write more about this in May.\n  \n",
				"date_published": "2021-04-01T11:29:00-04:00",
				"url": "http://learnnocode.dev/2021/04/01/how-to-make.html",
				"tags": ["Teaching Tips","Teaching Reflections","Personal reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/04/01/daysofhtml-starts-today.html",
				
				"content_html": "<p>#30DaysofHTML starts today! There&rsquo;s still time to (free) <a href=\"https://jen4web.substack.com/welcome\">register</a>. First email goes out at 11 AM, but if you miss it, you&rsquo;ll see it on the <a href=\"https://jen4web.substack.com\">website</a>, and you&rsquo;ll get the emails going forward.</p>\n\n<p><img src=\"uploads/2021/34415a9d60.png\" width=\"600\" height=\"503\" alt=\"\" /></p>\n",
				"content_text": "#30DaysofHTML starts today! There's still time to (free) [register] (https://jen4web.substack.com/welcome). First email goes out at 11 AM, but if you miss it, you'll see it on the [website] (https://jen4web.substack.com), and you'll get the emails going forward.\n\n<img src=\"uploads/2021/34415a9d60.png\" width=\"600\" height=\"503\" alt=\"\" />\n",
				"date_published": "2021-04-01T09:55:31-04:00",
				"url": "http://learnnocode.dev/2021/04/01/daysofhtml-starts-today.html"
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/26/star-ratings-in.html",
				"title": "Star ratings in Substack - grading the reader, not the writer",
				"content_html": "<p><a href=\"https://medium.com/linda-caroll/how-substacks-new-gold-stars-will-help-writers-get-results-9fc6fdc6342a\">Interesting Substack feature</a>: your readers are given star ratings visible only to the newsletter owner.</p>\n\n<p>As the article points out, you can give special offers to people who are actively reading your newsletter and weed out those who just wanted the freebies.</p>\n\n<p>I&rsquo;m also thinking about this for educational purposes. You know exactly which students are engaged enough to open the emails.</p>\n",
				"content_text": "[Interesting Substack feature] (https://medium.com/linda-caroll/how-substacks-new-gold-stars-will-help-writers-get-results-9fc6fdc6342a): your readers are given star ratings visible only to the newsletter owner.\n\nAs the article points out, you can give special offers to people who are actively reading your newsletter and weed out those who just wanted the freebies.\n\nI'm also thinking about this for educational purposes. You know exactly which students are engaged enough to open the emails.\n",
				"date_published": "2021-03-26T10:52:11-04:00",
				"url": "http://learnnocode.dev/2021/03/26/star-ratings-in.html",
				"tags": ["Tools General"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/18/expand-your-html.html",
				"title": "Expand your HTML game in 30 days.",
				"content_html": "<p><em>There&rsquo;s a world beyond &lt; p &gt;, &lt; a &gt;, and &lt; div &gt;</em></p>\n\n<p><a href=\"https://jen4web.substack.com/subscribe\"><img src=\"uploads/2021/61f1fd4488.png\" width=\"500\" height=\"500\" alt=\"30 Days of HTML logo. Click to subscribe to the challenge.\" /></a></p>\n\n<h3>What is 30 Days of HTML?</h3>\n\n<p>Receive one email a day for 30 days, each featuring at least one HTML element.</p>\n\n<p>Expand your HTML repertoire, including element names, required and common attributes, example code, and links to more learning.</p>\n\n<p><strong>It starts April 1, 2021.</strong></p>\n\n<p><a href=\"https://jen4web.substack.com/subscribe\">Subscribe to 30 Days of HTML</a></p>\n\n<h3>Who is this for?</h3>\n\n<p>This challenge is designed for those already familiar with HTML syntax but limited in their tag choices.</p>\n\n<p>We cover the 95% of HTML that has a use on many of your web pages, but you don’t know it exists. No paragraphs, lists, and headings here.</p>\n\n<h3>But I don’t know HTML… yet</h3>\n\n<p>If you want to learn HTML from nothing, I recommend <a href=\"https://www.frontendmasters.com/bootcamp\">my free bootcamp at Frontend Masters</a>. If you’ve taken the bootcamp already, you will find this series a great next step in developing frontend web development skills.</p>\n",
				"content_text": "*There's a world beyond < p >, < a >, and < div >*\n\n<a href=\"https://jen4web.substack.com/subscribe\"><img src=\"uploads/2021/61f1fd4488.png\" width=\"500\" height=\"500\" alt=\"30 Days of HTML logo. Click to subscribe to the challenge.\" /></a>\n  \n<h3>What is 30 Days of HTML?</h3>\n\nReceive one email a day for 30 days, each featuring at least one HTML element.\n\nExpand your HTML repertoire, including element names, required and common attributes, example code, and links to more learning.\n\n**It starts April 1, 2021.**\n\n[Subscribe to 30 Days of HTML] (https://jen4web.substack.com/subscribe)\n\n<h3>Who is this for?</h3>\n\nThis challenge is designed for those already familiar with HTML syntax but limited in their tag choices.\n\nWe cover the 95% of HTML that has a use on many of your web pages, but you don’t know it exists. No paragraphs, lists, and headings here.\n\n<h3>But I don’t know HTML… yet</h3>\n\nIf you want to learn HTML from nothing, I recommend [my free bootcamp at Frontend Masters] (https://www.frontendmasters.com/bootcamp). If you’ve taken the bootcamp already, you will find this series a great next step in developing frontend web development skills.\n\n\n\n",
				"date_published": "2021-03-18T12:37:00-04:00",
				"url": "http://learnnocode.dev/2021/03/18/expand-your-html.html",
				"tags": ["Course release"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/13/teaching-reflections-professor.html",
				"title": "Teaching Reflections #13: Professor as a bad video-maker",
				"content_html": "<p>This week&rsquo;s reading: <a href=\"https://www.timeshighereducation.com/opinion/academics-arent-content-creators-and-its-regressive-make-them-so\">Academics aren’t content creators, and it’s regressive to make them so</a></p>\n\n<p>A few quick snips from the article:</p>\n\n<blockquote>\nThe philosopher John Dewey told us that an educational experience – what he called a community of inquiry – requires a cognitive presence (the learner), a social presence (the learning community) and a teaching presence (the professor). \n</blockquote>\n\n<blockquote>\n  By Dewey’s definition, if our professors spend their time editing videos instead of engaging with students, we cease to even be “educational” institutions. A video made by a professor for only their class is akin to the single-copy, handwritten book disseminated to just one room of people. It is regression, not progress.\n</blockquote>\n\n<p>I think the argument the author is making is this:</p>\n\n<ul>\n<li><p>Dewey says good learning involves 3 elements: learner, learning community, and instructor. This is a virtuous circle. All three elements feed on each other.</p></li>\n\n<li><p>If the instructor must spend more time making (bad) video, they have less time to spend with learners. The video is often bad, because instructors are usually not filmmakers. &ldquo;Bad&rdquo; may be bad production, but it may also be bad storytelling in the video.</p></li>\n\n<li><p>If the video is bad, then the learners will go elsewhere to get content, fracturing the community.</p></li>\n\n<li><p>Without all three elements in place for a good learning experience, university education is simply overpriced.</p></li>\n</ul>\n\n<h3>The practical side of this</h3>\n\n<p>I also make a lot of professional video for LinkedIn Learning and Frontend Masters.</p>\n\n<p>In the past, I&rsquo;ve tried to use these videos as the basis for my class. The students were extremely unhappy, because they could get their own subscription for pennies on the dollar of what they were paying for my university course.</p>\n\n<p>They prefer my less polished, less produced, lower quality video, because they felt this was a better value for their dollar. Why?</p>\n\n<p>Because they feel connected with me when I make a video for them. Students feel like they know me when I&rsquo;m being my normal goofy self on camera. I have less of a personality when I&rsquo;m on camera at LinkedIn. Professional polish and all that.</p>\n\n<h3>Video as textbook and analysis</h3>\n\n<blockquote>\n  Content can enable learning, but it cannot provide an education. Similarly, content is not our core value. There is a long tradition, going back to the printing press, of universities outsourcing their content provision to the textbook: an expensive relic, now replaced by largely free content on the internet. This is progress. Education should be better than ever, as we are now able to point at myriad incredible resources, possibly on the web, perhaps in our library, where we act as content aggregator, not creator. Creation is done when we have our researcher hats on, not our teaching hats.\n  </blockquote>\n  \n\n<p>In the old days, we read the book before we went to class, where the information was discussed and interpreted.</p>\n\n<p>Today, video is asked to do both of these things at once: provide the information of the textbook AND provide the discussion and interpretation. The author thinks that professors spending their time making the textbook is a waste. Find other resources online, have the students use these as the textbook, and then provide interpretation and discussion in class.</p>\n\n<p>What if we had some type of vetted and reviewed video that we could incorporate in our courses? Then we have an effective textbook for our courses, and again, the professor brings the interpretation and meaning to the material.</p>\n\n<p><h3>But I can&rsquo;t make YouTube-style video, so my stuff isn&rsquo;t engaging!</h3></p>\n\n<p>I don&rsquo;t believe this at all, because the argument here is <strong>the technology should drive the content.</strong> In other words, the students won&rsquo;t watch without music, jump cuts, and crazy graphics.</p>\n\n<p>What if we had good content, making a reasonable video that tells a good story but with much less flash? What if we engaged students through discussion and collaboration?</p>\n\n<p>Remember the original argument: <strong>If the video is bad, then the learners will go elsewhere to get content, fracturing the community.</strong> However, &ldquo;bad&rdquo; is not defined.</p>\n\n<p>Bad video could mean bad production for sure. But it could also mean:</p>\n\n<ul>\n<li><p>The instructor is overwhelmed trying to make technologically interesting video, reducing time to engage with students.</p></li>\n\n<li><p>The students are not engaged with the instructor, so they go elsewhere for more entertaining content.</p></li>\n\n<li><p>Dewey&rsquo;s community of inquiry is fractured.</p></li>\n</ul>\n\n<p>What if instructors instead spent their time on making a good story, recording it the best way possible, and engaging students in discussion and activities? Rather than putting so much emphasis on video, put more on the activity and engagement for a better learning experience.</p>\n",
				"content_text": "This week's reading: [Academics aren’t content creators, and it’s regressive to make them so] (https://www.timeshighereducation.com/opinion/academics-arent-content-creators-and-its-regressive-make-them-so)\n\nA few quick snips from the article:\n\n<blockquote>\nThe philosopher John Dewey told us that an educational experience – what he called a community of inquiry – requires a cognitive presence (the learner), a social presence (the learning community) and a teaching presence (the professor). \n</blockquote>\n\n<blockquote>\n  By Dewey’s definition, if our professors spend their time editing videos instead of engaging with students, we cease to even be “educational” institutions. A video made by a professor for only their class is akin to the single-copy, handwritten book disseminated to just one room of people. It is regression, not progress.\n</blockquote>\n\nI think the argument the author is making is this:\n\n* Dewey says good learning involves 3 elements: learner, learning community, and instructor. This is a virtuous circle. All three elements feed on each other.\n\n* If the instructor must spend more time making (bad) video, they have less time to spend with learners. The video is often bad, because instructors are usually not filmmakers. \"Bad\" may be bad production, but it may also be bad storytelling in the video.\n\n* If the video is bad, then the learners will go elsewhere to get content, fracturing the community.\n\n* Without all three elements in place for a good learning experience, university education is simply overpriced.\n\n<h3>The practical side of this</h3>\n\nI also make a lot of professional video for LinkedIn Learning and Frontend Masters. \n\nIn the past, I've tried to use these videos as the basis for my class. The students were extremely unhappy, because they could get their own subscription for pennies on the dollar of what they were paying for my university course.\n\nThey prefer my less polished, less produced, lower quality video, because they felt this was a better value for their dollar. Why?\n\nBecause they feel connected with me when I make a video for them. Students feel like they know me when I'm being my normal goofy self on camera. I have less of a personality when I'm on camera at LinkedIn. Professional polish and all that.\n\n<h3>Video as textbook and analysis</h3>\n\n<blockquote>\n  Content can enable learning, but it cannot provide an education. Similarly, content is not our core value. There is a long tradition, going back to the printing press, of universities outsourcing their content provision to the textbook: an expensive relic, now replaced by largely free content on the internet. This is progress. Education should be better than ever, as we are now able to point at myriad incredible resources, possibly on the web, perhaps in our library, where we act as content aggregator, not creator. Creation is done when we have our researcher hats on, not our teaching hats.\n  </blockquote>\n  \n  In the old days, we read the book before we went to class, where the information was discussed and interpreted. \n  \n  Today, video is asked to do both of these things at once: provide the information of the textbook AND provide the discussion and interpretation. The author thinks that professors spending their time making the textbook is a waste. Find other resources online, have the students use these as the textbook, and then provide interpretation and discussion in class.\n  \n  What if we had some type of vetted and reviewed video that we could incorporate in our courses? Then we have an effective textbook for our courses, and again, the professor brings the interpretation and meaning to the material.\n  \n  <h3>But I can't make YouTube-style video, so my stuff isn't engaging!</h3>\n  \n  I don't believe this at all, because the argument here is **the technology should drive the content.** In other words, the students won't watch without music, jump cuts, and crazy graphics.\n  \n  What if we had good content, making a reasonable video that tells a good story but with much less flash? What if we engaged students through discussion and collaboration? \n  \n  Remember the original argument: **If the video is bad, then the learners will go elsewhere to get content, fracturing the community.** However, \"bad\" is not defined.\n  \n  Bad video could mean bad production for sure. But it could also mean:\n   \n   * The instructor is overwhelmed trying to make technologically interesting video, reducing time to engage with students.\n   \n   * The students are not engaged with the instructor, so they go elsewhere for more entertaining content.\n   \n   * Dewey's community of inquiry is fractured.\n  \nWhat if instructors instead spent their time on making a good story, recording it the best way possible, and engaging students in discussion and activities? Rather than putting so much emphasis on video, put more on the activity and engagement for a better learning experience.\n",
				"date_published": "2021-03-13T11:49:54-04:00",
				"url": "http://learnnocode.dev/2021/03/13/teaching-reflections-professor.html",
				"tags": ["Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/10/upcoming-frontend-masters.html",
				"title": "Upcoming Frontend Masters workshops in August and October",
				"content_html": "<p>I have planned my first trip in over a year, pending my full vaccination&hellip; which looks increasingly likely!</p>\n\n<p>I&rsquo;m headed to Minneapolis to give two workshops with Frontend Masters.</p>\n\n<p><strong>August 18-19: <a href=\"https://frontendmasters.com/workshops/grid-flexbox-v2/\">Responsive Web Design with Flexbox &amp; CSS Grid, v2</a> </strong><br>\nAll things responsive design covered here, including Flexbox, Grid, responsive image approaches and solutions, grid systems, and plenty of exercises and challenges along the way. This updates the original course recorded in 2017 with lots of new information, approaches, and CSS properties. As always, there&rsquo;s a healthy dose of HTML semantics and CSS selectors and specificity along the way.</p>\n\n<p><strong>October 14: <a href=\"https://frontendmasters.com/workshops/semantics-selectors/\">HTML Semantics and CSS Selectors</a></strong><br>\nIf you&rsquo;re not fully using <strong>all three languages</strong> on the front end &ndash; HTML, CSS, and JavaScript &ndash; you&rsquo;re missing out on opportunities to make pages more accessible, more compact, and more understandable to humans and robots.</p>\n\n<p>Unfortunately, most of today&rsquo;s education focuses solely on JavaScript, with a mere nod to HTML and CSS. The result is developer burnout, too much churn in frontend web development, and an obsession with the latest hottest framework. Twitter is rife with developers trashing HTML and CSS, wanting to turn the web into an exclusive JavaScript paradise.</p>\n\n<p>What is most of this animosity based in? A fundamental non-understanding of HTML and CSS. This workshop focuses on all of those pieces you missed at bootcamp back in the day. How do we mark up content semantically? How can we leverage selectors to select what&rsquo;s in front of us, using classes as a last resort? Finally, participate in the No-Class Challenge: Styling a web page using semantic markup and without the use of classes.</p>\n",
				"content_text": "I have planned my first trip in over a year, pending my full vaccination... which looks increasingly likely!\n\nI'm headed to Minneapolis to give two workshops with Frontend Masters.\n\n<strong>August 18-19: [Responsive Web Design with Flexbox & CSS Grid, v2] (https://frontendmasters.com/workshops/grid-flexbox-v2/) </strong><br>\nAll things responsive design covered here, including Flexbox, Grid, responsive image approaches and solutions, grid systems, and plenty of exercises and challenges along the way. This updates the original course recorded in 2017 with lots of new information, approaches, and CSS properties. As always, there's a healthy dose of HTML semantics and CSS selectors and specificity along the way.\n\n<strong>October 14: [HTML Semantics and CSS Selectors] (https://frontendmasters.com/workshops/semantics-selectors/)</strong><br>\nIf you're not fully using **all three languages** on the front end -- HTML, CSS, and JavaScript -- you're missing out on opportunities to make pages more accessible, more compact, and more understandable to humans and robots.\n\nUnfortunately, most of today's education focuses solely on JavaScript, with a mere nod to HTML and CSS. The result is developer burnout, too much churn in frontend web development, and an obsession with the latest hottest framework. Twitter is rife with developers trashing HTML and CSS, wanting to turn the web into an exclusive JavaScript paradise.\n\nWhat is most of this animosity based in? A fundamental non-understanding of HTML and CSS. This workshop focuses on all of those pieces you missed at bootcamp back in the day. How do we mark up content semantically? How can we leverage selectors to select what's in front of us, using classes as a last resort? Finally, participate in the No-Class Challenge: Styling a web page using semantic markup and without the use of classes.\n\n\n\n",
				"date_published": "2021-03-10T12:54:00-04:00",
				"url": "http://learnnocode.dev/2021/03/10/upcoming-frontend-masters.html",
				"tags": ["Course release"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/09/new-linkedin-learning.html",
				"title": "New LinkedIn Learning course release: HTML and CSS Linking",
				"content_html": "<p><img src=\"uploads/2021/3025a4a0f0.jpg\" width=\"600\" height=\"337\" alt=\"HTML and CSS: Links course at LinkedIn Learning. \" /></p>\n\n<p><a href=\"https://www.linkedin.com/learning/html-and-css-linking\">HTML and CSS: Linking</a></p>\n\n<blockquote>\n  Hyperlinks are the foundation of the World Wide Web, but they come in many different flavors. Do you want to link to a specific point in a document? Make a phone call, or send an email? Link from images or dedicated navigation bars instead of text? In this course, instructor Jen Kramer gives you all the tools you need to make those tasks easy. Jen goes over basic links, linking to different files and resources, and linking from images, headers, text, and more. She shows you how you can style links and individual link states using CSS selectors, then goes into how you can make exceptions and create different styles. Jen covers the steps you should take to maintain links and redirect them when necessary.</blockquote>\n  \n\n<p>When LinkedIn asked me to put together a course on links, I thought it was a ridiculous idea. How much could be said about links?</p>\n\n<p>Then I started spelling out All The Things:</p>\n\n<ul>\n<li><p>Linking to pages within your site and pages elsewhere on the internet, in new windows/tabs and the same window/tab.</p></li>\n\n<li><p>Links to other things: PDFs and other documents, email addresses, phone numbers.</p></li>\n\n<li><p>Links within the same document (back to top links, links to sections of the page).</p></li>\n\n<li><p>Images as the item to click on to load a link, instead of text.</p></li>\n\n<li><p>Image maps, in which one image contains more than one link.</p></li>\n\n<li><p>The five states of a link for styling purposes: unvisited, visited, hover, active (once the link is clicked but before the page loads), and focus (when the link is selected but not yet clicked).</p></li>\n\n<li><p>Navigation bars, horizontal and vertical.</p></li>\n\n<li><p>Styling text links to look like buttons.</p></li>\n\n<li><p>Checking for link rot.</p></li>\n\n<li><p>Using a robots.txt file to control search engine movement in a site.</p></li>\n\n<li><p>Redirects, both client-side (meta tag) and server-side (301, 302, etc).</p></li>\n</ul>\n\n<p>Basically, there&rsquo;s a whole universe of links, and this is the course that covers it all.</p>\n",
				"content_text": "<img src=\"uploads/2021/3025a4a0f0.jpg\" width=\"600\" height=\"337\" alt=\"HTML and CSS: Links course at LinkedIn Learning. \" />\n\n[HTML and CSS: Linking] (https://www.linkedin.com/learning/html-and-css-linking)\n\n<blockquote>\n  Hyperlinks are the foundation of the World Wide Web, but they come in many different flavors. Do you want to link to a specific point in a document? Make a phone call, or send an email? Link from images or dedicated navigation bars instead of text? In this course, instructor Jen Kramer gives you all the tools you need to make those tasks easy. Jen goes over basic links, linking to different files and resources, and linking from images, headers, text, and more. She shows you how you can style links and individual link states using CSS selectors, then goes into how you can make exceptions and create different styles. Jen covers the steps you should take to maintain links and redirect them when necessary.</blockquote>\n  \n  When LinkedIn asked me to put together a course on links, I thought it was a ridiculous idea. How much could be said about links? \n  \n  Then I started spelling out All The Things:\n  \n  * Linking to pages within your site and pages elsewhere on the internet, in new windows/tabs and the same window/tab.\n  \n  * Links to other things: PDFs and other documents, email addresses, phone numbers. \n  \n  * Links within the same document (back to top links, links to sections of the page).\n  \n  * Images as the item to click on to load a link, instead of text. \n  \n  * Image maps, in which one image contains more than one link.\n  \n  * The five states of a link for styling purposes: unvisited, visited, hover, active (once the link is clicked but before the page loads), and focus (when the link is selected but not yet clicked).\n  \n  * Navigation bars, horizontal and vertical.\n  \n  * Styling text links to look like buttons.\n  \n  * Checking for link rot.\n  \n  * Using a robots.txt file to control search engine movement in a site.\n  \n  * Redirects, both client-side (meta tag) and server-side (301, 302, etc).\n  \n  \n  Basically, there's a whole universe of links, and this is the course that covers it all.\n  \n",
				"date_published": "2021-03-09T16:58:00-04:00",
				"url": "http://learnnocode.dev/2021/03/09/new-linkedin-learning.html",
				"tags": ["Course release"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/06/year-one-pandemic.html",
				"title": "Year One Pandemic Reflections",
				"content_html": "<p>What was happening on March 6, 2020, one year ago today?</p>\n\n<p>I was preparing for a 3-leg trip from Boston. First stop was Portland, Oregon, for the SIGCSE conference. After the conference, I was heading south to California for some LinkedIn Learning recording. After some time there, I was headed to Arizona to visit my parents at their retirement community.</p>\n\n<p>I was anxious about this trip. Because I was scheduled to be gone from March 11-24, I was worried that the airlines might shut down along the way. Maybe some element of the trip would be cancelled, but others would continue.</p>\n\n<p>On March 6 at 10 AM, I was getting what would become my last haircut for 2020.</p>\n\n<p>By that afternoon, Harvard announced they would not allow non-essential academic travel in the US. (They&rsquo;d stopped allowing international travel a few weeks prior.) In other words, my participation in SIGCSE was no longer happening.</p>\n\n<p>By March 9, LinkedIn had cancelled my trip for the following week.</p>\n\n<p>Cancelling the trip to see my parents was a no-brainer. I could not live with myself if I brought them the virus. As it turned out, their retirement community closed to visitors around March 16.</p>\n\n<p>Of course, this was just the beginning. Many more trips would be cancelled along the way, including a birthday trip to Europe, conference trips, and video recording trips. It was a year without music, as all of my music groups cancelled rehearsals, concerts, and whole seasons of performance. It was a year without family. Indeed, I last saw my family in August 2019. It may be 2 years before I see them, possibly longer.</p>\n",
				"content_text": "What was happening on March 6, 2020, one year ago today?\n\nI was preparing for a 3-leg trip from Boston. First stop was Portland, Oregon, for the SIGCSE conference. After the conference, I was heading south to California for some LinkedIn Learning recording. After some time there, I was headed to Arizona to visit my parents at their retirement community.\n\nI was anxious about this trip. Because I was scheduled to be gone from March 11-24, I was worried that the airlines might shut down along the way. Maybe some element of the trip would be cancelled, but others would continue. \n\nOn March 6 at 10 AM, I was getting what would become my last haircut for 2020.\n\nBy that afternoon, Harvard announced they would not allow non-essential academic travel in the US. (They'd stopped allowing international travel a few weeks prior.) In other words, my participation in SIGCSE was no longer happening.\n\nBy March 9, LinkedIn had cancelled my trip for the following week.\n\nCancelling the trip to see my parents was a no-brainer. I could not live with myself if I brought them the virus. As it turned out, their retirement community closed to visitors around March 16.\n\nOf course, this was just the beginning. Many more trips would be cancelled along the way, including a birthday trip to Europe, conference trips, and video recording trips. It was a year without music, as all of my music groups cancelled rehearsals, concerts, and whole seasons of performance. It was a year without family. Indeed, I last saw my family in August 2019. It may be 2 years before I see them, possibly longer.\n",
				"date_published": "2021-03-06T15:03:00-04:00",
				"url": "http://learnnocode.dev/2021/03/06/year-one-pandemic.html",
				"tags": ["Personal reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/05/teaching-reflections-paintbynumber.html",
				"title": "Teaching reflections #12: Paint-by-number as mental model",
				"content_html": "<p>Remember paint-by-number as a kid? There was a black and white drawing of something, sprinkled with numbers. The numbers correspond to the paint colors. Match the paint color to the numbers in the drawing, and presto, instant masterpiece.</p>\n\n<p><img src=\"uploads/2021/da7c587acb.jpg\" width=\"400\" height=\"266\" alt=\"Sample paint by number graphic.\" /></p>\n\n<p>This is the <a href=\"https://jamesclear.com/feynman-mental-models\">mental model</a> of many people creating websites, flyers for the bake sale, and other digital communications. Find the template you need, drop in your own information, and presto, instant masterpiece.</p>\n\n<p>Only in both cases, it&rsquo;s not really a masterpiece.</p>\n\n<p>With paint-by-number, painters get the joy of doing the painting without doing the work of visualizing something and mastering painting technique to produce the thing.</p>\n\n<p>With a Microsoft Word template, there may be a match to what the user wants to convey. An event flyer to hang in a coffee shop or library contains all of the same information: event title, time/date/location/cost, brief description of what happens and what will be experienced, contact information for questions, and an eye-catching graphic. Of course, the flyer looks similar to other fliers on the bulletin board, because everyone is using similar templates. But it may accomplish its goal.</p>\n\n<p>With websites, templates provide a way for many to structure their content. They don&rsquo;t quite know what to say, or how to say it, but they need a website. They pick a template, fill in the information to the best of their ability, and hope it works well enough to accomplish their goal(s).</p>\n\n<p>Creating a method(s) to guide someone through the thinking process about a problem at hand is incredibly difficult. We get distracted by the &ldquo;edge cases,&rdquo; the 20% of cases when the process doesn&rsquo;t work, rather than the 80% of cases where it does.</p>\n\n<p>Refining the method to a fill-in-the-blank document, workbook, or template is another layer of abstraction where another 20% of cases are lost along the way.</p>\n\n<p><strong>Structured thinking about a problem is really difficult. If you can refine your methods for approaching a problem into a paint-by-number solution, people will pay lots of money for it, even if it&rsquo;s not perfect.</strong></p>\n",
				"content_text": "Remember paint-by-number as a kid? There was a black and white drawing of something, sprinkled with numbers. The numbers correspond to the paint colors. Match the paint color to the numbers in the drawing, and presto, instant masterpiece.\n\n<img src=\"uploads/2021/da7c587acb.jpg\" width=\"400\" height=\"266\" alt=\"Sample paint by number graphic.\" />\n\nThis is the [mental model] (https://jamesclear.com/feynman-mental-models) of many people creating websites, flyers for the bake sale, and other digital communications. Find the template you need, drop in your own information, and presto, instant masterpiece. \n\nOnly in both cases, it's not really a masterpiece.\n\nWith paint-by-number, painters get the joy of doing the painting without doing the work of visualizing something and mastering painting technique to produce the thing.\n\nWith a Microsoft Word template, there may be a match to what the user wants to convey. An event flyer to hang in a coffee shop or library contains all of the same information: event title, time/date/location/cost, brief description of what happens and what will be experienced, contact information for questions, and an eye-catching graphic. Of course, the flyer looks similar to other fliers on the bulletin board, because everyone is using similar templates. But it may accomplish its goal.\n\nWith websites, templates provide a way for many to structure their content. They don't quite know what to say, or how to say it, but they need a website. They pick a template, fill in the information to the best of their ability, and hope it works well enough to accomplish their goal(s).\n\nCreating a method(s) to guide someone through the thinking process about a problem at hand is incredibly difficult. We get distracted by the \"edge cases,\" the 20% of cases when the process doesn't work, rather than the 80% of cases where it does.\n\nRefining the method to a fill-in-the-blank document, workbook, or template is another layer of abstraction where another 20% of cases are lost along the way.\n\n**Structured thinking about a problem is really difficult. If you can refine your methods for approaching a problem into a paint-by-number solution, people will pay lots of money for it, even if it's not perfect.**\n",
				"date_published": "2021-03-05T12:02:00-04:00",
				"url": "http://learnnocode.dev/2021/03/05/teaching-reflections-paintbynumber.html",
				"tags": ["Teaching Tips","Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/03/teaching-reflections-the.html",
				"title": "Teaching reflections #11: The turn-in sheet",
				"content_html": "<p>In recent years, I&rsquo;ve started creating &ldquo;turn-in sheets&rdquo; with my assignments in academic land.</p>\n\n<p>My assignments spell out what I want students to do for a graded project.</p>\n\n<p>The turn-in sheet structures their answers. It ensures that they&rsquo;ve hit everything that I wanted them to address in their work.</p>\n\n<p>Originally, I asked students to do this to streamline grading. When I ask for use of certain structures or functionalities when building a web page, I do not want to dig through each site to find the thing. I definitely don&rsquo;t want to dig through tons of code to find relevant lines. The turn-in sheet asked the student to tell me where all of the things were that they needed to address in the assignment.</p>\n\n<p>Later, I realized these turn-in sheets serve more functions than this.</p>\n\n<ul>\n<li><p>Student anxiety is reduced, because they know they&rsquo;ve addressed all aspects of the project by completing the turn-in sheet.</p></li>\n\n<li><p>Students were more likely to reflect on their work, because it was clearer to them what they accomplished when it was formatted well.</p></li>\n\n<li><p>It helped to cut down on cheating. This was completely unexpected! When students have to explain where to find an example of X programming structure, they must understand the code they steal. I still remember the student who stole a 12-column layout and claimed it was a 4-column layout. We caught it because the student didn&rsquo;t understand the stolen code and pointed us to exactly where the plagiarism happened.</p></li>\n</ul>\n\n<p>Turn-in sheets and course workbooks help to make intangible skills like programming feel more real. They organize thinking. And they may make your grading life easier, too. Try this for your next course.</p>\n",
				"content_text": "In recent years, I've started creating \"turn-in sheets\" with my assignments in academic land. \n\nMy assignments spell out what I want students to do for a graded project.\n\nThe turn-in sheet structures their answers. It ensures that they've hit everything that I wanted them to address in their work. \n\nOriginally, I asked students to do this to streamline grading. When I ask for use of certain structures or functionalities when building a web page, I do not want to dig through each site to find the thing. I definitely don't want to dig through tons of code to find relevant lines. The turn-in sheet asked the student to tell me where all of the things were that they needed to address in the assignment.\n\nLater, I realized these turn-in sheets serve more functions than this.\n\n* Student anxiety is reduced, because they know they've addressed all aspects of the project by completing the turn-in sheet.\n\n* Students were more likely to reflect on their work, because it was clearer to them what they accomplished when it was formatted well.\n\n* It helped to cut down on cheating. This was completely unexpected! When students have to explain where to find an example of X programming structure, they must understand the code they steal. I still remember the student who stole a 12-column layout and claimed it was a 4-column layout. We caught it because the student didn't understand the stolen code and pointed us to exactly where the plagiarism happened.\n\nTurn-in sheets and course workbooks help to make intangible skills like programming feel more real. They organize thinking. And they may make your grading life easier, too. Try this for your next course.\n",
				"date_published": "2021-03-03T12:38:40-04:00",
				"url": "http://learnnocode.dev/2021/03/03/teaching-reflections-the.html",
				"tags": ["Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/03/a-video-is.html",
				"title": "A video is not a course",
				"content_html": "<p><a href=\"https://www.linkedin.com/learning/instructors/jen-kramer?u=2125562\">I&rsquo;ve created &ldquo;courses&rdquo; at LinkedIn Learning</a>  since 2008, when the company was called Lynda.com. Lynda.com was one of the earliest, if not the first, video training companies out there.</p>\n\n<p>Their course format is a series of short videos. One video segment may lead into another, but fundamentally, each segment stands alone as a unit. After (theoretically) watching the videos, you receive a certificate of completion which you may attached to your LinkedIn profile.</p>\n\n<p>Theoretically, because you can get this certificate simply by streaming the videos in the background, on mute.</p>\n\n<p>Theoretically, because there&rsquo;s no transference of skills happening to one&rsquo;s own projects or situation, no reflection on the learning process, nor is there a meaningful evaluation of learning for either the learner or the instructor. LinkedIn Learning is aware of this issue and they continue to work on ways to solve it.</p>\n\n<p>However, the genie is out of the bottle, so to speak. The LinkedIn Learning/Lynda.com &ldquo;course&rdquo; has become a misnomer that others try to emulate.</p>\n\n<p><img src=\"uploads/2021/4ac7057230.jpg\" width=\"426\" height=\"284\" alt=\"\" />\n<em>Photo by <a href=\"https://www.pexels.com/photo/confident-elegant-lady-in-eyeglasses-hosting-webinar-4491461/\" target=\"_blank\">Karolina Grabowska</a> from Pexels</em></p>\n\n<h3>This is not a course</h3>\n\n<p>In the explosion of online courses offered all over the internet, a &ldquo;course&rdquo; is now a series of videos hidden behind a login. Pay your money and get a handful of overproduced videos that cover your area of interest.</p>\n\n<p>Then the creators wonder why students aren&rsquo;t learning the material, or wondering why sales have dropped. Currently, creators turn to more bells and whistles in the videos, more animation, more attempts to make &ldquo;edutainment&rdquo; rather than solid education.</p>\n\n<p>Even if your course is an asynchronous, instructor-absent course, where students move through it at their own pace, you need more than video to truly make a course.</p>\n\n<h3>When videos become a course</h3>\n\n<p>Videos are awesome for demonstrating something. However, they&rsquo;re terrible for transferring knowledge to a new environment. They&rsquo;re not good for measuring what you&rsquo;ve learned. Consider how often you watched someone do something and you think, &ldquo;that doesn&rsquo;t look so hard.&rdquo; Then you try it, and you quickly discover that you have no idea what you&rsquo;re doing.</p>\n\n<p>Yes, have videos in your course. No, videos aren&rsquo;t the whole course. You need more to round out the learning experience. Here&rsquo;s some suggestions.</p>\n\n<h3>Quizzes and games</h3>\n\n<p>Add self-graded quizzes to evaluate student&rsquo;s assimilation of the video. These don&rsquo;t have to be standard-issue multiple choice. Consider matching games, categorization games, and formats that involve photos, not just words. This type of evaluation is best for terminology or other behaviorist &ldquo;you just gotta know this&rdquo; material.</p>\n\n<h3>I do it, we do it, you do it</h3>\n\n<p>In your video, demonstrate how to do the thing you&rsquo;re teaching. Ideally, students are following along with you, doing the same thing.</p>\n\n<p>Now provide your students with the assets they need to do the same type of thing on their own. You provide the structure to think about the problem, the goal they&rsquo;re trying to achieve, and any boundaries and guidelines for where they should focus their attention. Follow this up with a video explaining how you solved the problem. Bonus: have a discussion thread where students may post photos or links to their work, along with a brief reflection &ndash; what went well? Where did they get stuck? What do they still not understand? What would they do differently next time?</p>\n\n<p>Finally, invite the students to do the thing on their own. Provide a separate discussion thread where they can show off their work. Again, encourage reflection, not just &ldquo;this is my thing.&rdquo;</p>\n\n<p>The middle step is the most important, because this is when transference happens. By giving them a small project with everything they need to succeed, this is where students gain confidence or realize they need more help in a certain area. They get a sense of what&rsquo;s required to do the thing on their own.</p>\n\n<p>Incidentally, the middle step is the piece that&rsquo;s missing in almost every course out there. It&rsquo;s definitely missing in every software course. And it&rsquo;s super critical for understanding how to program.</p>\n\n<h3>Workbooks provide structure</h3>\n\n<p>When students learn something new, they&rsquo;re not only learning the buttons to click, or the syntax, or the structure. They are also learning the organizational tools and thinking processes that go with the thing they&rsquo;re learning.</p>\n\n<p><strong>This is one of the most overlooked aspects of teaching.</strong> Students of all abilities and intelligence have an issue with this. My Harvard students had as difficult a time knowing where to start a project as students did at any other university where I&rsquo;ve taught.</p>\n\n<p>Give people a structure for thinking about the problem at hand. If it&rsquo;s a 5-step process, the workbook contains those 5 steps written out, along with whatever questions they should address and a space to write. Include reflection questions. Include suggestions for making the activity more challenging or less challenging.</p>\n\n<p>Surprisingly, even in our digital age, people do not mind printing a workbook and writing all over it. In fact, many prefer this methodology, because they feel like they have a tangible asset after class is done.</p>\n\n<p>Hopefully some or all of these tips help you raise your online video series to a full course.</p>\n",
				"content_text": "[I've created \"courses\" at LinkedIn Learning] (https://www.linkedin.com/learning/instructors/jen-kramer?u=2125562)  since 2008, when the company was called Lynda.com. Lynda.com was one of the earliest, if not the first, video training companies out there. \n\nTheir course format is a series of short videos. One video segment may lead into another, but fundamentally, each segment stands alone as a unit. After (theoretically) watching the videos, you receive a certificate of completion which you may attached to your LinkedIn profile.\n\nTheoretically, because you can get this certificate simply by streaming the videos in the background, on mute.\n\nTheoretically, because there's no transference of skills happening to one's own projects or situation, no reflection on the learning process, nor is there a meaningful evaluation of learning for either the learner or the instructor. LinkedIn Learning is aware of this issue and they continue to work on ways to solve it.\n\nHowever, the genie is out of the bottle, so to speak. The LinkedIn Learning/Lynda.com \"course\" has become a misnomer that others try to emulate.\n\n<img src=\"uploads/2021/4ac7057230.jpg\" width=\"426\" height=\"284\" alt=\"\" />\n*Photo by <a href=\"https://www.pexels.com/photo/confident-elegant-lady-in-eyeglasses-hosting-webinar-4491461/\" target=\"_blank\">Karolina Grabowska</a> from Pexels*\n\n<h3>This is not a course</h3>\n\nIn the explosion of online courses offered all over the internet, a \"course\" is now a series of videos hidden behind a login. Pay your money and get a handful of overproduced videos that cover your area of interest. \n\nThen the creators wonder why students aren't learning the material, or wondering why sales have dropped. Currently, creators turn to more bells and whistles in the videos, more animation, more attempts to make \"edutainment\" rather than solid education.\n\nEven if your course is an asynchronous, instructor-absent course, where students move through it at their own pace, you need more than video to truly make a course.\n\n<h3>When videos become a course</h3>\n\nVideos are awesome for demonstrating something. However, they're terrible for transferring knowledge to a new environment. They're not good for measuring what you've learned. Consider how often you watched someone do something and you think, \"that doesn't look so hard.\" Then you try it, and you quickly discover that you have no idea what you're doing.\n\nYes, have videos in your course. No, videos aren't the whole course. You need more to round out the learning experience. Here's some suggestions.\n\n<h3>Quizzes and games</h3>\n\nAdd self-graded quizzes to evaluate student's assimilation of the video. These don't have to be standard-issue multiple choice. Consider matching games, categorization games, and formats that involve photos, not just words. This type of evaluation is best for terminology or other behaviorist \"you just gotta know this\" material.\n\n<h3>I do it, we do it, you do it</h3>\n\nIn your video, demonstrate how to do the thing you're teaching. Ideally, students are following along with you, doing the same thing.\n\nNow provide your students with the assets they need to do the same type of thing on their own. You provide the structure to think about the problem, the goal they're trying to achieve, and any boundaries and guidelines for where they should focus their attention. Follow this up with a video explaining how you solved the problem. Bonus: have a discussion thread where students may post photos or links to their work, along with a brief reflection -- what went well? Where did they get stuck? What do they still not understand? What would they do differently next time?\n\nFinally, invite the students to do the thing on their own. Provide a separate discussion thread where they can show off their work. Again, encourage reflection, not just \"this is my thing.\"\n\nThe middle step is the most important, because this is when transference happens. By giving them a small project with everything they need to succeed, this is where students gain confidence or realize they need more help in a certain area. They get a sense of what's required to do the thing on their own.\n\nIncidentally, the middle step is the piece that's missing in almost every course out there. It's definitely missing in every software course. And it's super critical for understanding how to program.\n\n<h3>Workbooks provide structure</h3>\n\nWhen students learn something new, they're not only learning the buttons to click, or the syntax, or the structure. They are also learning the organizational tools and thinking processes that go with the thing they're learning.\n\n**This is one of the most overlooked aspects of teaching.** Students of all abilities and intelligence have an issue with this. My Harvard students had as difficult a time knowing where to start a project as students did at any other university where I've taught. \n\nGive people a structure for thinking about the problem at hand. If it's a 5-step process, the workbook contains those 5 steps written out, along with whatever questions they should address and a space to write. Include reflection questions. Include suggestions for making the activity more challenging or less challenging. \n\nSurprisingly, even in our digital age, people do not mind printing a workbook and writing all over it. In fact, many prefer this methodology, because they feel like they have a tangible asset after class is done.\n\nHopefully some or all of these tips help you raise your online video series to a full course.\n",
				"date_published": "2021-03-03T12:23:00-04:00",
				"url": "http://learnnocode.dev/2021/03/03/a-video-is.html",
				"tags": ["Teaching Tips","Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/01/teaching-reflections-the.html",
				"title": "Teaching reflections #10: The same material must be re-discovered across disciplines",
				"content_html": "<p>If I had to describe my <a href=\"https://en.wikipedia.org/wiki/T-shaped_skills\">T-shaped skills</a>, I&rsquo;d say my depth is in HTML/CSS and user interface design. Across the top, you&rsquo;d find planning websites and UX, teaching skills, instructional design skills, marketing, and general technology skills &ndash; the ability to look at new software, figure it out, and apply it to a problem.</p>\n\n<p>As I move into the no-code world, I&rsquo;m watching a new group of people relearn the issues we already learned and understand well in the professional website world, the marketing world, and in the world of UX.</p>\n\n<p>Today I watched someone define a target audience as &ldquo;non-developers.&rdquo;</p>\n\n<p>Cool. We&rsquo;ve left out the 0.3% of the population who are coders. That leaves 99.7% of the world left as a target audience. This is too broad.</p>\n\n<p>Defining and targeting an audience for products is something already well-known to the world of marketing and user experience. However, the no-code world doesn&rsquo;t know this work exists and has no idea how to apply it to what they do.</p>\n\n<p>We see this in the coding world. People complain about how tired they are about coding solutions to their problems, maintaining those solutions, and so forth.</p>\n\n<p>However, if you mention &ldquo;no-code&rdquo; to the coding world, they have no idea what you mean. They may also dismiss this out of hand as too trivial for their attention.</p>\n\n<p>For those who are looking at new emerging sectors, see if you can identify what that sector currently struggles with knowing and mastering.</p>\n\n<p>The no-code space current worries with user experience, marketing concepts, and project management. &ldquo;Agile methodology for no-code&rdquo; is a no-brainer for this space. No-coders need to know project management, but everything is currently framed with coding in mind.</p>\n\n<p>User experience is framed with code in mind too, even though UX is a no-code world! What happens if you plan a product and hand it off to no-coders to implement? Nothing. It&rsquo;s the same process you&rsquo;d use for coding. But when you&rsquo;re not using the language your audience speaks, then it feels like your concepts are inaccessible and unintuitive.</p>\n\n<p>Speaking to your target audience is everything. When knowledge is locked up in the jargon of a specific discipline, it&rsquo;s not transferable to others.</p>\n\n<p>How can you make your work accessible to adjacent disciplines? How can you codify what you know into a framework that applies to cousins of your areas of interest?</p>\n\n<p>Honestly, the last thing we need are the 24-year olds who discovered no-code during the pandemic to teach people how to build no-code products. They don&rsquo;t have the background to do it well.</p>\n",
				"content_text": "If I had to describe my [T-shaped skills] (https://en.wikipedia.org/wiki/T-shaped_skills), I'd say my depth is in HTML/CSS and user interface design. Across the top, you'd find planning websites and UX, teaching skills, instructional design skills, marketing, and general technology skills -- the ability to look at new software, figure it out, and apply it to a problem.\n\nAs I move into the no-code world, I'm watching a new group of people relearn the issues we already learned and understand well in the professional website world, the marketing world, and in the world of UX.\n\nToday I watched someone define a target audience as \"non-developers.\"\n\nCool. We've left out the 0.3% of the population who are coders. That leaves 99.7% of the world left as a target audience. This is too broad.\n\nDefining and targeting an audience for products is something already well-known to the world of marketing and user experience. However, the no-code world doesn't know this work exists and has no idea how to apply it to what they do.\n\nWe see this in the coding world. People complain about how tired they are about coding solutions to their problems, maintaining those solutions, and so forth. \n\nHowever, if you mention \"no-code\" to the coding world, they have no idea what you mean. They may also dismiss this out of hand as too trivial for their attention.\n\nFor those who are looking at new emerging sectors, see if you can identify what that sector currently struggles with knowing and mastering.\n\nThe no-code space current worries with user experience, marketing concepts, and project management. \"Agile methodology for no-code\" is a no-brainer for this space. No-coders need to know project management, but everything is currently framed with coding in mind. \n\nUser experience is framed with code in mind too, even though UX is a no-code world! What happens if you plan a product and hand it off to no-coders to implement? Nothing. It's the same process you'd use for coding. But when you're not using the language your audience speaks, then it feels like your concepts are inaccessible and unintuitive.\n\nSpeaking to your target audience is everything. When knowledge is locked up in the jargon of a specific discipline, it's not transferable to others. \n\nHow can you make your work accessible to adjacent disciplines? How can you codify what you know into a framework that applies to cousins of your areas of interest?\n\nHonestly, the last thing we need are the 24-year olds who discovered no-code during the pandemic to teach people how to build no-code products. They don't have the background to do it well. \n",
				"date_published": "2021-03-01T12:18:05-04:00",
				"url": "http://learnnocode.dev/2021/03/01/teaching-reflections-the.html",
				"tags": ["Teaching Tips","Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/03/01/teaching-reflections-crossdiscipline.html",
				"title": "Teaching reflections #9: Cross-discipline sharing is where it's at ",
				"content_html": "<p>I was speaking with an English professor the other day. She was discussing how online teaching has changed her approach to class.</p>\n\n<p>Previously, she&rsquo;d have individual conversations with students about improving their writing. Now she has those conversations publicly, with all students in attendance on Zoom. She was particularly concerned about constructive critique and not embarrassing students.</p>\n\n<p>I said, &ldquo;Sounds like a music master class. Only you&rsquo;re doing it with writing.&rdquo;</p>\n\n<p>In a music master class, a form that has been part of classical music teaching for centuries, a well-known and well-respected audience teaches a lesson from the stage. There are a handful of performers, playing a piece they&rsquo;ve worked on for some time. The artist works with the student for a period of time, often 15-20 minutes. Typically, the artist focuses on one aspect of the student&rsquo;s playing; often it&rsquo;s the artistry that gets attention rather than the mechanics of notes and rhythms.</p>\n\n<p>The audience gets enormous benefit from this:</p>\n\n<ul>\n<li><p>They learn how a master performer thinks about and approaches a given piece of music.</p></li>\n\n<li><p>They see teaching techniques on display, including how the student responds and improves to suggestions.</p></li>\n\n<li><p>The audience may take some of the lessons back to their own playing in a moment of transferance.</p></li>\n\n<li><p>The audience also listens critically, comparing their own performance of the same piece to the student&rsquo;s and the artist&rsquo;s work. Is there anything the audience member might take to improve their own work?</p></li>\n\n<li><p>The audience also gets moments of critical thinking &ndash; do they agree with the artist&rsquo;s analysis of the student? Many critiques are art, so there is no &ldquo;correct&rdquo; answer.</p></li>\n</ul>\n\n<p>In an academic environment, the English department would rarely (never?) overlap with the music department. Indeed, academics who attempt to be &ldquo;cross-discipline&rdquo; often are penalized in promotions and tenure decisions. However, her husband is a musician, and she understood the parallel to the master class having attended a few with him.</p>\n\n<p>Imagine how English class might change if they took more teaching tips from the music department.</p>\n",
				"content_text": "I was speaking with an English professor the other day. She was discussing how online teaching has changed her approach to class.\n\nPreviously, she'd have individual conversations with students about improving their writing. Now she has those conversations publicly, with all students in attendance on Zoom. She was particularly concerned about constructive critique and not embarrassing students.\n\nI said, \"Sounds like a music master class. Only you're doing it with writing.\"\n\nIn a music master class, a form that has been part of classical music teaching for centuries, a well-known and well-respected audience teaches a lesson from the stage. There are a handful of performers, playing a piece they've worked on for some time. The artist works with the student for a period of time, often 15-20 minutes. Typically, the artist focuses on one aspect of the student's playing; often it's the artistry that gets attention rather than the mechanics of notes and rhythms.\n\nThe audience gets enormous benefit from this:\n\n* They learn how a master performer thinks about and approaches a given piece of music.\n\n* They see teaching techniques on display, including how the student responds and improves to suggestions.\n\n* The audience may take some of the lessons back to their own playing in a moment of transferance.\n\n* The audience also listens critically, comparing their own performance of the same piece to the student's and the artist's work. Is there anything the audience member might take to improve their own work?\n\n* The audience also gets moments of critical thinking -- do they agree with the artist's analysis of the student? Many critiques are art, so there is no \"correct\" answer. \n\nIn an academic environment, the English department would rarely (never?) overlap with the music department. Indeed, academics who attempt to be \"cross-discipline\" often are penalized in promotions and tenure decisions. However, her husband is a musician, and she understood the parallel to the master class having attended a few with him.\n\nImagine how English class might change if they took more teaching tips from the music department.\n\n",
				"date_published": "2021-03-01T11:50:00-04:00",
				"url": "http://learnnocode.dev/2021/03/01/teaching-reflections-crossdiscipline.html",
				"tags": ["Teaching Tips","Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/19/humanistic-elements-in.html",
				"title": "Humanistic elements in education",
				"content_html": "<p>Below is a recent thread about what makes a good online course. Click through to read the whole thing.</p>\n\n<p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In the last 2 years, I’ve gone through 8 online courses but completed only two: WoP by <a href=\"https://twitter.com/david_perell?ref_src=twsrc%5Etfw\">@David_perell</a> and BASB by <a href=\"https://twitter.com/fortelabs?ref_src=twsrc%5Etfw\">@fortelabs</a>. What makes them different and what can other course creators learn? Here are 11 components for creating a next-level online learning experience:</p>&mdash; Julia Saxena 🚀🚢 (@julia_saxena) <a href=\"https://twitter.com/julia_saxena/status/1292005740073213953?ref_src=twsrc%5Etfw\">August 8, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n\n<p>Main points the author hits include:</p>\n\n<ul>\n<li><p>Measurement of progress</p></li>\n\n<li><p>Collaborative learning and feedback</p></li>\n\n<li><p>Proper use of technology (like breakout rooms)</p></li>\n</ul>\n\n<p>But her first item was this:</p>\n\n<p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1. Onboarding: Before the course starts, let students reflect on their intention and goals. Measure their current state to show them where they are now. Then measure again at the end to show progress.</p>&mdash; Julia Saxena 🚀🚢 (@julia_saxena) <a href=\"https://twitter.com/julia_saxena/status/1292005742442975232?ref_src=twsrc%5Etfw\">August 8, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n\n<p>This is the definition of <a href=\"https://www.wgu.edu/blog/what-humanistic-learning-theory-education2007.html\">humanistic learning theory</a>. The learner should have their own goals and <a href=\"https://facultyweb.cortland.edu/andersmd/HUMAN/PRINC.HTML\">grades are irrelevant</a>. Measuring their own learning is important.</p>\n\n<p>This can be implemented by giving the same quiz at the beginning and end of the course, so students can measure learning in a firm way. Or it can be mushier &ndash; asking students to reflect on what they&rsquo;ve learned is one way of doing this.</p>\n",
				"content_text": "Below is a recent thread about what makes a good online course. Click through to read the whole thing.\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In the last 2 years, I’ve gone through 8 online courses but completed only two: WoP by <a href=\"https://twitter.com/david_perell?ref_src=twsrc%5Etfw\">@David_perell</a> and BASB by <a href=\"https://twitter.com/fortelabs?ref_src=twsrc%5Etfw\">@fortelabs</a>. What makes them different and what can other course creators learn? Here are 11 components for creating a next-level online learning experience:</p>&mdash; Julia Saxena 🚀🚢 (@julia_saxena) <a href=\"https://twitter.com/julia_saxena/status/1292005740073213953?ref_src=twsrc%5Etfw\">August 8, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\nMain points the author hits include:\n\n* Measurement of progress\n\n* Collaborative learning and feedback\n\n* Proper use of technology (like breakout rooms)\n\nBut her first item was this:\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">1. Onboarding: Before the course starts, let students reflect on their intention and goals. Measure their current state to show them where they are now. Then measure again at the end to show progress.</p>&mdash; Julia Saxena 🚀🚢 (@julia_saxena) <a href=\"https://twitter.com/julia_saxena/status/1292005742442975232?ref_src=twsrc%5Etfw\">August 8, 2020</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\nThis is the definition of [humanistic learning theory] (https://www.wgu.edu/blog/what-humanistic-learning-theory-education2007.html). The learner should have their own goals and [grades are irrelevant] (https://facultyweb.cortland.edu/andersmd/HUMAN/PRINC.HTML). Measuring their own learning is important. \n\nThis can be implemented by giving the same quiz at the beginning and end of the course, so students can measure learning in a firm way. Or it can be mushier -- asking students to reflect on what they've learned is one way of doing this.\n",
				"date_published": "2021-02-19T15:59:09-04:00",
				"url": "http://learnnocode.dev/2021/02/19/humanistic-elements-in.html",
				"tags": ["Teaching Tips","Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/17/you-dont-have.html",
				"title": "You don't have to save it all.",
				"content_html": "<p>From the recent <a href=\"https://linkedin.zoom.us/rec/share/cKJnxLj_rCm646Vp_CMBlbnfKvO0Yw67pRubSDNg1D_qz1WVZMq2q03CIolp_4qC.iyRiY3ms0gVfWTET?startTime=1612461598000\">interview with Lynda Weinman</a>, founder of Lynda.com:</p>\n\n<blockquote>\nTo be a good artist, you must be critical. You don't have to save it all.\n</blockquote>\n\n<p>Here she was referring to her new 3D printed pottery work. However, she did go on to say this advice can apply to careers and career focus.</p>\n\n<p>As she explained, sometimes you make a mistake, or you make something that&rsquo;s not terribly awesome. Learn from what happened and let it go. Move on.</p>\n\n<p>Many people let mistakes keep them from moving forward in their field. They obsess over the thing they did wrong, rather than figuring out the lessons in what to avoid or improve next time.</p>\n\n<p>You don&rsquo;t have to save it all. It&rsquo;s ok to throw it out and move on.</p>\n",
				"content_text": "From the recent [interview with Lynda Weinman] (https://linkedin.zoom.us/rec/share/cKJnxLj_rCm646Vp_CMBlbnfKvO0Yw67pRubSDNg1D_qz1WVZMq2q03CIolp_4qC.iyRiY3ms0gVfWTET?startTime=1612461598000), founder of Lynda.com:\n\n<blockquote>\nTo be a good artist, you must be critical. You don't have to save it all.\n</blockquote>\n\nHere she was referring to her new 3D printed pottery work. However, she did go on to say this advice can apply to careers and career focus.\n\nAs she explained, sometimes you make a mistake, or you make something that's not terribly awesome. Learn from what happened and let it go. Move on. \n\nMany people let mistakes keep them from moving forward in their field. They obsess over the thing they did wrong, rather than figuring out the lessons in what to avoid or improve next time. \n\nYou don't have to save it all. It's ok to throw it out and move on. \n",
				"date_published": "2021-02-17T15:02:34-04:00",
				"url": "http://learnnocode.dev/2021/02/17/you-dont-have.html",
				"tags": ["Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/16/when-teachers-make.html",
				"title": "When teachers make mistakes, it's a learning moment for everyone",
				"content_html": "<p>Recently, I attended an excellent <a href=\"https://linkedin.zoom.us/rec/share/cKJnxLj_rCm646Vp_CMBlbnfKvO0Yw67pRubSDNg1D_qz1WVZMq2q03CIolp_4qC.iyRiY3ms0gVfWTET?startTime=1612461598000\">interview with Lynda Weinman</a>, founder of Lynda.com. She sold Lynda.com to LinkedIn in 2015 for <a href=\"https://www.vox.com/2015/4/9/11561324/three-reasons-linkedin-broke-the-bank-for-lynda-com\">$1.5 billion.</a></p>\n\n<p>Today, Lynda is creating <a href=\"https://www.instagram.com/lyndaweinman/?hl=en\">3D printed pottery</a>. It combines tactile art with plenty of programming.</p>\n\n<p>There were two reflection points she made that I thought were outstanding and transferable. This post involves reflecting on mistakes.</p>\n\n<p>One of the great qualities of a teacher is an ability to reflect on mistakes made. The process sounds so simple, but it&rsquo;s very difficult to do in practice. <a href=\"http://claybottress.com/category/art-journey/failures/\">Lynda is a master at this</a> and includes a section on mistakes in her blog.</p>\n\n<ul>\n<li><p>Identify the mistake made in a very specific way. Detail exactly what lead to the undesired outcome.</p></li>\n\n<li><p>Identify exactly what you&rsquo;ll do to avoid this mistake in the future. Sometimes this is built into the above statement.</p></li>\n\n<li><p>Optional: detail what you can do to make a more positive outcome when this type of mistake occurs.</p></li>\n</ul>\n\n<p>An example that follows this formula <a href=\"http://claybottress.com/types-of-mistakes/\">from this recent blog post</a>:\n<blockquote>\n  Mistake #4: Do not trim the base when the clay is too wet. Wait a day or two for it to become a lot more stiff, but not leather hard. Lesson learned: When the vase falls over and becomes lopsided, squish it so it looks like that was your intent.\n</blockquote></p>\n\n<p>My students have always loved moments when it looks like I&rsquo;m struggling, when I make a mistake in coding, or make other mistakes in class. It&rsquo;s always an excellent teachable moment. Learning how to identify those mistakes and fix them is really important, but it&rsquo;s rarely something covered in the curriculum. Instructors think they look &ldquo;stupid&rdquo; for making mistakes when teaching. This isn&rsquo;t true. It&rsquo;s encouraging to students to know that the teacher doesn&rsquo;t have superpowers. Everyone struggles sometimes. The difference is the teacher struggles less than the student.</p>\n",
				"content_text": "Recently, I attended an excellent [interview with Lynda Weinman] (https://linkedin.zoom.us/rec/share/cKJnxLj_rCm646Vp_CMBlbnfKvO0Yw67pRubSDNg1D_qz1WVZMq2q03CIolp_4qC.iyRiY3ms0gVfWTET?startTime=1612461598000), founder of Lynda.com. She sold Lynda.com to LinkedIn in 2015 for [$1.5 billion.] (https://www.vox.com/2015/4/9/11561324/three-reasons-linkedin-broke-the-bank-for-lynda-com)\n\nToday, Lynda is creating [3D printed pottery] (https://www.instagram.com/lyndaweinman/?hl=en). It combines tactile art with plenty of programming. \n\nThere were two reflection points she made that I thought were outstanding and transferable. This post involves reflecting on mistakes.\n\nOne of the great qualities of a teacher is an ability to reflect on mistakes made. The process sounds so simple, but it's very difficult to do in practice. [Lynda is a master at this] (http://claybottress.com/category/art-journey/failures/) and includes a section on mistakes in her blog. \n\n* Identify the mistake made in a very specific way. Detail exactly what lead to the undesired outcome.\n\n* Identify exactly what you'll do to avoid this mistake in the future. Sometimes this is built into the above statement.\n\n* Optional: detail what you can do to make a more positive outcome when this type of mistake occurs.\n\nAn example that follows this formula [from this recent blog post] (http://claybottress.com/types-of-mistakes/): \n<blockquote>\n  Mistake #4: Do not trim the base when the clay is too wet. Wait a day or two for it to become a lot more stiff, but not leather hard. Lesson learned: When the vase falls over and becomes lopsided, squish it so it looks like that was your intent.\n</blockquote>\n\nMy students have always loved moments when it looks like I'm struggling, when I make a mistake in coding, or make other mistakes in class. It's always an excellent teachable moment. Learning how to identify those mistakes and fix them is really important, but it's rarely something covered in the curriculum. Instructors think they look \"stupid\" for making mistakes when teaching. This isn't true. It's encouraging to students to know that the teacher doesn't have superpowers. Everyone struggles sometimes. The difference is the teacher struggles less than the student. \n",
				"date_published": "2021-02-16T15:47:48-04:00",
				"url": "http://learnnocode.dev/2021/02/16/when-teachers-make.html",
				"tags": ["Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/15/why-do-we.html",
				"title": "Why do we assume a redesign every 2-3 years?",
				"content_html": "<p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In all the web design meetings I&#39;ve been in over the years, I don&#39;t think I&#39;ve ever heard anyone say: &quot;How do we design this to last.&quot; It&#39;s just assumed they&#39;ll be a redesign every 2-3 years. Why? Why is that assumed?</p>&mdash; Gerry McGovern (@gerrymcgovern) <a href=\"https://twitter.com/gerrymcgovern/status/1361276428684247041?ref_src=twsrc%5Etfw\">February 15, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n\n<p>My response:</p>\n\n<p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Because techies still drive the desire to redesign the website. We believe that if you don&#39;t know the Hottest Framework Of The Moment, our careers are doomed. Marketing/content doesn&#39;t know better with the tech. Everyone is exhausted with the constant churn. <a href=\"https://t.co/iGO4szTP4d\">https://t.co/iGO4szTP4d</a></p>&mdash; Jen Kramer (@jen4web) <a href=\"https://twitter.com/jen4web/status/1361313329038438401?ref_src=twsrc%5Etfw\">February 15, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n\n<p>If we look at the technical timeline, this goes back to the start of the web. In the 1990s, HTML and browsers changed rapidly enough that we needed to redesign websites to keep up with what was new. People had no idea how to design for this medium. Netscape and Internet Explorer were completely different. Table-based layouts were new. Fonts other than Times were new. We had 216 web-safe colors and a 640x480 boat anchor-style monitor to do it all.</p>\n\n<p>In the 2000s, it was a matter of integrating CSS, ripping out tables, and getting people running on content management systems. We started to integrate multimedia and social media. Internet connections got faster, so we used more images.</p>\n\n<p>From 2010-2015, it was making sites responsive.</p>\n\n<p>From 2015 on, it became all about the JavaScript, shortly by all about the web apps.</p>\n\n<p>And now, everyone in Geekland is exhausted by how fast everything changes.</p>\n\n<p>Once the tech department has turned over in 2-3 years, all institutional knowledge has been lost about the site and how it was put together. The current developers trash the current site and how horrible it is. It&rsquo;s time to redo the site in another technology that the current devs know. Then they depart, new devs are hired, and the cycle begins again.</p>\n\n<p>Imagine a 10-year lifetime for a website. We might change the look of the frontend a little during that time, but we won&rsquo;t change the fundamental working of the system.</p>\n\n<p>That means our most recent redesign would have been February 2011. Content management systems and jQuery were the thing. Node.js was 18 months old. GitHub was a few years old. Angular was just barely released. Bootstrap wasn&rsquo;t yet released.</p>\n\n<p>Those websites were perfectly effective, but not as slick as the stateless websites we have today. A website from 2011 would look quite dated in 2021, not just in graphic design, but in technological design.</p>\n\n<p>A 5-year timeline is more realistic with the fast pace of technology. However, if employees continue to turn over in less than 5 year intervals, do we attract the best people to work in the tech department if they&rsquo;re working on 4-year old technology? Do we define the &ldquo;best&rdquo; people as those who are up with the most cutting edge techniques, or those who know the current tech on the current website?</p>\n\n<p>There&rsquo;s a lot of cultural issues here that we must first resolve. Perhaps the industry is still too young to realize we&rsquo;re burning ourselves out.</p>\n",
				"content_text": "<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">In all the web design meetings I&#39;ve been in over the years, I don&#39;t think I&#39;ve ever heard anyone say: &quot;How do we design this to last.&quot; It&#39;s just assumed they&#39;ll be a redesign every 2-3 years. Why? Why is that assumed?</p>&mdash; Gerry McGovern (@gerrymcgovern) <a href=\"https://twitter.com/gerrymcgovern/status/1361276428684247041?ref_src=twsrc%5Etfw\">February 15, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n\nMy response:\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Because techies still drive the desire to redesign the website. We believe that if you don&#39;t know the Hottest Framework Of The Moment, our careers are doomed. Marketing/content doesn&#39;t know better with the tech. Everyone is exhausted with the constant churn. <a href=\"https://t.co/iGO4szTP4d\">https://t.co/iGO4szTP4d</a></p>&mdash; Jen Kramer (@jen4web) <a href=\"https://twitter.com/jen4web/status/1361313329038438401?ref_src=twsrc%5Etfw\">February 15, 2021</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\nIf we look at the technical timeline, this goes back to the start of the web. In the 1990s, HTML and browsers changed rapidly enough that we needed to redesign websites to keep up with what was new. People had no idea how to design for this medium. Netscape and Internet Explorer were completely different. Table-based layouts were new. Fonts other than Times were new. We had 216 web-safe colors and a 640x480 boat anchor-style monitor to do it all.\n\nIn the 2000s, it was a matter of integrating CSS, ripping out tables, and getting people running on content management systems. We started to integrate multimedia and social media. Internet connections got faster, so we used more images.\n\nFrom 2010-2015, it was making sites responsive. \n\nFrom 2015 on, it became all about the JavaScript, shortly by all about the web apps.\n\nAnd now, everyone in Geekland is exhausted by how fast everything changes.\n\nOnce the tech department has turned over in 2-3 years, all institutional knowledge has been lost about the site and how it was put together. The current developers trash the current site and how horrible it is. It's time to redo the site in another technology that the current devs know. Then they depart, new devs are hired, and the cycle begins again.\n\nImagine a 10-year lifetime for a website. We might change the look of the frontend a little during that time, but we won't change the fundamental working of the system.\n\nThat means our most recent redesign would have been February 2011. Content management systems and jQuery were the thing. Node.js was 18 months old. GitHub was a few years old. Angular was just barely released. Bootstrap wasn't yet released. \n\nThose websites were perfectly effective, but not as slick as the stateless websites we have today. A website from 2011 would look quite dated in 2021, not just in graphic design, but in technological design.\n\nA 5-year timeline is more realistic with the fast pace of technology. However, if employees continue to turn over in less than 5 year intervals, do we attract the best people to work in the tech department if they're working on 4-year old technology? Do we define the \"best\" people as those who are up with the most cutting edge techniques, or those who know the current tech on the current website?\n\nThere's a lot of cultural issues here that we must first resolve. Perhaps the industry is still too young to realize we're burning ourselves out.\n",
				"date_published": "2021-02-15T18:12:36-04:00",
				"url": "http://learnnocode.dev/2021/02/15/why-do-we.html",
				"tags": ["Rants"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/12/teaching-reflections-useful.html",
				"title": "Teaching Reflections #8: Good coding instructors are rare. Here's why.",
				"content_html": "<p>One of the great outcomes of studying instructional design from a theoretical perspective is the ability to spot patterns in teaching.</p>\n\n<p>When teaching software and coding, one typically encounters two theories in use.</p>\n\n<ul>\n<li><p><strong><a href=\"https://www.wgu.edu/blog/what-behavioral-learning-theory2005.html\" target=\"_blank\">Behaviorism</a></strong> : Just teach people the behavior and reward them for doing it correctly. Based on B.F. Skinner and others.</p>\n\n<ul>\n<li><p>Best use is for the fundamentals of the subject. In math, it&rsquo;s basic arithmetic. In languages, it&rsquo;s alphabet, spelling, and grammar. In music, it&rsquo;s notes, rhythms, and scales. If the teacher says &ldquo;you just have to memorize this,&rdquo; that&rsquo;s behaviorism.</p></li>\n\n<li><p>If you&rsquo;re evaluating performance, it&rsquo;s often done through multiple choice, true/false, and other means of regurgitating facts. Students are rewarded for memorizing, not applying.</p></li>\n\n<li><p>If you were making a recipe, you would be rewarded for following all of the instructions correctly, rather than how good the recipe tastes. Behaviorism does not work in all kinds of learning.</p></li>\n</ul></li>\n\n<li><p><strong><a href=\"https://www.wgu.edu/blog/what-constructivism2005.html\" target=\"_blank\">Constructivism</a></strong> : &ldquo;Learn by doing.&rdquo; Base your learning on previous experience in the world, and apply that previous learning to the problem at hand.</p>\n\n<ul>\n<li><p>If you&rsquo;re following a recipe, you&rsquo;re the person who changes the ingredients the first time you try it. You know what you like and what works from previous cooking experiences. You know you don&rsquo;t like mushrooms, and you&rsquo;ll leave them out of this recipe. You substitute butter for margarine, chicken broth for beef broth, and add meat to vegetarian dishes.</p></li>\n\n<li><p>Best use is &ldquo;doing&rdquo; subjects once the fundamentals are mastered. Once a music student has learned a piece of music by a Baroque-era composer, how would the student apply those techniques and styles to the next Baroque-era piece she learns?</p></li>\n\n<li><p>Evaluation happens through some kind of final product, not through the work along the way. Typically this is a project-based evaluation: a final research paper, a piece of working software, a film, a performance.</p></li>\n\n<li><p>Constructivism shouldn&rsquo;t be applied where there are absolutely right and wrong answers. It&rsquo;s more about the shades of grey than the extremes of the spectrum.</p></li>\n</ul></li>\n</ul>\n\n<p>In the software and coding world, behaviorism drives most instruction one encounters. It&rsquo;s the &ldquo;help files&rdquo; associated with the software: go here, click this, type that, and you&rsquo;re done. In code, it&rsquo;s dominated by StackOverflow and developer blogs: here&rsquo;s a chunk of code that does this thing.</p>\n\n<p>Often, a coding class will start with examination of that chunk of code and some of its nuances. In that moment, students would tell you that they understood that code and its use.</p>\n\n<p>The next thing students are instructed to do is constructivist. &ldquo;OK, now apply this to your own project.&rdquo; No further guidance is given in that moment.</p>\n\n<p><strong>This critical moment is the time when students decide they are not &ldquo;good&rdquo; at programming or technology.  Instead, these students are a victim of poor teaching. </strong></p>\n\n<p>The instruction isn&rsquo;t necessarily bad. The instructor explained that code in minute detail. The idea of applying that code to your own project isn&rsquo;t bad either. Unfortunately, there&rsquo;s a step missing in between.</p>\n\n<p>That step is <a href=\"https://learningsolutionsmag.com/articles/288/can-they-do-it-in-the-real-world-designing-for-transfer-of-learning\">transference</a>. This is the moment you take a concept you learned in one context and apply it to the next problem. It&rsquo;s really, really hard to do.</p>\n\n<p>Most people experienced this in grade school in math class. You memorized basic arithmetic all day long. You knew those times tables! But then&hellip; there were word problems. Word problems required you to read a few sentences, identify the problem that needed to be solved, identify the math to solve it, and calculate the answer. Most students did fine with basic arithmetic and failed miserably with word problems.</p>\n\n<p>Professional software engineers are very good at transference. Instructors are really good at it too. However, the majority of students need help in making the leap from one context to the other.</p>\n\n<p><a href=\"https://learnnocode.dev/2020/12/27/the-fundamental-formula.html\">There are techniques that assist with transference</a>. Starting with a detailed explanation and ending with &ldquo;try it yourself&rdquo; are not fundamentally bad ideas. However, there&rsquo;s much more in-between that needs to happen for an effective outcome for most learners.</p>\n",
				"content_text": "One of the great outcomes of studying instructional design from a theoretical perspective is the ability to spot patterns in teaching.\n\nWhen teaching software and coding, one typically encounters two theories in use. \n\n* <strong><a href=\"https://www.wgu.edu/blog/what-behavioral-learning-theory2005.html\" target=\"_blank\">Behaviorism</a></strong> : Just teach people the behavior and reward them for doing it correctly. Based on B.F. Skinner and others. \n \n * Best use is for the fundamentals of the subject. In math, it's basic arithmetic. In languages, it's alphabet, spelling, and grammar. In music, it's notes, rhythms, and scales. If the teacher says \"you just have to memorize this,\" that's behaviorism.\n \n * If you're evaluating performance, it's often done through multiple choice, true/false, and other means of regurgitating facts. Students are rewarded for memorizing, not applying.\n \n * If you were making a recipe, you would be rewarded for following all of the instructions correctly, rather than how good the recipe tastes. Behaviorism does not work in all kinds of learning.\n\n\n* <strong><a href=\"https://www.wgu.edu/blog/what-constructivism2005.html\" target=\"_blank\">Constructivism</a></strong> : \"Learn by doing.\" Base your learning on previous experience in the world, and apply that previous learning to the problem at hand. \n\n * If you're following a recipe, you're the person who changes the ingredients the first time you try it. You know what you like and what works from previous cooking experiences. You know you don't like mushrooms, and you'll leave them out of this recipe. You substitute butter for margarine, chicken broth for beef broth, and add meat to vegetarian dishes.\n \n  * Best use is \"doing\" subjects once the fundamentals are mastered. Once a music student has learned a piece of music by a Baroque-era composer, how would the student apply those techniques and styles to the next Baroque-era piece she learns?\n\n * Evaluation happens through some kind of final product, not through the work along the way. Typically this is a project-based evaluation: a final research paper, a piece of working software, a film, a performance.\n \n * Constructivism shouldn't be applied where there are absolutely right and wrong answers. It's more about the shades of grey than the extremes of the spectrum.\n\nIn the software and coding world, behaviorism drives most instruction one encounters. It's the \"help files\" associated with the software: go here, click this, type that, and you're done. In code, it's dominated by StackOverflow and developer blogs: here's a chunk of code that does this thing.\n\nOften, a coding class will start with examination of that chunk of code and some of its nuances. In that moment, students would tell you that they understood that code and its use.\n\nThe next thing students are instructed to do is constructivist. \"OK, now apply this to your own project.\" No further guidance is given in that moment. \n\n<strong>This critical moment is the time when students decide they are not \"good\" at programming or technology.  Instead, these students are a victim of poor teaching. </strong>\n\nThe instruction isn't necessarily bad. The instructor explained that code in minute detail. The idea of applying that code to your own project isn't bad either. Unfortunately, there's a step missing in between.\n\nThat step is [transference] (https://learningsolutionsmag.com/articles/288/can-they-do-it-in-the-real-world-designing-for-transfer-of-learning). This is the moment you take a concept you learned in one context and apply it to the next problem. It's really, really hard to do.\n\nMost people experienced this in grade school in math class. You memorized basic arithmetic all day long. You knew those times tables! But then... there were word problems. Word problems required you to read a few sentences, identify the problem that needed to be solved, identify the math to solve it, and calculate the answer. Most students did fine with basic arithmetic and failed miserably with word problems. \n\nProfessional software engineers are very good at transference. Instructors are really good at it too. However, the majority of students need help in making the leap from one context to the other. \n\n[There are techniques that assist with transference] (https://learnnocode.dev/2020/12/27/the-fundamental-formula.html). Starting with a detailed explanation and ending with \"try it yourself\" are not fundamentally bad ideas. However, there's much more in-between that needs to happen for an effective outcome for most learners.\n",
				"date_published": "2021-02-12T12:08:00-04:00",
				"url": "http://learnnocode.dev/2021/02/12/teaching-reflections-useful.html",
				"tags": ["Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/11/091637.html",
				
				"content_html": "<p><img src=\"uploads/2021/c12787c63f.jpg\" width=\"515\" height=\"540\" alt=\"\" /></p>\n",
				"content_text": "\n\n<img src=\"uploads/2021/c12787c63f.jpg\" width=\"515\" height=\"540\" alt=\"\" />\n",
				"date_published": "2021-02-11T10:16:37-04:00",
				"url": "http://learnnocode.dev/2021/02/11/091637.html"
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/09/nocode-apps-to.html",
				
				"content_html": "<p><a href=\"https://www.ycode.com/blog/13-no-code-apps-to-watch-in-2021\">13 no-code apps to watch in 2021</a></p>\n\n<ul>\n<li><p><a href=\"http://www.ycode.com\">Ycode</a></p></li>\n\n<li><p><a href=\"https://www.ampstor.co/\">Ampstor</a></p></li>\n\n<li><p><a href=\"https://www.softr.io/\">Softr</a></p></li>\n\n<li><p><a href=\"https://draftbit.com/\">Draftbit</a></p></li>\n\n<li><p><a href=\"https://www.bravostudio.app/\">Bravo Studio</a></p></li>\n\n<li><p><a href=\"https://www.adalo.com/\">Adalo</a></p></li>\n\n<li><p><a href=\"https://www.servicebot.io/\">Servicebot</a></p></li>\n\n<li><p><a href=\"https://www.outseta.com/\">Outseta</a></p></li>\n\n<li><p><a href=\"https://pathfix.com/\">Pathfix</a></p></li>\n\n<li><p><a href=\"https://phantombuster.com/\">Phantombuster</a></p></li>\n\n<li><p><a href=\"https://n8n.io/\">n8n</a></p></li>\n\n<li><p><a href=\"https://www.metaranx.com/\">Metaranx</a></p></li>\n\n<li><p><a href=\"https://autify.com/\">Autify</a></p></li>\n</ul>\n",
				"content_text": "[13 no-code apps to watch in 2021] (https://www.ycode.com/blog/13-no-code-apps-to-watch-in-2021)\n\n* [Ycode] (http://www.ycode.com)\n\n* [Ampstor] (https://www.ampstor.co/)\n\n* [Softr] (https://www.softr.io/)\n\n* [Draftbit] (https://draftbit.com/)\n\n* [Bravo Studio] (https://www.bravostudio.app/)\n\n* [Adalo] (https://www.adalo.com/)\n\n* [Servicebot] (https://www.servicebot.io/)\n\n* [Outseta] (https://www.outseta.com/)\n\n* [Pathfix] (https://pathfix.com/)\n\n* [Phantombuster] (https://phantombuster.com/)\n\n* [n8n] (https://n8n.io/)\n\n* [Metaranx] (https://www.metaranx.com/)\n\n* [Autify] (https://autify.com/)\n",
				"date_published": "2021-02-09T17:17:17-04:00",
				"url": "http://learnnocode.dev/2021/02/09/nocode-apps-to.html"
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/09/software-is-scholarship.html",
				"title": "Software is Scholarship",
				"content_html": "<p><a href=\"https://law.mit.edu/pub/softwareisscholarship/release/1\">Software is Scholarship</a></p>\n\n<p><em>By transforming the way that knowledge is discovered and shared, software has the ability to revolutionize the way scholars communicate their ideas. This article explains how software applications enable the highest forms of scholarship and applies those lessons to law.</em></p>\n\n<blockquote>\n  <p>Interactive software applications can enhance research agendas in the humanities and social sciences by making traditional, prose scholarship more thorough, persuasive, and analytically precise. Due to recent innovations, developing software for scholarly purposes is accessible to those that work in the humanities. Platforms for developing software have grown so sophisticated that they no longer require creators to write code to develop powerful, data rich, and well-designed interactive applications.</p>\n  <cite>Houman B. Shadab</cite>\n</blockquote>\n\n<p>Dr. Shadab, a law professor, is using Bubble.io to create his applications for scholarly research and communicating results. This is very far ahead of academia, and it&rsquo;s a pleasure to see this happening.</p>\n",
				"content_text": "[Software is Scholarship] (https://law.mit.edu/pub/softwareisscholarship/release/1)\n\n*By transforming the way that knowledge is discovered and shared, software has the ability to revolutionize the way scholars communicate their ideas. This article explains how software applications enable the highest forms of scholarship and applies those lessons to law.*\n\n<blockquote>\n  <p>Interactive software applications can enhance research agendas in the humanities and social sciences by making traditional, prose scholarship more thorough, persuasive, and analytically precise. Due to recent innovations, developing software for scholarly purposes is accessible to those that work in the humanities. Platforms for developing software have grown so sophisticated that they no longer require creators to write code to develop powerful, data rich, and well-designed interactive applications.</p>\n  <cite>Houman B. Shadab</cite>\n</blockquote>\n\nDr. Shadab, a law professor, is using Bubble.io to create his applications for scholarly research and communicating results. This is very far ahead of academia, and it's a pleasure to see this happening. \n",
				"date_published": "2021-02-09T10:17:56-04:00",
				"url": "http://learnnocode.dev/2021/02/09/software-is-scholarship.html",
				"tags": ["NoCode Reading"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/08/teaching-reflections-helping.html",
				"title": "Teaching reflections #7: Helping students choose engaging projects",
				"content_html": "<p>A capstone project should be balanced like the quintessential American meal: meaty main course, starchy side dish, vegetable side dish, and dessert.</p>\n\n<p>A good capstone project is constructed in a similar way. Let&rsquo;s take the case of a website as a capstone project:</p>\n\n<ul>\n<li><p><strong>Meaty main course</strong>: The main focus of the capstone. It&rsquo;s the website, the vehicle where all of the component parts are assembled. Usually students are focused on website coding and construction in this phase. In the case of a website, there&rsquo;s many areas of focus here. Students may be working with a CMS plus custom theming, coding and integrating a CMS plugin, creating a single page web application, or building a browser extension.</p></li>\n\n<li><p><strong>Starchy side dish</strong>: This is where the student might have a complimentary secondary interest. In the case of a website, this might be a user experience (UX) focus; website planning, card sorts, flow charts, wireframing, and user testing are some of my favorites to discuss with students. If the student has a programming focus, this might include website performance improvements, server configuration issues, database design, and so forth.</p></li>\n\n<li><p><strong>Vegetable side dish</strong>: This is the deliverable area that feels like real work to the student, but it&rsquo;s an area where they should grow. For programmers, it might be graphic or interface design. For graphic designers, it might be light programming. Writing quality content and storytelling is always a good addition for any type of web design student. Some of these deliverables may feel like a bit of a stretch to the student. A little stretch means growth. (Too much stretch leads to breakage, though, so watch for this as well.)</p></li>\n\n<li><p><strong>Dessert</strong>: There should always be a fun component to capstone, to keep students engaged, interested, and enjoying the process. These deliverables may be weighted minimally. They may also be outside of the main focus of the capstone. In the web design project, this might be some photography for the site, a social media promotion plan, or a short (1 minute) video clip or animation. Programmers sometimes want to try a new library or framework that they&rsquo;ve wanted to explore but have never had the time.</p></li>\n</ul>\n\n<p>Combined with <a href=\"https://learnnocode.dev/2021/02/06/teaching-reflections-identifying.html\">students choosing a good project </a>, this balance of deliverables should keep students engaged through the term.</p>\n",
				"content_text": "A capstone project should be balanced like the quintessential American meal: meaty main course, starchy side dish, vegetable side dish, and dessert.\n\nA good capstone project is constructed in a similar way. Let's take the case of a website as a capstone project:\n\n* <strong>Meaty main course</strong>: The main focus of the capstone. It's the website, the vehicle where all of the component parts are assembled. Usually students are focused on website coding and construction in this phase. In the case of a website, there's many areas of focus here. Students may be working with a CMS plus custom theming, coding and integrating a CMS plugin, creating a single page web application, or building a browser extension. \n\n* <strong>Starchy side dish</strong>: This is where the student might have a complimentary secondary interest. In the case of a website, this might be a user experience (UX) focus; website planning, card sorts, flow charts, wireframing, and user testing are some of my favorites to discuss with students. If the student has a programming focus, this might include website performance improvements, server configuration issues, database design, and so forth. \n\n* <strong>Vegetable side dish</strong>: This is the deliverable area that feels like real work to the student, but it's an area where they should grow. For programmers, it might be graphic or interface design. For graphic designers, it might be light programming. Writing quality content and storytelling is always a good addition for any type of web design student. Some of these deliverables may feel like a bit of a stretch to the student. A little stretch means growth. (Too much stretch leads to breakage, though, so watch for this as well.)\n\n* <strong>Dessert</strong>: There should always be a fun component to capstone, to keep students engaged, interested, and enjoying the process. These deliverables may be weighted minimally. They may also be outside of the main focus of the capstone. In the web design project, this might be some photography for the site, a social media promotion plan, or a short (1 minute) video clip or animation. Programmers sometimes want to try a new library or framework that they've wanted to explore but have never had the time.\n\nCombined with [students choosing a good project ] (https://learnnocode.dev/2021/02/06/teaching-reflections-identifying.html), this balance of deliverables should keep students engaged through the term.\n",
				"date_published": "2021-02-08T10:49:00-04:00",
				"url": "http://learnnocode.dev/2021/02/08/teaching-reflections-helping.html",
				"tags": ["Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/07/teaching-reflections-grading.html",
				"title": "Teaching reflections #6: Grading rubrics and capstone",
				"content_html": "\n\n<p>Capstone projects are all unique. Harvard&rsquo;s digital media capstone projects are all over the map: films, courses, websites,  UX projects, and combinations of these.</p>\n\n<p>It is impossible to structure grading for a capstone project for this reason. However, structured grading is most vital for this course among all others.</p>\n\n<p>In every other university course, grading happens during the term in some way through periodic assignments. Even in courses with a heavy assignment at end of the course, students still have some concept of how they&rsquo;re doing as they complete their final work.</p>\n\n<p>However, a capstone should be evaluated as a complete work, rather than evaluated piecemeal through the term. While students should get feedback along the way, they shouldn&rsquo;t receive a hard grade until the end. They should have the opportunity to refine all deliverables and aspects of the project in light of whatever they&rsquo;re currently creating. The point of capstone is to bring together multiple aspects of the degree program and synthesize learning over the curriculum. Grading, therefore, needs to be at the end and encompass the full project.</p>\n\n<p>This clearly leads to potential issues. What happens when the student thinks they&rsquo;ve done A work, but the instructor thinks it&rsquo;s a C-? What happens when the student&rsquo;s project isn&rsquo;t &ldquo;weighty&rdquo; enough for a capstone? These potential surprises (risks!) must be mitigated in some way.</p>\n\n<p>As I&rsquo;ve mentioned in a previous post, students don&rsquo;t understand mitigating risk going into capstone, nor do they understand how to scope a project. We also have an issue of how to grade a unique project.</p>\n\n<p>Fortunately, a student-written grading rubric solves all of these issues.</p>\n\n<p>I review their rubric and make sure the bar isn&rsquo;t set low or that they&rsquo;re working on trivial things. But have faith in these adult students. They chose to go to grad school with a reason in mind. Most want to do well on their project, but they also want to learn something new and be proud of their work. With guidance, they write a challenging rubric that stretches them, but not too far so it&rsquo;s still achievable within the semester timeline.</p>\n\n<p>Let&rsquo;s go through all of the learning that happens when students write their own grading rubrics.</p>\n\n<p><img src=\"uploads/2021/c66cd5fef1.png\" width=\"564\" height=\"564\" alt=\"The story of my capstone never follows the path I thought it would. \" /></p>\n\n<h3 id=\"rubrics-identify-deliverables-and-completion-timelines\">Rubrics identify deliverables and completion timelines</h3>\n\n<p>It&rsquo;s one thing to say &ldquo;I&rsquo;m creating a 15-minute documentary on X topic.&rdquo; It&rsquo;s another to spell out exactly what it takes to create that: storyboarding, running the interviews, choosing the B-roll and music, editing it together.</p>\n\n<p>Larger deliverables may be broken down further. For example, an interview segment might be graded according to lighting, camera angle and focus, sound quality, color correction, how it furthers the story, and consistency of these characteristics across interview segments.</p>\n\n<p>Most students also put together a timeline for their work along with this list. I encourage them to create milestones, so they can quickly measure if they&rsquo;re on track, behind, or ahead of schedule.</p>\n\n<p>When students write down all of the elements and stages they must complete to create their project, and particularly once they schedule these over the semester, they start to get a sense of scope. They realize whether they&rsquo;ve committed to too much work and need to scale it.</p>\n\n<h3 id=\"rubrics-determine-how-work-should-be-weighted-and-graded\">Rubrics determine how work should be weighted and graded</h3>\n\n<p>Once students have completed their list of deliverables, the next question is how to grade each deliverable.</p>\n\n<p>There are two parts to this question. First, how do we evaluate each deliverable? Second, not all deliverables are created equal, so where should we place grading emphasis, and what should be minimized?</p>\n\n<h4 id=\"grading\">Grading</h4>\n\n<p>My students and I have conversations about how to communicate grading so that we&rsquo;re both on the same page. <strong>How do you define good quality in a rubric so it&rsquo;s clear enough to hang your grade on it?</strong></p>\n\n<p>Still, my favorite rubric item shows up over and over, year after year: <em>&ldquo;The website will be simple and easy to use.&rdquo;</em></p>\n\n<p>A noble goal! But how do we measure that? What is simple and easy for you may not be for me. This is usually where I ask the student if they will do user testing to ensure the site is simple and easy to use. And if the testers show that it&rsquo;s not, what will they do then? (Usually this is sufficent to convince them to refine this criterion in some way to reflect the intent, but in a more measurable way.)</p>\n\n<p>Students struggle with quality metrics in rubrics, but in the end, it&rsquo;s a good exercise. It&rsquo;s part of learning clear communication. It&rsquo;s also useful for the end of the course, when they&rsquo;re running out of time and they&rsquo;re paralyzed by whether something is &ldquo;good enough.&rdquo; Since they made the decision of how to measure their work up front, allocating their time is an easier decision.</p>\n\n<h4 id=\"weighting\">Weighting</h4>\n\n<p>Some deliverables are more important than others. Some should be completed at a different level than others.</p>\n\n<p>If a student is creating a documentary as their main focus, and they want to also complete a website for that documentary, I think that&rsquo;s great. But the website is a minor deliverable. It might be built with Squarespace or other no-code technology.</p>\n\n<p>If a student is creating a website as their main focus, however, it&rsquo;s not going to be built in Squarespace, and it will involve some level of coding.</p>\n\n<p>Within a deliverable, elements may be weighted differently as well. With websites, for example, some students want to emphasize graphic design, or page performance, or writing some type of code, or usability. All of these are important to the site, but not all need to be emphasized in the capstone project with a limited timeline. An ugly website with innovative coding may be as legitimate a project as a website with breathtaking graphics and photos and less coding.</p>\n\n<p>Students should have some say in what they consider important (and presumably where they want to spend their time), vs. what they consider less important. I ask students to reflect on their learning goals for this project, in addition to the amount of time required for each deliverable. Those that take more time might be worth more points. There may be some &ldquo;stretch deliverables&rdquo; that the student isn&rsquo;t confident they can reach, but they don&rsquo;t want to jeopardize their grade or graduation. These might be weighted less to help mitigate risk.</p>\n\n<p>Likewise, when students identify trivial deliverables (&ldquo;navigation will work on all pages of the website&rdquo;), I gently point out if they have not mastered navigation bars prior to enrolling in capstone, they are not qualified to build a website as a capstone project.</p>\n\n<h3 id=\"rubrics-for-time-management\">Rubrics for time management</h3>\n\n<p>In the last 4 weeks of the semester, as the students are in their final grind to complete their projects, inevitably some level of panic sets in. Some deliverables took longer than expected. Work was demanding. Home life is demanding, particularly in pandemic times. Life happened along the way.</p>\n\n<p>I remember when one student discovered a new technique for coding his project in these final weeks. He asked if he needed to refactor his project to use the technique. I asked what was on his rubric. Since neither the technique nor refactoring was listed as a deliverable, he understood he should keep going with what he had. Refactoring could be done after capstone.</p>\n\n<p>Other students are short on time but long on deliverables towards the end. I advise working on deliverables with heavier weighting. They can also decide what&rsquo;s faster and easier to complete and concentrate efforts there.</p>\n\n<h3 id=\"rubrics-for-organizing-deliverables\">Rubrics for organizing deliverables</h3>\n\n<p>&ldquo;Here&rsquo;s my film!&rdquo; Great! Now what?</p>\n\n<p>I have students use their rubric as an organization tool for their deliverables. Where should I look for proof of excellence in each criterion?</p>\n\n<p>Not all deliverables are contained within the main project (film, website, course). For example, a storyboard is critical to the film, but it&rsquo;s a separate deliverable from the film. Many website and course deliverables also follow this pattern.</p>\n\n<p>Rather than being forced to hunt for All The Things, students choose where I look. Time stamps, website addresses, lines of code, Word documents, and more form the basis of deliverables.</p>\n\n<h3 id=\"rubrics-for-reflection\">Rubrics for reflection</h3>\n\n<p>Finally, students fill out their own grading rubric as part of the reflection process. (I also ask them to write a final blog post reflecting on what went well and what they&rsquo;d do differently next time.)</p>\n\n<p>When students grade themselves, they are required to compare their work with the measurements they set. Did they achieve these metrics? Why or why not?</p>\n\n<p>In most instances, students gave themselves lower marks than I did, sometimes dramatically so. The rest of the time, I agreed with their assessment. I can only think of one instance where my grade was lower than the student&rsquo;s.</p>\n\n<p>Many students start this grading and reflection exercise with an eye roll, believing it&rsquo;s the final busy-work hurdle to graduation. But I don&rsquo;t give busy work. By the time they&rsquo;re done, they usually comment on how useful the reflection process was.</p>\n\n<p>Whew, that&rsquo;s a lot for one grading rubric. If you wind up with capstone students, I strongly recommend trying it with your next cohort.</p>\n",
				"content_text": "Capstone projects are all unique. Harvard's digital media capstone projects are all over the map: films, courses, websites,  UX projects, and combinations of these.\n\nIt is impossible to structure grading for a capstone project for this reason. However, structured grading is most vital for this course among all others. \n\nIn every other university course, grading happens during the term in some way through periodic assignments. Even in courses with a heavy assignment at end of the course, students still have some concept of how they're doing as they complete their final work.\n\nHowever, a capstone should be evaluated as a complete work, rather than evaluated piecemeal through the term. While students should get feedback along the way, they shouldn't receive a hard grade until the end. They should have the opportunity to refine all deliverables and aspects of the project in light of whatever they're currently creating. The point of capstone is to bring together multiple aspects of the degree program and synthesize learning over the curriculum. Grading, therefore, needs to be at the end and encompass the full project.\n\nThis clearly leads to potential issues. What happens when the student thinks they've done A work, but the instructor thinks it's a C-? What happens when the student's project isn't \"weighty\" enough for a capstone? These potential surprises (risks!) must be mitigated in some way.\n\nAs I've mentioned in a previous post, students don't understand mitigating risk going into capstone, nor do they understand how to scope a project. We also have an issue of how to grade a unique project.\n\nFortunately, a student-written grading rubric solves all of these issues.\n\nI review their rubric and make sure the bar isn't set low or that they're working on trivial things. But have faith in these adult students. They chose to go to grad school with a reason in mind. Most want to do well on their project, but they also want to learn something new and be proud of their work. With guidance, they write a challenging rubric that stretches them, but not too far so it's still achievable within the semester timeline.\n\nLet's go through all of the learning that happens when students write their own grading rubrics.\n\n<img src=\"uploads/2021/c66cd5fef1.png\" width=\"564\" height=\"564\" alt=\"The story of my capstone never follows the path I thought it would. \" />\n\n### Rubrics identify deliverables and completion timelines\n\nIt's one thing to say \"I'm creating a 15-minute documentary on X topic.\" It's another to spell out exactly what it takes to create that: storyboarding, running the interviews, choosing the B-roll and music, editing it together. \n\nLarger deliverables may be broken down further. For example, an interview segment might be graded according to lighting, camera angle and focus, sound quality, color correction, how it furthers the story, and consistency of these characteristics across interview segments.\n\nMost students also put together a timeline for their work along with this list. I encourage them to create milestones, so they can quickly measure if they're on track, behind, or ahead of schedule.\n\nWhen students write down all of the elements and stages they must complete to create their project, and particularly once they schedule these over the semester, they start to get a sense of scope. They realize whether they've committed to too much work and need to scale it. \n\n### Rubrics determine how work should be weighted and graded\n\nOnce students have completed their list of deliverables, the next question is how to grade each deliverable. \n\nThere are two parts to this question. First, how do we evaluate each deliverable? Second, not all deliverables are created equal, so where should we place grading emphasis, and what should be minimized?\n\n#### Grading\n\nMy students and I have conversations about how to communicate grading so that we're both on the same page. **How do you define good quality in a rubric so it's clear enough to hang your grade on it?**\n\nStill, my favorite rubric item shows up over and over, year after year: *\"The website will be simple and easy to use.\"*\n\nA noble goal! But how do we measure that? What is simple and easy for you may not be for me. This is usually where I ask the student if they will do user testing to ensure the site is simple and easy to use. And if the testers show that it's not, what will they do then? (Usually this is sufficent to convince them to refine this criterion in some way to reflect the intent, but in a more measurable way.)\n\nStudents struggle with quality metrics in rubrics, but in the end, it's a good exercise. It's part of learning clear communication. It's also useful for the end of the course, when they're running out of time and they're paralyzed by whether something is \"good enough.\" Since they made the decision of how to measure their work up front, allocating their time is an easier decision.\n\n#### Weighting\n\nSome deliverables are more important than others. Some should be completed at a different level than others.\n\nIf a student is creating a documentary as their main focus, and they want to also complete a website for that documentary, I think that's great. But the website is a minor deliverable. It might be built with Squarespace or other no-code technology.\n\nIf a student is creating a website as their main focus, however, it's not going to be built in Squarespace, and it will involve some level of coding.\n\nWithin a deliverable, elements may be weighted differently as well. With websites, for example, some students want to emphasize graphic design, or page performance, or writing some type of code, or usability. All of these are important to the site, but not all need to be emphasized in the capstone project with a limited timeline. An ugly website with innovative coding may be as legitimate a project as a website with breathtaking graphics and photos and less coding.\n\nStudents should have some say in what they consider important (and presumably where they want to spend their time), vs. what they consider less important. I ask students to reflect on their learning goals for this project, in addition to the amount of time required for each deliverable. Those that take more time might be worth more points. There may be some \"stretch deliverables\" that the student isn't confident they can reach, but they don't want to jeopardize their grade or graduation. These might be weighted less to help mitigate risk.\n\nLikewise, when students identify trivial deliverables (\"navigation will work on all pages of the website\"), I gently point out if they have not mastered navigation bars prior to enrolling in capstone, they are not qualified to build a website as a capstone project.\n\n### Rubrics for time management\n\nIn the last 4 weeks of the semester, as the students are in their final grind to complete their projects, inevitably some level of panic sets in. Some deliverables took longer than expected. Work was demanding. Home life is demanding, particularly in pandemic times. Life happened along the way.\n\nI remember when one student discovered a new technique for coding his project in these final weeks. He asked if he needed to refactor his project to use the technique. I asked what was on his rubric. Since neither the technique nor refactoring was listed as a deliverable, he understood he should keep going with what he had. Refactoring could be done after capstone.\n\nOther students are short on time but long on deliverables towards the end. I advise working on deliverables with heavier weighting. They can also decide what's faster and easier to complete and concentrate efforts there.\n\n### Rubrics for organizing deliverables\n\n\"Here's my film!\" Great! Now what? \n\nI have students use their rubric as an organization tool for their deliverables. Where should I look for proof of excellence in each criterion?\n\nNot all deliverables are contained within the main project (film, website, course). For example, a storyboard is critical to the film, but it's a separate deliverable from the film. Many website and course deliverables also follow this pattern.\n\nRather than being forced to hunt for All The Things, students choose where I look. Time stamps, website addresses, lines of code, Word documents, and more form the basis of deliverables.\n\n### Rubrics for reflection\n\nFinally, students fill out their own grading rubric as part of the reflection process. (I also ask them to write a final blog post reflecting on what went well and what they'd do differently next time.)\n\nWhen students grade themselves, they are required to compare their work with the measurements they set. Did they achieve these metrics? Why or why not? \n\nIn most instances, students gave themselves lower marks than I did, sometimes dramatically so. The rest of the time, I agreed with their assessment. I can only think of one instance where my grade was lower than the student's. \n\nMany students start this grading and reflection exercise with an eye roll, believing it's the final busy-work hurdle to graduation. But I don't give busy work. By the time they're done, they usually comment on how useful the reflection process was. \n\nWhew, that's a lot for one grading rubric. If you wind up with capstone students, I strongly recommend trying it with your next cohort.\n\n",
				"date_published": "2021-02-07T13:37:00-04:00",
				"url": "http://learnnocode.dev/2021/02/07/teaching-reflections-grading.html",
				"tags": ["Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/06/teaching-reflections-identifying.html",
				"title": "Teaching reflections #5: Identifying projects in capstone",
				"content_html": "<p>Master&rsquo;s degree programs generally have one of two endings. Either students write a thesis, or they complete a capstone project. Where students want to further job prospects in technology, rather than an academic or research-based career, a capstone is a much better choice. Students get to complete a large, meaty project that brings together many aspects of the degree program.</p>\n\n<p>Capstone is also a good time to teach how to choose a great project.</p>\n\n<p>The timeline for capstone is usually 7-9 months and is generally completed in three phases.</p>\n\n<ul>\n<li><p>In Phase 1, students are asked to identify a project they&rsquo;d like to work on. This is typically an informal exploration, plus discussions with capstone instructors and advisors.</p></li>\n\n<li><p>In Phase 2, they write a capstone proposal. This is often a semester-long process, and it may be combined with Phase 1.</p></li>\n\n<li><p>In Phase 3, they implement their capstone proposal, usually over a semester.</p></li>\n</ul>\n\n<p>Each of these should be a post, so here I&rsquo;ll start with Phase 1, identifying a project.</p>\n\n<p>When I did my own capstone project in grad school, I already had a vision of what I wanted to accomplish. I was in grad school to train to become a web designer. (It was 2000. Different times.) I wanted a project that paid me to do the work. I wanted a well-known name brand to work with, ideally, rather than a small local business. I wanted to build the website from nothing &ndash; I wanted the experience of gathering requirements and goals, creating site maps from a card sort, doing the graphic design, and coding the whole thing inside of Dreamweaver (as one did in those days). I wound up doing a website for Massachusetts 4-H, which was housed at UMass Extension. This project lead to many others through UMass over the years.</p>\n\n<p>Naturally, I thought other students would have the same experience. Not true!</p>\n\n<p>I found that students were unable to think about the capstone project beyond &ldquo;what can I do to get an A, graduate, and move on.&rdquo; I started asking the students these following questions to help structure their thinking.</p>\n\n<ul>\n<li><p>Why did you go to grad school in the first place?</p></li>\n\n<li><p>What kind of job do you want when you graduate?</p></li>\n\n<li><p>What is missing between that job you want and what you&rsquo;ve learned here? What did you want to learn more about? What skills do you want to demonstrate?</p></li>\n\n<li><p>Is there life for this project beyond capstone? It&rsquo;s a lot of work, so if we can use capstone to launch a business, get a job, or some other way launch your future life, this is worth exploring.</p></li>\n\n<li><p>What would hold your interest for 7-9 months of intense work?</p></li>\n</ul>\n\n<p>Through the years, I&rsquo;ve realized this type of structured thinking is missing in many aspects of student work. It&rsquo;s lead me to incorporate more structure in assignments to better guide students to what I&rsquo;m looking for in projects. Thus my famous &ldquo;turn-in sheet&rdquo; was born. And that is another topic for another post.</p>\n",
				"content_text": "Master's degree programs generally have one of two endings. Either students write a thesis, or they complete a capstone project. Where students want to further job prospects in technology, rather than an academic or research-based career, a capstone is a much better choice. Students get to complete a large, meaty project that brings together many aspects of the degree program.\n\nCapstone is also a good time to teach how to choose a great project.\n\nThe timeline for capstone is usually 7-9 months and is generally completed in three phases. \n\n* In Phase 1, students are asked to identify a project they'd like to work on. This is typically an informal exploration, plus discussions with capstone instructors and advisors.\n\n* In Phase 2, they write a capstone proposal. This is often a semester-long process, and it may be combined with Phase 1.\n\n* In Phase 3, they implement their capstone proposal, usually over a semester.\n\nEach of these should be a post, so here I'll start with Phase 1, identifying a project.\n\nWhen I did my own capstone project in grad school, I already had a vision of what I wanted to accomplish. I was in grad school to train to become a web designer. (It was 2000. Different times.) I wanted a project that paid me to do the work. I wanted a well-known name brand to work with, ideally, rather than a small local business. I wanted to build the website from nothing -- I wanted the experience of gathering requirements and goals, creating site maps from a card sort, doing the graphic design, and coding the whole thing inside of Dreamweaver (as one did in those days). I wound up doing a website for Massachusetts 4-H, which was housed at UMass Extension. This project lead to many others through UMass over the years.\n\nNaturally, I thought other students would have the same experience. Not true!\n\nI found that students were unable to think about the capstone project beyond \"what can I do to get an A, graduate, and move on.\" I started asking the students these following questions to help structure their thinking. \n\n* Why did you go to grad school in the first place?\n\n* What kind of job do you want when you graduate? \n\n* What is missing between that job you want and what you've learned here? What did you want to learn more about? What skills do you want to demonstrate? \n\n* Is there life for this project beyond capstone? It's a lot of work, so if we can use capstone to launch a business, get a job, or some other way launch your future life, this is worth exploring.\n\n* What would hold your interest for 7-9 months of intense work?\n\nThrough the years, I've realized this type of structured thinking is missing in many aspects of student work. It's lead me to incorporate more structure in assignments to better guide students to what I'm looking for in projects. Thus my famous \"turn-in sheet\" was born. And that is another topic for another post.\n",
				"date_published": "2021-02-06T10:59:00-04:00",
				"url": "http://learnnocode.dev/2021/02/06/teaching-reflections-identifying.html",
				"tags": ["Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/05/092122.html",
				"title": "Teaching reflections #4: Teaching risk in capstone projects",
				"content_html": "<p><img src=\"uploads/2021/cc653e35f1.jpg\" width=\"408\" height=\"600\" alt=\"\" /></p>\n\n<p>After 20 years of teaching in academia, I&rsquo;ve coached many capstone projects.</p>\n\n<p>Part of the capstone process is examining risk and mitigating it. Students have very little ability to do this, even after completing courses and assignments for a full degree program. This is because in a regular course, the instructor assigns all materials to consume and study and provides assignment(s) that have deadlines. Students manage time and scope based on work that&rsquo;s already defined these parameters for them.</p>\n\n<p>That means that when a student is creating a project of their own, they do not understand how to properly scope their work within the time parameters.</p>\n\n<p>They also don&rsquo;t understand risk. In a standard university course, risk during the semester usually looks like this for adult students with jobs and lives:</p>\n\n<ul>\n<li><p>High probability, low impact: Work or kids get demanding during a portion of the course. Work ahead, talk to the instructor, and usually you get through this without significant damage to the grade.</p></li>\n\n<li><p>Low probability, low impact: Not completing a weekly requirement: not attending class, not completing a weekly quiz, not posting a discussion post. This could be simply forgetting something, or it could be a conflict with other parts of life meant that the work just didn&rsquo;t get done.</p></li>\n\n<li><p>Low probability, high impact: Death in the family, severe illness of the student or in the student&rsquo;s family, childbirth during the term. Universities have methods of working around these issues via course incompletes. Students should always talk to instructors to get help when these issues happen.</p></li>\n\n<li><p>High probability, high impact: There are certain students who are consistently bad at managing time and always seem to have some drama going on. If you talk to other instructors who had this student previously, you&rsquo;ll discover the pattern across all courses. However, these students are rare in adult learning programs.</p></li>\n</ul>\n\n<p>In other words, while students are always concerned about getting a lower grade than they think is reasonable for their work, talking to the instructor consistently and being engaged in the course is generally enough to get through it.</p>\n\n<p>For a capstone project, they are concerned about failing the project and jeopardizing graduation. Low probability, high impact. However, when the student controls most of the project, as is true for most parameters of capstone, the probability is higher here than it is for other courses. Students don&rsquo;t understand how to scope their work &ndash; a topic for another post &ndash; and can easily sign up for too much to complete within the allotted time. This is the biggest reason that capstones would not be completed.</p>\n\n<p>How to mitigate this risk? Focus on what&rsquo;s needed for the project to get to graduation.</p>\n\n<p>Consider the metaphor of visiting an all-you-can-eat buffet the first time. It&rsquo;s amazing! There&rsquo;s so much food! You can eat whatever you want and they bring more! But pretty soon you&rsquo;ve tried a few things, and you&rsquo;re getting full. You didn&rsquo;t get to dessert yet because you ate too many dinner rolls.</p>\n\n<p>Students in a healthy relationship with their capstone project have similar issues. They want to do ALL THE THINGS and make an amazing project. They identify more things along the way that they want to do. All the while, the clock is counting down. While the student may believe all of the things are required to make a good project for a portfolio, it&rsquo;s unlikely that they&rsquo;re all required to complete capstone satisfactorily and graduate.</p>\n\n<p>(Students in an unhealthy relationship with their capstone project do the absolute minimum. It&rsquo;s rare, but it does happen occasionally. Usually this is affected by outside forces &ndash; illness, death, other life issues. The student may also have chosen a poor project that isn&rsquo;t engaging for them. That&rsquo;s for another post.)</p>\n\n<p>As an instructor, you must teach them about the low probability, high impact problem of not doing the right things for graduation. Graduation is always goal #1. Everything else is Phase 2.</p>\n\n<p>One of the ways I&rsquo;ve kept students on track to completing their capstones is through a grading rubric. This is also suited to another post, but briefly, a rubric identifies what they will do, how important that work is, and how it should be graded. It&rsquo;s a contract of sorts.</p>\n\n<p>Future posts:</p>\n\n<ul>\n<li><p>The power of the student-written grading rubric in capstone</p></li>\n\n<li><p>Scoping capstone projects and keeping students in scope</p></li>\n\n<li><p>Helping students choose engaging capstone projects</p></li>\n</ul>\n",
				"content_text": "<img src=\"uploads/2021/cc653e35f1.jpg\" width=\"408\" height=\"600\" alt=\"\" />\n\nAfter 20 years of teaching in academia, I've coached many capstone projects.\n\nPart of the capstone process is examining risk and mitigating it. Students have very little ability to do this, even after completing courses and assignments for a full degree program. This is because in a regular course, the instructor assigns all materials to consume and study and provides assignment(s) that have deadlines. Students manage time and scope based on work that's already defined these parameters for them.\n\nThat means that when a student is creating a project of their own, they do not understand how to properly scope their work within the time parameters. \n\nThey also don't understand risk. In a standard university course, risk during the semester usually looks like this for adult students with jobs and lives:\n\n* High probability, low impact: Work or kids get demanding during a portion of the course. Work ahead, talk to the instructor, and usually you get through this without significant damage to the grade.\n\n* Low probability, low impact: Not completing a weekly requirement: not attending class, not completing a weekly quiz, not posting a discussion post. This could be simply forgetting something, or it could be a conflict with other parts of life meant that the work just didn't get done.\n\n* Low probability, high impact: Death in the family, severe illness of the student or in the student's family, childbirth during the term. Universities have methods of working around these issues via course incompletes. Students should always talk to instructors to get help when these issues happen.\n\n* High probability, high impact: There are certain students who are consistently bad at managing time and always seem to have some drama going on. If you talk to other instructors who had this student previously, you'll discover the pattern across all courses. However, these students are rare in adult learning programs. \n\nIn other words, while students are always concerned about getting a lower grade than they think is reasonable for their work, talking to the instructor consistently and being engaged in the course is generally enough to get through it.\n\nFor a capstone project, they are concerned about failing the project and jeopardizing graduation. Low probability, high impact. However, when the student controls most of the project, as is true for most parameters of capstone, the probability is higher here than it is for other courses. Students don't understand how to scope their work -- a topic for another post -- and can easily sign up for too much to complete within the allotted time. This is the biggest reason that capstones would not be completed.\n\nHow to mitigate this risk? Focus on what's needed for the project to get to graduation.\n\nConsider the metaphor of visiting an all-you-can-eat buffet the first time. It's amazing! There's so much food! You can eat whatever you want and they bring more! But pretty soon you've tried a few things, and you're getting full. You didn't get to dessert yet because you ate too many dinner rolls. \n\nStudents in a healthy relationship with their capstone project have similar issues. They want to do ALL THE THINGS and make an amazing project. They identify more things along the way that they want to do. All the while, the clock is counting down. While the student may believe all of the things are required to make a good project for a portfolio, it's unlikely that they're all required to complete capstone satisfactorily and graduate.\n\n(Students in an unhealthy relationship with their capstone project do the absolute minimum. It's rare, but it does happen occasionally. Usually this is affected by outside forces -- illness, death, other life issues. The student may also have chosen a poor project that isn't engaging for them. That's for another post.)\n\nAs an instructor, you must teach them about the low probability, high impact problem of not doing the right things for graduation. Graduation is always goal #1. Everything else is Phase 2.\n\nOne of the ways I've kept students on track to completing their capstones is through a grading rubric. This is also suited to another post, but briefly, a rubric identifies what they will do, how important that work is, and how it should be graded. It's a contract of sorts. \n\nFuture posts:\n\n* The power of the student-written grading rubric in capstone\n\n* Scoping capstone projects and keeping students in scope\n\n* Helping students choose engaging capstone projects\n",
				"date_published": "2021-02-05T10:21:00-04:00",
				"url": "http://learnnocode.dev/2021/02/05/092122.html",
				"tags": ["Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/04/teaching-reflections-making.html",
				"title": "Teaching reflections #3: Making mistakes when teaching",
				"content_html": "<p>Mistakes happen. I&rsquo;ve certainly made my share.</p>\n\n<p>However, instructors FREAK OUT when they make mistakes when teaching. They mistype something, misconfigure some setting, make syntax errors, and so forth.</p>\n\n<p>Then they edit the video, completely concerned that they look stupid.</p>\n\n<p>Through the years, my students taught me that my mistakes were a powerful moment for them.</p>\n\n<p>First: OMG the instructor makes that SAME MISTAKE that I do all the time! Wow!!! (There&rsquo;s power in seeing yourself in a role model.)</p>\n\n<p>Second: When I make a mistake, I don&rsquo;t FREAK OUT. I look at the problem and try to figure it out. I ask the class what I did wrong. I model how to debug an error. This is important. Students are going to make errors too. Do they know how to debug?</p>\n\n<p>Finally: Even when I&rsquo;m on video and I make a mistake, I don&rsquo;t edit out the problem in my own videos. (For commercial video, this is another matter, of course.) Again, students should know that errors happen to everyone and tracking down the problem is part of programming.</p>\n\n<p>Indeed, that&rsquo;s the biggest takeaway: Everyone makes mistakes, so why can&rsquo;t you? It&rsquo;s part of programming and learning.</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/GHkymY6yKMg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n",
				"content_text": "Mistakes happen. I've certainly made my share.\n\nHowever, instructors FREAK OUT when they make mistakes when teaching. They mistype something, misconfigure some setting, make syntax errors, and so forth.\n\nThen they edit the video, completely concerned that they look stupid.\n\nThrough the years, my students taught me that my mistakes were a powerful moment for them. \n\nFirst: OMG the instructor makes that SAME MISTAKE that I do all the time! Wow!!! (There's power in seeing yourself in a role model.)\n\nSecond: When I make a mistake, I don't FREAK OUT. I look at the problem and try to figure it out. I ask the class what I did wrong. I model how to debug an error. This is important. Students are going to make errors too. Do they know how to debug?\n\nFinally: Even when I'm on video and I make a mistake, I don't edit out the problem in my own videos. (For commercial video, this is another matter, of course.) Again, students should know that errors happen to everyone and tracking down the problem is part of programming.\n\nIndeed, that's the biggest takeaway: Everyone makes mistakes, so why can't you? It's part of programming and learning.\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/GHkymY6yKMg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n",
				"date_published": "2021-02-04T16:50:32-04:00",
				"url": "http://learnnocode.dev/2021/02/04/teaching-reflections-making.html",
				"tags": ["Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/04/teaching-reflections-share.html",
				"title": "Teaching Reflections #2: Taking risks in assignments and learning",
				"content_html": "<p><img src=\"uploads/2021/1945b5382d.jpg\" width=\"600\" height=\"600\" alt=\"Next time you're afraid to share your ideas, remember someone once said in a meeting, Let's make a film with a tornado full of sharks.\" /></p>\n\n<p><small>Next time you&rsquo;re afraid to share your ideas, remember someone once said in a meeting, &ldquo;Let&rsquo;s make a film with a tornado full of sharks.&rdquo;</small></p>\n\n<p>Students are always afraid to think creatively about their work. In academia, they&rsquo;re worried about their grade, which drives much of this fear.</p>\n\n<p>However, taking risks is where student learning is greatest. Trying something and having it fail is one of the greatest experiences for a student, when handled correctly.</p>\n\n<p>This is why reflection is so important for students.</p>\n\n<p>At first, it feels like busy work. Why do I need to reflect on the work I did? I know what went right or wrong. I know what to do next time.</p>\n\n<p>However, when they must organize those thoughts into a coherent paper, video, or presentation, they learn much more about what happened.</p>\n\n<p>It&rsquo;s not just the project failed. Now it failed because I did X, so Y happened, and Z was the outcome. Next time, I&rsquo;ll do A because B. I expect that to help because C.</p>\n\n<p>Look at all of the &ldquo;because&rdquo; in that paragraph. Because is the hard part. It&rsquo;s easy to say something didn&rsquo;t work. It&rsquo;s really hard to articulate why and how to avoid that outcome in the future.</p>\n",
				"content_text": "<img src=\"uploads/2021/1945b5382d.jpg\" width=\"600\" height=\"600\" alt=\"Next time you're afraid to share your ideas, remember someone once said in a meeting, Let's make a film with a tornado full of sharks.\" />\n\n<small>Next time you're afraid to share your ideas, remember someone once said in a meeting, \"Let's make a film with a tornado full of sharks.\"</small>\n\nStudents are always afraid to think creatively about their work. In academia, they're worried about their grade, which drives much of this fear.\n\nHowever, taking risks is where student learning is greatest. Trying something and having it fail is one of the greatest experiences for a student, when handled correctly.\n\nThis is why reflection is so important for students. \n\nAt first, it feels like busy work. Why do I need to reflect on the work I did? I know what went right or wrong. I know what to do next time.\n\nHowever, when they must organize those thoughts into a coherent paper, video, or presentation, they learn much more about what happened. \n\nIt's not just the project failed. Now it failed because I did X, so Y happened, and Z was the outcome. Next time, I'll do A because B. I expect that to help because C.\n\nLook at all of the \"because\" in that paragraph. Because is the hard part. It's easy to say something didn't work. It's really hard to articulate why and how to avoid that outcome in the future.\n",
				"date_published": "2021-02-04T09:46:00-04:00",
				"url": "http://learnnocode.dev/2021/02/04/teaching-reflections-share.html",
				"tags": ["Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/02/04/teaching-reflections-introduction.html",
				"title": "Teaching reflections: Introduction",
				"content_html": "<p>I&rsquo;ve taught for 20 years in academia.</p>\n\n<p>I&rsquo;ve been a teaching assistant, an adjunct instructor, a lecturer with benefits, and a program director.</p>\n\n<p>I&rsquo;ve taught courses with syllabi developed by others. I&rsquo;ve developed my own syllabi for courses with objectives and nothing else. I&rsquo;ve identified and created my own courses from nothing to fit inside of a degree program. I&rsquo;ve created the entire degree program.</p>\n\n<p>I&rsquo;ve mentored maybe 200 students over the course of this time through some type of capstone or thesis project. These are the big projects that students create at the end of their degree program that synthesize everything they&rsquo;ve learned into a portfolio-worthy project. Most of my mentees were graduate students.</p>\n\n<p>Some of those students had a clear vision of what they wanted in life. Others went to grad school to &ldquo;learn more about computers.&rdquo;</p>\n\n<p>When it came time for capstone, everything changed. The style of teaching, the expectations of students and instructors, the work, the overwhelm, the self-doubt, and the joy of completion were always part of the journey.</p>\n\n<p>Over the next several posts, I will identify a few common themes that ran through nearly every capston project I advised. We&rsquo;ll start here, with one of my favorite capstone cartoons. Every student experienced this somewhere along the way.</p>\n\n<p><img src=\"uploads/2021/673f737d90.jpg\" width=\"600\" height=\"508\" alt=\"\" /></p>\n",
				"content_text": "I've taught for 20 years in academia.\n\nI've been a teaching assistant, an adjunct instructor, a lecturer with benefits, and a program director.\n\nI've taught courses with syllabi developed by others. I've developed my own syllabi for courses with objectives and nothing else. I've identified and created my own courses from nothing to fit inside of a degree program. I've created the entire degree program.\n\nI've mentored maybe 200 students over the course of this time through some type of capstone or thesis project. These are the big projects that students create at the end of their degree program that synthesize everything they've learned into a portfolio-worthy project. Most of my mentees were graduate students.\n\nSome of those students had a clear vision of what they wanted in life. Others went to grad school to \"learn more about computers.\" \n\nWhen it came time for capstone, everything changed. The style of teaching, the expectations of students and instructors, the work, the overwhelm, the self-doubt, and the joy of completion were always part of the journey.\n\nOver the next several posts, I will identify a few common themes that ran through nearly every capston project I advised. We'll start here, with one of my favorite capstone cartoons. Every student experienced this somewhere along the way.\n\n<img src=\"uploads/2021/673f737d90.jpg\" width=\"600\" height=\"508\" alt=\"\" />\n",
				"date_published": "2021-02-04T09:41:00-04:00",
				"url": "http://learnnocode.dev/2021/02/04/teaching-reflections-introduction.html",
				"tags": ["Teaching Reflections"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/24/its-in-squarespace.html",
				"title": "The Box",
				"content_html": "<p>It&rsquo;s in Squarespace, Wix, Microblog, WordPress, Drupal, Joomla, Softr, Gumroad, Teachable, Thinkific, and countless others.</p>\n\n<p>It&rsquo;s usually located under Design, Theme, or Advanced.</p>\n\n<p>It looks like this:\n<img src=\"uploads/2021/63556fea15.png\" width=\"447\" height=\"600\" alt=\"The Box.\" /></p>\n\n<p>It&rsquo;s The Box.</p>\n\n<p>Into this box, one pastes CSS.</p>\n\n<p>This implies that the website owner:</p>\n\n<ul>\n<li><p>knows enough CSS to know what to do with this box</p></li>\n\n<li><p>can form a CSS selector that &ldquo;works&rdquo; (i.e. specific enough to the problem but not overly specific)</p></li>\n\n<li><p>knows enough CSS properties to spell out the styling that they want</p></li>\n\n<li><p>understand the cascade enough to know how to make their style work when it doesn&rsquo;t</p></li>\n</ul>\n\n<p>Wow. So why is there so much code in no-code site builders?</p>\n\n<p>True, you don&rsquo;t have to use the box. But if you use no-code tools long enough, you&rsquo;ll eventually find something that you&rsquo;d like to tweak just a little bit relative to what you&rsquo;re able to customize with the tools.</p>\n\n<p>Where does one go to learn this CSS? The professional courses are all focused on layers of command-line tools, over-powered code editors, and Git repositories. None of these things help with The Box.</p>\n\n<p>Furthermore, the browser&rsquo;s devtools are pretty inpenetrable to those who don&rsquo;t know HTML and CSS already.</p>\n\n<p>In the short term, we must teach CSS to navigate The Box. (And let&rsquo;s face it, many of today&rsquo;s &ldquo;full stack&rdquo; coders aren&rsquo;t able to navigate it, either.)</p>\n\n<p>In the long term, we need to improve our interfaces in some way so The Box isn&rsquo;t needed.</p>\n\n<p>This is a big problem to solve that no one is talking about.</p>\n",
				"content_text": "It's in Squarespace, Wix, Microblog, WordPress, Drupal, Joomla, Softr, Gumroad, Teachable, Thinkific, and countless others.\n\nIt's usually located under Design, Theme, or Advanced.\n\nIt looks like this:\n<img src=\"uploads/2021/63556fea15.png\" width=\"447\" height=\"600\" alt=\"The Box.\" />\n\nIt's The Box.\n\nInto this box, one pastes CSS.\n\nThis implies that the website owner:\n\n* knows enough CSS to know what to do with this box\n\n* can form a CSS selector that \"works\" (i.e. specific enough to the problem but not overly specific)\n\n* knows enough CSS properties to spell out the styling that they want\n\n* understand the cascade enough to know how to make their style work when it doesn't\n\nWow. So why is there so much code in no-code site builders?\n\nTrue, you don't have to use the box. But if you use no-code tools long enough, you'll eventually find something that you'd like to tweak just a little bit relative to what you're able to customize with the tools.\n\nWhere does one go to learn this CSS? The professional courses are all focused on layers of command-line tools, over-powered code editors, and Git repositories. None of these things help with The Box.\n\nFurthermore, the browser's devtools are pretty inpenetrable to those who don't know HTML and CSS already. \n\nIn the short term, we must teach CSS to navigate The Box. (And let's face it, many of today's \"full stack\" coders aren't able to navigate it, either.)\n\nIn the long term, we need to improve our interfaces in some way so The Box isn't needed.\n\nThis is a big problem to solve that no one is talking about.\n",
				"date_published": "2021-01-24T14:55:00-04:00",
				"url": "http://learnnocode.dev/2021/01/24/its-in-squarespace.html",
				"tags": ["Tools General","Business and UX","Rants"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/23/i-keep-waiting.html",
				"title": "The Long Tail and Higher Ed",
				"content_html": "<p>I keep waiting for the day when higher ed discovers <a href=\"https://www.wired.com/2004/10/tail/\">The Long Tail</a>.</p>\n\n<p>Twenty years ago, if you wanted a master&rsquo;s degree, you went to whatever university was nearby. You paid in-state tuition, if applicable. You kept your job and went to school in person at night.</p>\n\n<p>Today, if you want a master&rsquo;s degree, you have many more choices for degrees. Many offer a 100% online option, or &ldquo;zero residency.&rdquo; Some have low residency &ndash; part of a class in person, or a whole class in person in a compressed timeline. The idea is that you do your residency while taking a vacation from your job, if needed. But pretty much you can go to any school you want, on any timeline you want (full time or part time) and get the degree you want.</p>\n\n<p>What is the difference between a MSCS at UMass, UVA, UMN, or UCLA? Why would I pick one school over the other?</p>\n\n<p>You can say it&rsquo;s all about the faculty, the location, the school&rsquo;s reputation, the specific courses. These elements certainly drive many choices.</p>\n\n<p>But truthfully, it comes down to price. It&rsquo;s a MSCS. Everyone offers one of these. They aren&rsquo;t all that different. To attract students, you have to drop your price. This leads to a spiral to the bottom.</p>\n\n<p>Instead, universities could be offering The Ultimate Degree In This Obscure Subject. Who offers the ultimate Digital Storytelling degree? The Web Development degree?</p>\n\n<p>The usual objection has to do with faculty. But since we&rsquo;re teaching under a majority-adjunct faculty model already, is this really an objection?</p>\n",
				"content_text": "I keep waiting for the day when higher ed discovers [The Long Tail] (https://www.wired.com/2004/10/tail/).\n\nTwenty years ago, if you wanted a master's degree, you went to whatever university was nearby. You paid in-state tuition, if applicable. You kept your job and went to school in person at night.\n\nToday, if you want a master's degree, you have many more choices for degrees. Many offer a 100% online option, or \"zero residency.\" Some have low residency -- part of a class in person, or a whole class in person in a compressed timeline. The idea is that you do your residency while taking a vacation from your job, if needed. But pretty much you can go to any school you want, on any timeline you want (full time or part time) and get the degree you want.\n\nWhat is the difference between a MSCS at UMass, UVA, UMN, or UCLA? Why would I pick one school over the other? \n\nYou can say it's all about the faculty, the location, the school's reputation, the specific courses. These elements certainly drive many choices.\n\nBut truthfully, it comes down to price. It's a MSCS. Everyone offers one of these. They aren't all that different. To attract students, you have to drop your price. This leads to a spiral to the bottom.\n\nInstead, universities could be offering The Ultimate Degree In This Obscure Subject. Who offers the ultimate Digital Storytelling degree? The Web Development degree? \n\nThe usual objection has to do with faculty. But since we're teaching under a majority-adjunct faculty model already, is this really an objection?\n",
				"date_published": "2021-01-23T15:22:00-04:00",
				"url": "http://learnnocode.dev/2021/01/23/i-keep-waiting.html",
				"tags": ["Rants"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/21/why-i-love.html",
				"title": "Why I love Softr.io",
				"content_html": "<p><a href=\"https://buildingastorybrand.com/lay-out-an-effective-home-page/\">Donald Miller of Storybrand: How to Strategically Lay Out an Effective Home Page</a></p>\n\n<p>Great advice on how to lay out a home page, but so many people get hung up on the design details.</p>\n\n<p>In about 30 minutes, I built out a template based on his description in his article: <a href=\"https://storybrand.softr.io/\">https://storybrand.softr.io/</a></p>\n\n<p>And it&rsquo;s a breeze to jump in and make changes with Softr, even if you don&rsquo;t know the software.</p>\n\n<p>This is an example of transferrance, one of the largest challenges in teaching technology. Miller wrote an amazing article with text descriptions of what the website should include. Softr has a great tool that reflects all of those descriptions. But putting these two things together is a bit more difficult for many people. By providing an example like this, the concepts become more tangible to learners.</p>\n",
				"content_text": "[Donald Miller of Storybrand: How to Strategically Lay Out an Effective Home Page] (https://buildingastorybrand.com/lay-out-an-effective-home-page/)\n\nGreat advice on how to lay out a home page, but so many people get hung up on the design details.\n\nIn about 30 minutes, I built out a template based on his description in his article: [https://storybrand.softr.io/] (https://storybrand.softr.io/)\n\nAnd it's a breeze to jump in and make changes with Softr, even if you don't know the software.\n\nThis is an example of transferrance, one of the largest challenges in teaching technology. Miller wrote an amazing article with text descriptions of what the website should include. Softr has a great tool that reflects all of those descriptions. But putting these two things together is a bit more difficult for many people. By providing an example like this, the concepts become more tangible to learners.\n",
				"date_published": "2021-01-21T10:23:24-04:00",
				"url": "http://learnnocode.dev/2021/01/21/why-i-love.html",
				"tags": ["Tools Website builders","Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/17/why-tailwind-isnt.html",
				
				"content_html": "<p><a href=\"https://dev.to/jaredcwhite/why-tailwind-isn-t-for-me-5c90\">Why Tailwind Isn&rsquo;t for Me</a></p>\n\n<p>I agree with everything in this article on a technical level.</p>\n\n<p>Tailwind also encourages the notion that HTML and CSS are fundamentally broken.</p>\n\n<p>That toxic mix of gatekeeping and egotism is what I dislike the most.</p>\n",
				"content_text": "[Why Tailwind Isn't for Me] (https://dev.to/jaredcwhite/why-tailwind-isn-t-for-me-5c90)\n\nI agree with everything in this article on a technical level.\n\nTailwind also encourages the notion that HTML and CSS are fundamentally broken.\n\nThat toxic mix of gatekeeping and egotism is what I dislike the most. \n",
				"date_published": "2021-01-17T13:00:44-04:00",
				"url": "http://learnnocode.dev/2021/01/17/why-tailwind-isnt.html",
				"tags": ["Rants"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/16/sea-shanties-ps.html",
				"title": "Sea Shanties, PS",
				"content_html": "<p>Folk music seems to rotate in recent history.</p>\n\n<p>It was a big thing in the 60s, of course. The singer/songwriter with acoustic guitar singing protest songs was everywhere &ndash; Bob Dylan, Joan Baez, Jonie Mitchell, Pete Seegar, Simon and Garfunkel, Peter Paul and Mary.</p>\n\n<p>It made a comeback in the 90s in the form of the Indigo Girls, Tracy Chapman, Suzanne Vega, Alison Krauss, Emmylou Harris, Michelle Shocked, and Christine Lavin. Notice these are all women - there weren&rsquo;t many men doing this.</p>\n\n<p>We got a little bit in the 2010s with Nickel Creek, Chris Thile, and Heather Nova.</p>\n\n<p>Why not sea shanties as a foundation going into the 2020s?</p>\n\n<h2>PPS</h2>\n\n<p>My friend and colleague <a href=\"https://www.marymalloy.net\">Mary Malloy</a> was on <a href=\"https://www.npr.org/2021/01/16/957593535/why-sea-shanties-have-taken-over-tiktok\">NPR talking about sea shanties</a>. She knows way, way more than I do about this part of history. Go listen. She&rsquo;s terrific.</p>\n",
				"content_text": "Folk music seems to rotate in recent history. \n\nIt was a big thing in the 60s, of course. The singer/songwriter with acoustic guitar singing protest songs was everywhere -- Bob Dylan, Joan Baez, Jonie Mitchell, Pete Seegar, Simon and Garfunkel, Peter Paul and Mary.\n\nIt made a comeback in the 90s in the form of the Indigo Girls, Tracy Chapman, Suzanne Vega, Alison Krauss, Emmylou Harris, Michelle Shocked, and Christine Lavin. Notice these are all women - there weren't many men doing this. \n\nWe got a little bit in the 2010s with Nickel Creek, Chris Thile, and Heather Nova.\n\nWhy not sea shanties as a foundation going into the 2020s?\n\n<h2>PPS</h2>\n\nMy friend and colleague [Mary Malloy] (https://www.marymalloy.net) was on [NPR talking about sea shanties] (https://www.npr.org/2021/01/16/957593535/why-sea-shanties-have-taken-over-tiktok). She knows way, way more than I do about this part of history. Go listen. She's terrific.\n",
				"date_published": "2021-01-16T10:31:00-04:00",
				"url": "http://learnnocode.dev/2021/01/16/sea-shanties-ps.html"
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/16/why-sea-shanties.html",
				"title": "Why sea shanties are taking over the internet this week",
				"content_html": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/bRE0dmCeTRw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\n<p>As a longtime musician, I&rsquo;ve been fascinated watching sea shanties take over the internet this past week.</p>\n\n<p>Playing or singing music with others is always a great joy. It is one of the hardest parts of this pandemic, missing my fellow musicians for weekly practice.</p>\n\n<p>This music taking over TikTok at this moment in time has several interesting threads.</p>\n\n<p>a. Sea shanties aren&rsquo;t difficult to sing. They have pleasant, simple melodies. They&rsquo;re easily harmonized.</p>\n\n<p>b. Thre are fantastic stories behind the songs. Some compare isolation on board ships with isolation in pandemic times. These stories are also very different than the usual run-of-the-mill pop song lyrics (seriously, how much can we sing about love and loss anyway?).</p>\n\n<p>c. No music training or instruments are required to participate. (Although in the latest versions, we have instruments added, including a beat track!)</p>\n\n<p>d. And this is critical &ndash; TikTok made it happen, because they allow EASY layering of your video on top of others. No Garage Band, no special software, just a free app with amazing usability.</p>\n\n<p>Now someone with no music training and few technical skills can join in the fun, creating something bigger than themselves with people they don&rsquo;t know in a time of isolation. What could possibly be more appropriate to this moment in history?</p>\n",
				"content_text": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/bRE0dmCeTRw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n\nAs a longtime musician, I've been fascinated watching sea shanties take over the internet this past week.\n\nPlaying or singing music with others is always a great joy. It is one of the hardest parts of this pandemic, missing my fellow musicians for weekly practice.\n\nThis music taking over TikTok at this moment in time has several interesting threads.\n\na. Sea shanties aren't difficult to sing. They have pleasant, simple melodies. They're easily harmonized. \n\nb. Thre are fantastic stories behind the songs. Some compare isolation on board ships with isolation in pandemic times. These stories are also very different than the usual run-of-the-mill pop song lyrics (seriously, how much can we sing about love and loss anyway?).\n\nc. No music training or instruments are required to participate. (Although in the latest versions, we have instruments added, including a beat track!)\n\nd. And this is critical -- TikTok made it happen, because they allow EASY layering of your video on top of others. No Garage Band, no special software, just a free app with amazing usability.\n\nNow someone with no music training and few technical skills can join in the fun, creating something bigger than themselves with people they don't know in a time of isolation. What could possibly be more appropriate to this moment in history?\n",
				"date_published": "2021-01-16T10:21:51-04:00",
				"url": "http://learnnocode.dev/2021/01/16/why-sea-shanties.html",
				"tags": ["Tools General"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/14/when-css-doesnt.html",
				"title": "When CSS doesn't work the way you expect, you should break it with JavaScript.",
				"content_html": "<p><a href=\"https://www.joshwcomeau.com/react/modern-spacer-gif/\">Why not bring back spacer GIFs?</a></p>\n\n<p>Josh advocates for a new separation of concerns, based on compartmentalized technologies (buttons, lists, etc) as opposed to HTML, CSS, JavaScript.</p>\n\n<p>Amusingly, the problem he describes would be fixed with some simple CSS, an understanding of the cascade and inheritance, and an hour or so figuring out how margins really work.</p>\n\n<p>Just like Josh doesn&rsquo;t understand CSS, not everyone understands JavaScript. It takes a lot of learning to get good at JavaScript. And shockingly, the same is true for CSS.</p>\n\n<p><strong>If you want to have CSS experts who can fix your problems, you can&rsquo;t put the CSS in your JavaScript.</strong></p>\n\n<p>That&rsquo;s why there&rsquo;s separation of concerns, old-school style: HTML, CSS, JavaScript.</p>\n\n<p>That&rsquo;s why Josh&rsquo;s proposed separation of concerns, based on components (button, list, media) flat out doesn&rsquo;t work. This separation of concerns relies on a front-end expert who can keep up with three different and rapidly evolving technologies. It doesn&rsquo;t allow for expertise in any one area.</p>\n\n<p>Thus, you wind up with a JavaScript expert who doesn&rsquo;t understand CSS and wonders why no one else (in his sphere) does either.</p>\n\n<p>I am amused that the ultimate solution to Josh&rsquo;s problem is to go with the old-school separation of concerns and talking to a CSS expert, rather than attempting to bend the web to his will using JavaScript alone.</p>\n",
				"content_text": "[Why not bring back spacer GIFs?] (https://www.joshwcomeau.com/react/modern-spacer-gif/)\n\nJosh advocates for a new separation of concerns, based on compartmentalized technologies (buttons, lists, etc) as opposed to HTML, CSS, JavaScript.\n\nAmusingly, the problem he describes would be fixed with some simple CSS, an understanding of the cascade and inheritance, and an hour or so figuring out how margins really work. \n\nJust like Josh doesn't understand CSS, not everyone understands JavaScript. It takes a lot of learning to get good at JavaScript. And shockingly, the same is true for CSS.\n\n**If you want to have CSS experts who can fix your problems, you can't put the CSS in your JavaScript.** \n\nThat's why there's separation of concerns, old-school style: HTML, CSS, JavaScript. \n\nThat's why Josh's proposed separation of concerns, based on components (button, list, media) flat out doesn't work. This separation of concerns relies on a front-end expert who can keep up with three different and rapidly evolving technologies. It doesn't allow for expertise in any one area. \n\nThus, you wind up with a JavaScript expert who doesn't understand CSS and wonders why no one else (in his sphere) does either.\n\nI am amused that the ultimate solution to Josh's problem is to go with the old-school separation of concerns and talking to a CSS expert, rather than attempting to bend the web to his will using JavaScript alone. \n",
				"date_published": "2021-01-14T12:14:38-04:00",
				"url": "http://learnnocode.dev/2021/01/14/when-css-doesnt.html",
				"tags": ["Rants"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/13/more-tips-for.html",
				"title": "More tips for teaching technology",
				"content_html": "<p>Two approaches to teaching tech:</p>\n\n<p>a. Teach the button-clicking in the tool</p>\n\n<p>b. Teach problem-solving across tools</p>\n\n<p>You need both to do well.</p>\n\n<p>Obviously A is where the technology product thrives &ndash; these are the help files. This is also where lots of YouTube videos and commercial video (like LinkedIn Learning) tends to thrive. Teach me how to use this software, rather than teach me how to solve this problem.</p>\n\n<p>A is also the technology bootcamps. Yes, they might teach JavaScript, but they&rsquo;re really teaching copy/paste concepts. They are not thinking about big hairy problems and how to attack them.</p>\n\n<p>B is much more difficult because it involves critical thinking, and sometimes your favorite tool isn&rsquo;t the answer. This is of little interest to software manufacturers, because it&rsquo;s rare that the software addresses a problem completely. (When it does, sometimes you&rsquo;ll see this technique used.)</p>\n\n<p>B tends to be where higher ed thrives. Without the economic necessity of talking about specific software packages, higher ed can talk about problems instead: how to think about problems, frameworks for addressing problems, identifying and evaluating potential solutions. Implementing those solutions tends to be assumed that you&rsquo;ll learn on your own, at least at the graduate level. Some button-clicking courses happen at the undergrad level.</p>\n\n<p>There&rsquo;s very little B happening in the tech bootcamps. Bootcamps are more concerned that students know how to copy/paste JavaScript and debug. They aren&rsquo;t concerned that students can think through a problem, identify a solution, and craft JavaScript to address it.</p>\n\n<p>Some careers specialize in A, some in B. But you need both sides of this teaching to do well and to advance in your career.</p>\n",
				"content_text": "Two approaches to teaching tech:\n\na. Teach the button-clicking in the tool\n\nb. Teach problem-solving across tools\n\nYou need both to do well.\n\nObviously A is where the technology product thrives -- these are the help files. This is also where lots of YouTube videos and commercial video (like LinkedIn Learning) tends to thrive. Teach me how to use this software, rather than teach me how to solve this problem.\n\nA is also the technology bootcamps. Yes, they might teach JavaScript, but they're really teaching copy/paste concepts. They are not thinking about big hairy problems and how to attack them.\n\nB is much more difficult because it involves critical thinking, and sometimes your favorite tool isn't the answer. This is of little interest to software manufacturers, because it's rare that the software addresses a problem completely. (When it does, sometimes you'll see this technique used.)\n\nB tends to be where higher ed thrives. Without the economic necessity of talking about specific software packages, higher ed can talk about problems instead: how to think about problems, frameworks for addressing problems, identifying and evaluating potential solutions. Implementing those solutions tends to be assumed that you'll learn on your own, at least at the graduate level. Some button-clicking courses happen at the undergrad level.\n\nThere's very little B happening in the tech bootcamps. Bootcamps are more concerned that students know how to copy/paste JavaScript and debug. They aren't concerned that students can think through a problem, identify a solution, and craft JavaScript to address it.\n\nSome careers specialize in A, some in B. But you need both sides of this teaching to do well and to advance in your career.\n",
				"date_published": "2021-01-13T15:44:00-04:00",
				"url": "http://learnnocode.dev/2021/01/13/more-tips-for.html",
				"tags": ["Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/12/future-topics.html",
				"title": "Future topics for teaching how to teach technology",
				"content_html": "<p>Button-clicking help files vs. frameworks for thinking about problems that need solving. Transferrance here is difficult. It&rsquo;s never self-evident.</p>\n\n<p>Button-clicking is behaviorism, while frameworks are more constructivist or cognitivist</p>\n\n<p>The right medium for presented material</p>\n\n<p>Reverse classroom as a model for commercial courses (testing to enforce live segments)</p>\n\n<p>Breaking materials into short chunks, along with practice problems</p>\n\n<p>Encouraging help among students via discussion/comments</p>\n\n<p>Sharing completed work and giving feedback using LBNT</p>\n",
				"content_text": "Button-clicking help files vs. frameworks for thinking about problems that need solving. Transferrance here is difficult. It's never self-evident.\n\nButton-clicking is behaviorism, while frameworks are more constructivist or cognitivist\n\nThe right medium for presented material\n\nReverse classroom as a model for commercial courses (testing to enforce live segments)\n\nBreaking materials into short chunks, along with practice problems\n\nEncouraging help among students via discussion/comments\n\nSharing completed work and giving feedback using LBNT\n",
				"date_published": "2021-01-12T09:18:00-04:00",
				"url": "http://learnnocode.dev/2021/01/12/future-topics.html",
				"tags": ["Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/11/jenkramerorg-site-redesign.html",
				"title": "JenKramer.org site redesign in progress",
				"content_html": "<p>My <a href=\"https://www.jenkramer.org\">JenKramer.org</a> website has been embarrassing for years now.</p>\n\n<p>I have finally redesigned it in <a href=\"https://www.softr.io\">Softr</a>.</p>\n\n<p>Why Softr? I don&rsquo;t need a site builder for my own websites.</p>\n\n<p>Even though my previous site was built with just HTML, CSS, and PHP includes, it was still annoying to update. Weeding through the code just to find the text I wanted was an extra level of thought that, honestly, wasn&rsquo;t required.</p>\n\n<p>A redesign was overwhelming to think about. Beyond color schemes, fonts, photos, and content, there are infinite ways to manage the layout.</p>\n\n<p>Softr removes all of those variables so I can focus on exactly what I want to say and how I want to say it.</p>\n\n<p>It&rsquo;s a dynamic wireframe in real time. I can run this site without worrying about all of the cross-browser testing, design, and technical details I&rsquo;d normally manage. Here I can focus on the flow of the site, the content presented, and the order of information.</p>\n\n<p>I&rsquo;ve based this site model on <a href=\"https://buildingastorybrand.com/lay-out-an-effective-home-page/\">Donald Miller&rsquo;s Storybrand wireframe tips</a>. I can change the text every day without worrying about having to redesign, or design a new block.</p>\n\n<p>Eventually, if I want, I can code my own site, once it&rsquo;s thoroughly tested with the public.</p>\n\n<p>I will say that I&rsquo;ve already received an email from an eager student. The site&rsquo;s been up for less than 48 hours. That&rsquo;s a sign of success.</p>\n",
				"content_text": "My [JenKramer.org] (https://www.jenkramer.org) website has been embarrassing for years now.\n\nI have finally redesigned it in [Softr] (https://www.softr.io).\n\nWhy Softr? I don't need a site builder for my own websites.\n\nEven though my previous site was built with just HTML, CSS, and PHP includes, it was still annoying to update. Weeding through the code just to find the text I wanted was an extra level of thought that, honestly, wasn't required.\n\nA redesign was overwhelming to think about. Beyond color schemes, fonts, photos, and content, there are infinite ways to manage the layout.\n\nSoftr removes all of those variables so I can focus on exactly what I want to say and how I want to say it.\n\nIt's a dynamic wireframe in real time. I can run this site without worrying about all of the cross-browser testing, design, and technical details I'd normally manage. Here I can focus on the flow of the site, the content presented, and the order of information.\n\nI've based this site model on [Donald Miller's Storybrand wireframe tips] (https://buildingastorybrand.com/lay-out-an-effective-home-page/). I can change the text every day without worrying about having to redesign, or design a new block.\n\nEventually, if I want, I can code my own site, once it's thoroughly tested with the public.\n\nI will say that I've already received an email from an eager student. The site's been up for less than 48 hours. That's a sign of success. \n",
				"date_published": "2021-01-11T12:17:34-04:00",
				"url": "http://learnnocode.dev/2021/01/11/jenkramerorg-site-redesign.html",
				"tags": ["Website Redesign Project"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/08/so-great-to.html",
				
				"content_html": "<p>So great to learn the theory of teaching, not just how to do it.</p>\n\n<p><img src=\"uploads/2021/c7d19cac64.png\" width=\"600\" height=\"459\" alt=\"\" /></p>\n",
				"content_text": "So great to learn the theory of teaching, not just how to do it. \n\n<img src=\"uploads/2021/c7d19cac64.png\" width=\"600\" height=\"459\" alt=\"\" />\n",
				"date_published": "2021-01-08T15:31:49-04:00",
				"url": "http://learnnocode.dev/2021/01/08/so-great-to.html"
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/07/latest-studio-photo.html",
				
				"content_html": "<p>Latest studio photo.</p>\n\n<p><img src=\"uploads/2021/a07b45af33.jpg\" width=\"600\" height=\"450\" alt=\"Photo of shelf on the wall, glass desk and chair, microphone on a boom.\" /></p>\n",
				"content_text": "Latest studio photo. \n\n<img src=\"uploads/2021/a07b45af33.jpg\" width=\"600\" height=\"450\" alt=\"Photo of shelf on the wall, glass desk and chair, microphone on a boom.\" />\n",
				"date_published": "2021-01-07T14:16:00-04:00",
				"url": "http://learnnocode.dev/2021/01/07/latest-studio-photo.html",
				"tags": ["Studio news"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/07/the-studio-is.html",
				
				"content_html": "<p><img src=\"uploads/2021/d6e1c8bae4.jpg\" width=\"600\" height=\"450\" alt=\"Mousepad that says Graduate Center at Marlboro College, helping to create leaders for a world online. \" />\nThe glass desk is good for being on camera. The mouse doesn&rsquo;t work without a mousepad, though, so I had to dig one out. It&rsquo;s 20 years old.</p>\n\n<p>Long live my alma mater, the Graduate Center at Marlboro College, now part of Emerson College.</p>\n",
				"content_text": "<img src=\"uploads/2021/d6e1c8bae4.jpg\" width=\"600\" height=\"450\" alt=\"Mousepad that says Graduate Center at Marlboro College, helping to create leaders for a world online. \" />\nThe glass desk is good for being on camera. The mouse doesn't work without a mousepad, though, so I had to dig one out. It's 20 years old. \n\nLong live my alma mater, the Graduate Center at Marlboro College, now part of Emerson College.\n\n\n",
				"date_published": "2021-01-07T14:13:00-04:00",
				"url": "http://learnnocode.dev/2021/01/07/the-studio-is.html",
				"tags": ["Studio news"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/05/overcoming-imposter-syndrome.html",
				"title": "Overcoming Imposter Syndrome",
				"content_html": "<p><a href=\"https://www.apa.org/gradpsych/2013/11/fraud\">Imposter Syndrome</a> is an extreme form of underconfidence. Your life is one big error! If they found out how little you know, you wouldn&rsquo;t be where you are now.</p>\n\n<p>I have no training in psychology, but if I had to pick an opposite for Imposter Syndrome, I&rsquo;d choose <a href=\"https://www.psychologytoday.com/us/basics/narcissism\">narcissism</a>. You&rsquo;re the best! You&rsquo;re amazing! The world should recognize your brilliance!</p>\n\n<p>In the tech world, Imposter Syndrome seems to infect younger women and older men. Younger women believe they know nothing because they just started their careers. Older men started to realize how little they knew when they just started their careers, and they believe they still know nothing now.</p>\n\n<p>It seems to happen to conference speakers and workshop instructors. Why was I picked to teach this topic? What do I know? If I&rsquo;m not comprehensive in this area, then clearly I know nothing.</p>\n\n<p>But here&rsquo;s the thing to know: <strong>no one has your life experience</strong>. You have a unique perspective on a topic and a unique way of presenting it.</p>\n\n<p>The best way to overcome Imposter Syndrome when teaching is to stop thinking about your 4th grade teacher. (S)he was the teacher, a &ldquo;sage on the stage.&rdquo; You were the student, expected to absorb. Knowledge transfer went one-way only.</p>\n\n<p>Instead, <strong>think of yourself as a coach, leading and guiding the group.</strong> You have some ideas that are important. However, you don&rsquo;t have a lock on the perfect way to teach the topic for everyone. There&rsquo;s value in having other people explain your material to each other. Some of your students have interesting perspective, ideas, and life connections to bring to your material. It&rsquo;s all an important part of an excellent class.</p>\n\n<p>How much does Imposter Syndrome affect you? <a href=\"https://paulineroseclance.com/pdf/IPTestandscoring.pdf\">Take the quiz.</a></p>\n",
				"content_text": "[Imposter Syndrome] (https://www.apa.org/gradpsych/2013/11/fraud) is an extreme form of underconfidence. Your life is one big error! If they found out how little you know, you wouldn't be where you are now.\n\nI have no training in psychology, but if I had to pick an opposite for Imposter Syndrome, I'd choose [narcissism] (https://www.psychologytoday.com/us/basics/narcissism). You're the best! You're amazing! The world should recognize your brilliance!\n\nIn the tech world, Imposter Syndrome seems to infect younger women and older men. Younger women believe they know nothing because they just started their careers. Older men started to realize how little they knew when they just started their careers, and they believe they still know nothing now.\n\nIt seems to happen to conference speakers and workshop instructors. Why was I picked to teach this topic? What do I know? If I'm not comprehensive in this area, then clearly I know nothing.\n\nBut here's the thing to know: **no one has your life experience**. You have a unique perspective on a topic and a unique way of presenting it.\n\nThe best way to overcome Imposter Syndrome when teaching is to stop thinking about your 4th grade teacher. (S)he was the teacher, a \"sage on the stage.\" You were the student, expected to absorb. Knowledge transfer went one-way only. \n\nInstead, **think of yourself as a coach, leading and guiding the group.** You have some ideas that are important. However, you don't have a lock on the perfect way to teach the topic for everyone. There's value in having other people explain your material to each other. Some of your students have interesting perspective, ideas, and life connections to bring to your material. It's all an important part of an excellent class. \n\nHow much does Imposter Syndrome affect you? [Take the quiz.] (https://paulineroseclance.com/pdf/IPTestandscoring.pdf)\n",
				"date_published": "2021-01-05T14:38:00-04:00",
				"url": "http://learnnocode.dev/2021/01/05/overcoming-imposter-syndrome.html",
				"tags": ["Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2021/01/03/the-nondesigners-design.html",
				"title": "The Non-Designer's Design Book, summarized (from Twitter)",
				"content_html": "<p>Design is a load of CRAP:</p>\n\n<ul>\n<li><p>Contrast</p></li>\n\n<li><p>Repetition</p></li>\n\n<li><p>Alignment</p></li>\n\n<li><p>Proximity</p></li>\n</ul>\n\n<p>Following rules = professional-looking designs</p>\n\n<p>Courtesy of Ms. Robin Williams, and HER fantastic book, <a href=\"https://peachpit.com/store/non-designers-design-book-9780133966152\">&ldquo;The Non-Designer&rsquo;s Design Book.&rdquo;</a></p>\n\n<p>**CONTRAST: **</p>\n\n<ul>\n<li><p>Contrasting colors, not a bunch of muddy neutrals</p></li>\n\n<li><p>Contrasting fonts, not Arial and more Arial</p></li>\n\n<li><p>Contrasting size, not sizes 12 and 14</p></li>\n</ul>\n\n<p><strong>REPETITION:</strong></p>\n\n<ul>\n<li><p>Repeated layouts, not something unique on every page</p></li>\n\n<li><p>Repeated elements, like icons used consistently</p></li>\n\n<li><p>Repeated colors, fonts, sizes</p></li>\n</ul>\n\n<p><strong>ALIGNMENT:</strong></p>\n\n<ul>\n<li><p>Think about straight lines on your web pages, which guide the eye and increase legibility</p></li>\n\n<li><p>On the web, everything looks better LEFT-ALIGNED (see note) and not CENTERED</p></li>\n\n<li><p>CENTERED is for WEDDING INVITATIONS</p></li>\n</ul>\n\n<p>(note) in left-to-right languages. If you use a right-to-left language, then use right alignment.</p>\n\n<p><strong>PROXIMITY:</strong></p>\n\n<ul>\n<li><p>The nearer two elements are on a page, the more likely that they&rsquo;re related.</p></li>\n\n<li><p>You don&rsquo;t have to shove elements into corners because they&rsquo;re empty.</p></li>\n\n<li><p>Separation in space means different ideas. Proximity means related ideas.</p></li>\n</ul>\n\n<p>The book is full of full-color picture examples illustrating all points.</p>\n\n<p>The tips are simple and easy to follow. It&rsquo;s straightforward to apply them to your own work. Applying them will take your design to the next level.</p>\n",
				"content_text": "Design is a load of CRAP:\n\n- Contrast\n\n- Repetition\n\n- Alignment\n\n- Proximity\n\nFollowing rules = professional-looking designs\n\nCourtesy of Ms. Robin Williams, and HER fantastic book, [\"The Non-Designer's Design Book.\"] \n(https://peachpit.com/store/non-designers-design-book-9780133966152)\n\n**CONTRAST: **\n\n- Contrasting colors, not a bunch of muddy neutrals\n\n- Contrasting fonts, not Arial and more Arial\n\n- Contrasting size, not sizes 12 and 14\n\n**REPETITION:**\n\n- Repeated layouts, not something unique on every page\n\n- Repeated elements, like icons used consistently\n\n- Repeated colors, fonts, sizes\n\n**ALIGNMENT:**\n\n- Think about straight lines on your web pages, which guide the eye and increase legibility\n\n- On the web, everything looks better LEFT-ALIGNED (see note) and not CENTERED\n\n- CENTERED is for WEDDING INVITATIONS\n\n(note) in left-to-right languages. If you use a right-to-left language, then use right alignment.\n\n**PROXIMITY:**\n\n- The nearer two elements are on a page, the more likely that they're related.\n\n- You don't have to shove elements into corners because they're empty.\n\n- Separation in space means different ideas. Proximity means related ideas.\n\nThe book is full of full-color picture examples illustrating all points. \n\nThe tips are simple and easy to follow. It's straightforward to apply them to your own work. Applying them will take your design to the next level.\n",
				"date_published": "2021-01-03T12:19:00-04:00",
				"url": "http://learnnocode.dev/2021/01/03/the-nondesigners-design.html",
				"tags": ["Business and UX"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/31/mental-models-are.html",
				"title": "Mental models are at the root of all teaching and learning.",
				"content_html": "<p><a href=\"https://www.nngroup.com/articles/mental-models/\">Jakob Nielsen</a> defines mental models from a UX perspective: <strong>&ldquo;A mental model is what the user believes about the system at hand.&rdquo;</strong></p>\n\n<p><a href=\"https://jamesclear.com/feynman-mental-models\">James Clear</a>, in a fantastic story about mental models, brings it back to its essence: <strong>&ldquo;If all you have is a hammer, everything looks like a nail&hellip; When a certain worldview dominates your thinking, you’ll try to explain every problem you face through that worldview.&rdquo;</strong></p>\n\n<p>When we look at web technologies, they are dominated by all kinds of mental models.</p>\n\n<p>The new JavaScript programmers, those who came to the web in the last 5 years or so, believe that the web is JavaScript-first, with HTML and CSS as annoyances that never &ldquo;work&rdquo; correctly. Those who have been in the web field for over 10 years know you start with semantic HTML, layer on the CSS for styling, and use JavaScript sparingly. However, when we&rsquo;ve taught the JavaScript-first model, we wind up with the modern day messes we see dominating the world of custom development.</p>\n\n<p>One of the big advantages I bring to the technology space is a breadth of knowledge in many areas. I started with Dreamweaver and HTML, later bolting on CSS. I moved on to pushing content management systems to their limits. I learned in a time when we didn&rsquo;t have a zillion command-line tools for managing files. I started working with CSS when there were no browser developer tools. All I had was the HTML and CSS from &ldquo;view source.&rdquo; I had to figure out what was broken on my own.</p>\n\n<p>Now as I make the switch from teaching code to teaching no-code, there is so much I bring to this new world.</p>\n\n<ul>\n<li>I can ground the problems that no-code tools solve in coding language. Or not.</li>\n<li>I can frame the problems no-coders encounter in the words of a model that speaks to them.</li>\n<li>Someone needs to teach HTML and CSS to those who will not use it professionally. Our current courses assume you have 27 different command line-based tools and make it look so difficult. But yet, we provide the &ldquo;CSS editing box&rdquo; for those who want to dump in their custom CSS. If you&rsquo;re going to put CSS in that box, you have to know how to write it. And in some ways, this problem is more difficult than what the professionals face. Have you SEEN the crap that passes for HTML these days? Have you tried to override it?</li>\n</ul>\n",
				"content_text": "[Jakob Nielsen] (https://www.nngroup.com/articles/mental-models/) defines mental models from a UX perspective: **\"A mental model is what the user believes about the system at hand.\"**\n\n[James Clear] (https://jamesclear.com/feynman-mental-models), in a fantastic story about mental models, brings it back to its essence: **\"If all you have is a hammer, everything looks like a nail... When a certain worldview dominates your thinking, you’ll try to explain every problem you face through that worldview.\"**\n\nWhen we look at web technologies, they are dominated by all kinds of mental models.\n\nThe new JavaScript programmers, those who came to the web in the last 5 years or so, believe that the web is JavaScript-first, with HTML and CSS as annoyances that never \"work\" correctly. Those who have been in the web field for over 10 years know you start with semantic HTML, layer on the CSS for styling, and use JavaScript sparingly. However, when we've taught the JavaScript-first model, we wind up with the modern day messes we see dominating the world of custom development.\n\nOne of the big advantages I bring to the technology space is a breadth of knowledge in many areas. I started with Dreamweaver and HTML, later bolting on CSS. I moved on to pushing content management systems to their limits. I learned in a time when we didn't have a zillion command-line tools for managing files. I started working with CSS when there were no browser developer tools. All I had was the HTML and CSS from \"view source.\" I had to figure out what was broken on my own.\n\nNow as I make the switch from teaching code to teaching no-code, there is so much I bring to this new world.\n\n- I can ground the problems that no-code tools solve in coding language. Or not.\n- I can frame the problems no-coders encounter in the words of a model that speaks to them.\n- Someone needs to teach HTML and CSS to those who will not use it professionally. Our current courses assume you have 27 different command line-based tools and make it look so difficult. But yet, we provide the \"CSS editing box\" for those who want to dump in their custom CSS. If you're going to put CSS in that box, you have to know how to write it. And in some ways, this problem is more difficult than what the professionals face. Have you SEEN the crap that passes for HTML these days? Have you tried to override it?\n",
				"date_published": "2020-12-31T09:06:12-04:00",
				"url": "http://learnnocode.dev/2020/12/31/mental-models-are.html",
				"tags": ["Tools General","Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/29/in-technology-good.html",
				
				"content_html": "<p>In technology, good tutorials are almost non-existent. Indeed, in the no-code space, the tools focus on clicking buttons to accomplish various tasks. They don&rsquo;t focus on how to think about a problem.</p>\n",
				"content_text": "In technology, good tutorials are almost non-existent. Indeed, in the no-code space, the tools focus on clicking buttons to accomplish various tasks. They don't focus on how to think about a problem.\n",
				"date_published": "2020-12-29T18:31:57-04:00",
				"url": "http://learnnocode.dev/2020/12/29/in-technology-good.html"
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/29/rethinking-teaching-life.html",
				"title": "Rethinking teaching life as artist life",
				"content_html": "<p>There are plenty of artists making a living by creating art. Let&rsquo;s define &ldquo;art&rdquo; narrowly here: painting, pottery, handmade jewelry, fiber arts, woodworking, sculpture, etc. The basic stuff you&rsquo;d see at a craft show.</p>\n\n<p>They typically have several outlets for their work, and through the combination, they make their living:</p>\n\n<ul>\n<li>personal studio space where they create work, which may also have a show space (or a separate show space)</li>\n<li>craft shows, previously all in-person, now some virtual</li>\n<li>Etsy store</li>\n<li>Galleries</li>\n</ul>\n\n<p>Fundamentally, artists love making art. The business side is what they do to support their work.</p>\n\n<p>I&rsquo;ve realized I&rsquo;m an artist too. I create courses. I create lots and lots of courses. I put them out in the world in many ways:</p>\n\n<ul>\n<li>higher education via Harvard Extension</li>\n<li>commercial video courses at LinkedIn Learning, Frontend Masters</li>\n<li>conference talks and workshops</li>\n</ul>\n\n<p>But although I have a &ldquo;home studio&rdquo; where I create content, I don&rsquo;t have a &ldquo;show space&rdquo; of any kind. For artists, that&rsquo;s usually where they start.</p>\n\n<p>Maybe it&rsquo;s time to fix that.</p>\n",
				"content_text": "There are plenty of artists making a living by creating art. Let's define \"art\" narrowly here: painting, pottery, handmade jewelry, fiber arts, woodworking, sculpture, etc. The basic stuff you'd see at a craft show.\n\nThey typically have several outlets for their work, and through the combination, they make their living:\n\n- personal studio space where they create work, which may also have a show space (or a separate show space)\n- craft shows, previously all in-person, now some virtual\n- Etsy store\n- Galleries\n\nFundamentally, artists love making art. The business side is what they do to support their work. \n\nI've realized I'm an artist too. I create courses. I create lots and lots of courses. I put them out in the world in many ways:\n\n- higher education via Harvard Extension\n- commercial video courses at LinkedIn Learning, Frontend Masters\n- conference talks and workshops\n\nBut although I have a \"home studio\" where I create content, I don't have a \"show space\" of any kind. For artists, that's usually where they start. \n\nMaybe it's time to fix that.\n",
				"date_published": "2020-12-29T10:25:31-04:00",
				"url": "http://learnnocode.dev/2020/12/29/rethinking-teaching-life.html",
				"tags": ["Website Redesign Project"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/29/the-hardest-part.html",
				"title": "The hardest part in starting a new initiative is figuring out where to start.",
				"content_html": "<p>Sometimes it&rsquo;s best to simply move forward with something and reset the goal as you move forward.</p>\n\n<p>Rather than initially setting the goal as &ldquo;I&rsquo;m reworking my entire life and this is my future full-time job,&rdquo; start with &ldquo;this seems like a super fun thing to do, so I&rsquo;m going to do it and see what happens.&rdquo;</p>\n\n<p><a href=\"https://www.dinaaamin.com/\">dina Amin</a> was an inspiration for pursuing fun. I saw her speak at the October 2019 Smashing Conference. She told a story of how she enjoyed taking things apart. Then she got a camera and figured out stop-motion photography. She made adorable little videos from the things she took apart. People love her work, and it eventually started to pay the bills through conference talks, commissions, workshops, commercial work, and so forth. This is the model of an artist.</p>\n\n<p>It&rsquo;s also hard to think about a problem when you&rsquo;re personally invested in it. When I think about new businesses, I think about all of the things that could go wrong, what happens if no one likes it or wants it, what happens if it doesn&rsquo;t make enough money (or any money), and so forth. These doubts are powerful.</p>\n\n<p>But what if it goes right? Sometimes that&rsquo;s even more scary.</p>\n",
				"content_text": "Sometimes it's best to simply move forward with something and reset the goal as you move forward.\n\nRather than initially setting the goal as \"I'm reworking my entire life and this is my future full-time job,\" start with \"this seems like a super fun thing to do, so I'm going to do it and see what happens.\"\n\n[dina Amin] (https://www.dinaaamin.com/) was an inspiration for pursuing fun. I saw her speak at the October 2019 Smashing Conference. She told a story of how she enjoyed taking things apart. Then she got a camera and figured out stop-motion photography. She made adorable little videos from the things she took apart. People love her work, and it eventually started to pay the bills through conference talks, commissions, workshops, commercial work, and so forth. This is the model of an artist.\n\nIt's also hard to think about a problem when you're personally invested in it. When I think about new businesses, I think about all of the things that could go wrong, what happens if no one likes it or wants it, what happens if it doesn't make enough money (or any money), and so forth. These doubts are powerful.\n\nBut what if it goes right? Sometimes that's even more scary.\n\n",
				"date_published": "2020-12-29T10:03:11-04:00",
				"url": "http://learnnocode.dev/2020/12/29/the-hardest-part.html",
				"tags": ["Website Redesign Project"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/28/foundations-of-a.html",
				"title": "Foundations of a good conference talk",
				"content_html": "<p>In non-pandemic times, I speak at a lot of conferences. While there, I attend talks.</p>\n\n<p>There are two ways to look at every talk at a conference.</p>\n\n<p><strong>a. It is adding on to a topic or area that you already know well.</strong> As a CSS expert, any CSS talks usually fall in this category for me.</p>\n\n<p><strong>b. You know nothing about the topic, but you&rsquo;ve heard about it peripherally and have some curiosity in this area.</strong> I&rsquo;m not a JavaScript expert. However, I&rsquo;m curious about what problems the latest JavaScript framework addresses. What are the advantages of React over Vue? Vue over React? Why do we need all of these frameworks anyway?</p>\n\n<p>In the first 3-5 minutes of your talk, you can satisfy both of these audiences quickly and easily by grounding the audience in the technology you&rsquo;re presenting.</p>\n\n<p>Amazing! How do you do it?</p>\n\n<ol>\n<li><p>&ldquo;The technology I&rsquo;m talking about today is Y. Y is {type of technology} that addresses ABC problems. It&rsquo;s put out by JKL Corporation/open source project/whatever, under a DEF license. It requires GHI technologies to configure and run.&rdquo; (describe dependencies, technology stack, or server configurations here)</p></li>\n\n<li><p>&ldquo;Y solves the following types of problems&hellip;&rdquo;</p></li>\n\n<li><p>&ldquo;You may wonder why we need Y, when we already have X, which addresses the same problems.  X and Y are indeed similar, so let&rsquo;s compare their strengths and weaknesses.&rdquo;</p></li>\n\n<li><p>&ldquo;Now let&rsquo;s get into the meat of Y.&rdquo; (Time to go geeky wild!!!)</p></li>\n</ol>\n\n<p>This formula conveys all kinds of background information about your technology very quickly. In 5 minutes, as a geeky person fluent in web technologies, I&rsquo;ve got all of the high-level details I need to decide if Y is any interest to me at all. That is an excellent talk already. Five stars!</p>\n\n<p>What if you already know X? Well, in 5 minutes, you may still pick up a nugget you didn&rsquo;t know before, or make a connection you hadn&rsquo;t previously made. For example, when you look at strengths and weaknesses of various technologies, you may not have been able to articulate why you&rsquo;re so excited about Y to your boss. Now you have the argument to do it.</p>\n\n<p>By the way, the <strong>true experts</strong> in technology never mind these high level discussions or think less of you for giving them. Everyone must learn sometime. If you can explain a technology in 5 minutes, that&rsquo;s mastery in action.</p>\n\n<p>The next time you give a talk, internally at your company or externally at a conference, keep these points in mind.</p>\n\n<p><strong>You don&rsquo;t have to be comprehensive in your presentation. You need to be memorable.</strong></p>\n\n<p>And being comprehensive means you&rsquo;re not memorable.</p>\n\n<p>Present so the audience learns and remembers, not like a specification. We can always look up the specification later.</p>\n",
				"content_text": "In non-pandemic times, I speak at a lot of conferences. While there, I attend talks. \n\nThere are two ways to look at every talk at a conference. \n\n**a. It is adding on to a topic or area that you already know well.** As a CSS expert, any CSS talks usually fall in this category for me. \n\n**b. You know nothing about the topic, but you've heard about it peripherally and have some curiosity in this area.** I'm not a JavaScript expert. However, I'm curious about what problems the latest JavaScript framework addresses. What are the advantages of React over Vue? Vue over React? Why do we need all of these frameworks anyway?\n\nIn the first 3-5 minutes of your talk, you can satisfy both of these audiences quickly and easily by grounding the audience in the technology you're presenting.\n\nAmazing! How do you do it?\n\n1. \"The technology I'm talking about today is Y. Y is {type of technology} that addresses ABC problems. It's put out by JKL Corporation/open source project/whatever, under a DEF license. It requires GHI technologies to configure and run.\" (describe dependencies, technology stack, or server configurations here)\n\n2. \"Y solves the following types of problems...\"\n\n3. \"You may wonder why we need Y, when we already have X, which addresses the same problems.  X and Y are indeed similar, so let's compare their strengths and weaknesses.\"\n\n4. \"Now let's get into the meat of Y.\" (Time to go geeky wild!!!)\n\nThis formula conveys all kinds of background information about your technology very quickly. In 5 minutes, as a geeky person fluent in web technologies, I've got all of the high-level details I need to decide if Y is any interest to me at all. That is an excellent talk already. Five stars!\n\nWhat if you already know X? Well, in 5 minutes, you may still pick up a nugget you didn't know before, or make a connection you hadn't previously made. For example, when you look at strengths and weaknesses of various technologies, you may not have been able to articulate why you're so excited about Y to your boss. Now you have the argument to do it.\n\nBy the way, the **true experts** in technology never mind these high level discussions or think less of you for giving them. Everyone must learn sometime. If you can explain a technology in 5 minutes, that's mastery in action. \n\nThe next time you give a talk, internally at your company or externally at a conference, keep these points in mind. \n\n**You don't have to be comprehensive in your presentation. You need to be memorable.**\n\nAnd being comprehensive means you're not memorable.\n\nPresent so the audience learns and remembers, not like a specification. We can always look up the specification later.\n",
				"date_published": "2020-12-28T10:14:45-04:00",
				"url": "http://learnnocode.dev/2020/12/28/foundations-of-a.html",
				"tags": ["Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/27/the-fundamental-formula.html",
				"title": "The fundamental formula to teaching code.",
				"content_html": "<p>Here it is, in four easy steps:</p>\n\n<ol>\n<li><p>Statement of problem encountered; brief, high-level description of solution.</p></li>\n\n<li><p>Let&rsquo;s walk through an example together, with every item explained.</p></li>\n\n<li><p>Now you try it. Here&rsquo;s a similar issue with a small twist. How would you solve this?</p></li>\n\n<li><p>Let&rsquo;s walk through how I thought about this problem. Your answer may be slightly different, and that&rsquo;s OK.</p></li>\n</ol>\n\n<p><em>{while there are more problems, repeat the loop until all problems are addressed}</em></p>\n\n<p>This can be molded into a conference variation, a video variation, or a classroom variation. The fundamental steps are the same.</p>\n",
				"content_text": "Here it is, in four easy steps:\n\n1. Statement of problem encountered; brief, high-level description of solution. \n\n2. Let's walk through an example together, with every item explained.\n\n3. Now you try it. Here's a similar issue with a small twist. How would you solve this?\n\n4. Let's walk through how I thought about this problem. Your answer may be slightly different, and that's OK.\n\n*{while there are more problems, repeat the loop until all problems are addressed}*\n\nThis can be molded into a conference variation, a video variation, or a classroom variation. The fundamental steps are the same.\n",
				"date_published": "2020-12-27T11:19:00-04:00",
				"url": "http://learnnocode.dev/2020/12/27/the-fundamental-formula.html",
				"tags": ["Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/27/so-why-teach.html",
				"title": "So why teach?",
				"content_html": "<p><strong>I teach because I want to make the web a better place.</strong></p>\n\n<p>I want <strong>everyone</strong> to have a voice.</p>\n\n<p>I don&rsquo;t want anyone kept out by gatekeepers.</p>\n\n<p>When I started in this industry, the gatekeepers were understanding files and folders, FTP, and syntax errors.</p>\n\n<p>Those gatekeepers are still around, but there&rsquo;s much more now: command lines; configuring the computer with more complicated technology to get around files, folders, and FTP; new kinds of syntax errors. Tech bros. Smugness. Dismissiveness of anyone not white, male, and no more than 33 years old. A belief that technology must be complicated and hurt to work.</p>\n\n<p>Also: &ldquo;Really? You&rsquo;ve never heard of XYZ technology?&rdquo; Deliver this line with a slight air of smugness and superiority. Follow that with, &ldquo;I&rsquo;d be happy to sit down with you and walk you through it,&rdquo; again delivered in a very slightly condescending way, implying that you cannot figure out this information on your own and thank goodness there&rsquo;s someone to help you.</p>\n\n<p>So, time for the guide to help the other guides. Let&rsquo;s build a list of teaching tips.</p>\n",
				"content_text": "**I teach because I want to make the web a better place.**\n\nI want **everyone** to have a voice. \n\nI don't want anyone kept out by gatekeepers.\n\nWhen I started in this industry, the gatekeepers were understanding files and folders, FTP, and syntax errors. \n\nThose gatekeepers are still around, but there's much more now: command lines; configuring the computer with more complicated technology to get around files, folders, and FTP; new kinds of syntax errors. Tech bros. Smugness. Dismissiveness of anyone not white, male, and no more than 33 years old. A belief that technology must be complicated and hurt to work.\n\nAlso: \"Really? You've never heard of XYZ technology?\" Deliver this line with a slight air of smugness and superiority. Follow that with, \"I'd be happy to sit down with you and walk you through it,\" again delivered in a very slightly condescending way, implying that you cannot figure out this information on your own and thank goodness there's someone to help you.\n\nSo, time for the guide to help the other guides. Let's build a list of teaching tips.\n",
				"date_published": "2020-12-27T09:34:44-04:00",
				"url": "http://learnnocode.dev/2020/12/27/so-why-teach.html",
				"tags": ["Rants","Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/27/when-teaching-youre.html",
				"title": "When teaching, you're the guide, not the hero.",
				"content_html": "<p><small><em>(As always, my world is front-end web development. These are observations made after watching conference speakers and attending workshops in my field.)</em></small></p>\n\n<p>The motivation for teaching is often to get attention or get famous, show off their personal skills, gain fortune, or to try to be an early dominator in some obscure technology or another.</p>\n\n<p>Notice how not one of those reasons is <strong>to help other people.</strong></p>\n\n<p>In other words, these prospective teachers want to be the <strong>hero</strong>, not a <strong>guide</strong>.</p>\n\n<p>A hero is Batman. A guide is Alfred.</p>\n\n<p><img src=\"uploads/2020/6f5239a7fb.jpg\" width=\"246\" height=\"335\" alt=\" Luke and Yoda.\" /></p>\n\n<p>Where would Batman be without Alfred? Luke without Yoda? Cinderella without her fairy godmother?</p>\n\n<p><strong>The hero is the student.</strong> The student is slaying the demon of ignorance.</p>\n\n<p>Your role is to help them by providing them the sword. They will take the skills you teach and wield them on a chaotic universe.</p>\n",
				"content_text": "<small><em>(As always, my world is front-end web development. These are observations made after watching conference speakers and attending workshops in my field.)</em></small>\n\nThe motivation for teaching is often to get attention or get famous, show off their personal skills, gain fortune, or to try to be an early dominator in some obscure technology or another.\n\nNotice how not one of those reasons is **to help other people.**\n\nIn other words, these prospective teachers want to be the **hero**, not a **guide**. \n\nA hero is Batman. A guide is Alfred. \n\n<img src=\"uploads/2020/6f5239a7fb.jpg\" width=\"246\" height=\"335\" alt=\" Luke and Yoda.\" />\n\nWhere would Batman be without Alfred? Luke without Yoda? Cinderella without her fairy godmother?\n\n**The hero is the student.** The student is slaying the demon of ignorance. \n\nYour role is to help them by providing them the sword. They will take the skills you teach and wield them on a chaotic universe.\n\n",
				"date_published": "2020-12-27T09:26:00-04:00",
				"url": "http://learnnocode.dev/2020/12/27/when-teaching-youre.html",
				"tags": ["Rants","Teaching Tips"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/26/creating-a-home.html",
				"title": "Creating a home studio",
				"content_html": "\n\n<p>Super proud of how my studio is coming along.</p>\n\n<p>I never thought I&rsquo;d have a home recording studio. Then there was a pandemic.</p>\n\n<p>Where I&rsquo;d been traveling to California to record LinkedIn Learning courses 3-4 times per year, recording 2-3 courses per trip, I was suddenly reduced to no travel.</p>\n\n<p>I started recording at home, screencast recordings only, without me on camera. That&rsquo;s when we thought maybe we&rsquo;d be able to resume in-person recording in the fall.</p>\n\n<p>Now we&rsquo;re experimenting with on-camera recording. I know nothing about cameras, video, sound, lighting, or anything else in that realm. But now I have free consulting from some very talented LinkedIn Learning staff, who are able to recommend equipment, walk me through setting it up, and helping me look and sound the best I can.</p>\n\n<p>I can&rsquo;t imagine that we&rsquo;ll be back to 100% on-site recording at LinkedIn when the pandemic is over. A home studio becomes an asset that I can use in many other ways going forward.\n<img src=\"uploads/2020/1fb0793a01.jpg\" width=\"600\" height=\"450\" alt=\"Shelf in my recording studio.\" /></p>\n\n<h2 id=\"about-the-shelf\">About the shelf</h2>\n\n<p><a href=\"https://www.wayfair.com/furniture/pdp/hashtag-home-dakota-geometric-bookcase-w001787825.html\">The shelf</a> has been so much fun to assemble. I bought it for this purpose, so it&rsquo;s fun and different. It&rsquo;s mounted on the wall with some brackets and a support board.</p>\n\n<p>The items on the shelf are things from around the house, plus a few items I bought especially for this purpose.</p>\n\n<p>Things bought specifically for the shelf:\n<ul>\n  <li><a href=\"https://www.amazon.com/gp/product/B07CW96RWW/\" target=\"_blank\">The light-up sign</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B08JHQL5TG/\" target=\"_blank\">The bonsai tree light</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B08JM77Q1F/\" target=\"_blank\">The music note &ldquo;neon&rdquo; (LED) sign</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B072MK3TSZ/\" target=\"_blank\">Fake succulent plants!</a></li>\n  </ul></p>\n\n<p>Other shelf additions:\n<ul>\n  <li>My Shattuck Teaching Award from Harvard, and an Extension School glass</li>\n    <li>A ceramic box from my maternal grandmother</li>\n  <li>Hulk and Thor USB drives, and a tiny pottery teapot ornament</li>\n  <li>Russian nesting dolls, brought home from the USSR by my paternal grandparents in the 80s</li>\n  <li>DVD versions of some old Lynda.com courses</li>\n    <li>Photo of my old German shepherds</li>\n  <li>Copies of all three of my books with a very cool lava rock</li>\n  <li>Pottery jug from North Carolina, bought while traveling with an old friend</li>\n  <li>A ceramic box from my parents and a handblown glass vase from an old friend</li>\n  </ul></p>\n",
				"content_text": "Super proud of how my studio is coming along.\n\nI never thought I'd have a home recording studio. Then there was a pandemic.\n\nWhere I'd been traveling to California to record LinkedIn Learning courses 3-4 times per year, recording 2-3 courses per trip, I was suddenly reduced to no travel. \n\nI started recording at home, screencast recordings only, without me on camera. That's when we thought maybe we'd be able to resume in-person recording in the fall.\n\nNow we're experimenting with on-camera recording. I know nothing about cameras, video, sound, lighting, or anything else in that realm. But now I have free consulting from some very talented LinkedIn Learning staff, who are able to recommend equipment, walk me through setting it up, and helping me look and sound the best I can. \n\nI can't imagine that we'll be back to 100% on-site recording at LinkedIn when the pandemic is over. A home studio becomes an asset that I can use in many other ways going forward. \n<img src=\"uploads/2020/1fb0793a01.jpg\" width=\"600\" height=\"450\" alt=\"Shelf in my recording studio.\" />\n## About the shelf\n\n[The shelf] (https://www.wayfair.com/furniture/pdp/hashtag-home-dakota-geometric-bookcase-w001787825.html) has been so much fun to assemble. I bought it for this purpose, so it's fun and different. It's mounted on the wall with some brackets and a support board.\n\nThe items on the shelf are things from around the house, plus a few items I bought especially for this purpose.\n\nThings bought specifically for the shelf:\n<ul>\n  <li><a href=\"https://www.amazon.com/gp/product/B07CW96RWW/\" target=\"_blank\">The light-up sign</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B08JHQL5TG/\" target=\"_blank\">The bonsai tree light</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B08JM77Q1F/\" target=\"_blank\">The music note \"neon\" (LED) sign</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B072MK3TSZ/\" target=\"_blank\">Fake succulent plants!</a></li>\n  </ul>\n\nOther shelf additions:\n<ul>\n  <li>My Shattuck Teaching Award from Harvard, and an Extension School glass</li>\n    <li>A ceramic box from my maternal grandmother</li>\n  <li>Hulk and Thor USB drives, and a tiny pottery teapot ornament</li>\n  <li>Russian nesting dolls, brought home from the USSR by my paternal grandparents in the 80s</li>\n  <li>DVD versions of some old Lynda.com courses</li>\n    <li>Photo of my old German shepherds</li>\n  <li>Copies of all three of my books with a very cool lava rock</li>\n  <li>Pottery jug from North Carolina, bought while traveling with an old friend</li>\n  <li>A ceramic box from my parents and a handblown glass vase from an old friend</li>\n  </ul>\n\n",
				"date_published": "2020-12-26T18:10:00-04:00",
				"url": "http://learnnocode.dev/2020/12/26/creating-a-home.html",
				"tags": ["Website Redesign Project"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/23/redesigning-with-softrio.html",
				"title": "Redesigning with softr.io and Airtable",
				"content_html": "\n\n<h2 id=\"sidebar-preamble\">Sidebar Preamble</h2>\n\n<p>My <a href=\"https://www.jenkramer.org\">current website</a> is a total embarrassment.</p>\n\n<p>I&rsquo;ve needed to change it for years. In fact, it&rsquo;s been on my whiteboard &ldquo;things to do&rdquo; for <strong>five years.</strong></p>\n\n<p>As I move into the world of no-code, I&rsquo;m redesigning my site with many different no-code platforms. I&rsquo;ll be trying out different platforms and putting together some kind of website over the next several weeks.</p>\n\n<p><a href=\"https://learnnocode.dev/2020/12/23/redesigning-jenkramerorg-an.html\">Read more about the project</a></p>\n\n<p>&nbsp;</p>\n\n<h2 id=\"today-s-lovely-contestants\">Today&rsquo;s Lovely Contestants</h2>\n\n<p>I&rsquo;ve started with <a href=\"https://www.softr.io\">Softr.io</a>  and <a href=\"https://www.airtable.com/\">Airtable</a> because I&rsquo;ve heard a lot of buzz about Softr lately. As for Airtable, I already had a base available that I need to integrate into my site better.</p>\n\n<p>&nbsp;</p>\n\n<h3 id=\"airtable-base\">Airtable base</h3>\n\n<p>Earlier this year, I created a <a href=\"https://www.linkedin.com/learning/no-code-solutions-for-websites-and-apps/organize-data-with-airtable\">single video on Airtable for LinkedIn Learning</a>. It&rsquo;s a base of currently active video courses I&rsquo;ve created for different publishers.</p>\n\n<p><em>Base: Airtable&rsquo;s word for &ldquo;database.&rdquo; I guess database is too scary.</em></p>\n\n<p>The base, as it currently exists, is <a href=\"https://airtable.com/shrE6tr0nt0tPVhLi\">public and available for viewing</a>.</p>\n\n<p>I have this integrated on my current website via iframe. Again, easy, low maintenance, but there&rsquo;s more that can be done with Airtable.</p>\n\n<p>&nbsp;</p>\n\n<h3 id=\"softr\">Softr</h3>\n\n<p>Feels very much like Squarespace, but with fewer design features, less heavy lifting, and more integration with other tools.</p>\n\n<p>There are a few templates to choose from, but these are just assemblages of blocks with a certain theme. These templates seem to drive content in the no-code space. Probably another topic for another rant sometime&hellip; this is not exclusively a Softr thing.</p>\n\n<p>Choose from a series of &ldquo;blocks&rdquo; with fixed layouts to assemble the page. Populate with data. Limited ability for changes to colors, fonts, layouts.</p>\n\n<p>&nbsp;</p>\n\n<h2 id=\"the-big-reveal\">The Big Reveal</h2>\n\n<p><a href=\"https://jen4web.softr.io\">My Softr/Airtable website</a></p>\n\n<p>Money spent: $0 (free version of Airtable, free version of Softr)</p>\n",
				"content_text": "## Sidebar Preamble ##\nMy [current website] (https://www.jenkramer.org) is a total embarrassment.\n\nI've needed to change it for years. In fact, it's been on my whiteboard \"things to do\" for **five years.**\n\nAs I move into the world of no-code, I'm redesigning my site with many different no-code platforms. I'll be trying out different platforms and putting together some kind of website over the next several weeks.\n\n[Read more about the project] (https://learnnocode.dev/2020/12/23/redesigning-jenkramerorg-an.html)\n\n\n<p>&nbsp;</p>\n\n## Today's Lovely Contestants ##\n\nI've started with [Softr.io] (https://www.softr.io)  and [Airtable] (https://www.airtable.com/) because I've heard a lot of buzz about Softr lately. As for Airtable, I already had a base available that I need to integrate into my site better.\n\n<p>&nbsp;</p>\n\n\n### Airtable base\n\nEarlier this year, I created a [single video on Airtable for LinkedIn Learning] (https://www.linkedin.com/learning/no-code-solutions-for-websites-and-apps/organize-data-with-airtable). It's a base of currently active video courses I've created for different publishers.\n\n*Base: Airtable's word for \"database.\" I guess database is too scary.*\n\nThe base, as it currently exists, is [public and available for viewing] (https://airtable.com/shrE6tr0nt0tPVhLi).\n\nI have this integrated on my current website via iframe. Again, easy, low maintenance, but there's more that can be done with Airtable.\n\n<p>&nbsp;</p>\n\n\n### Softr\n\nFeels very much like Squarespace, but with fewer design features, less heavy lifting, and more integration with other tools.\n\nThere are a few templates to choose from, but these are just assemblages of blocks with a certain theme. These templates seem to drive content in the no-code space. Probably another topic for another rant sometime... this is not exclusively a Softr thing.\n\nChoose from a series of \"blocks\" with fixed layouts to assemble the page. Populate with data. Limited ability for changes to colors, fonts, layouts.\n\n<p>&nbsp;</p>\n\n\n## The Big Reveal\n\n[My Softr/Airtable website] (https://jen4web.softr.io)\n\nMoney spent: $0 (free version of Airtable, free version of Softr)\n\n\n",
				"date_published": "2020-12-23T10:53:00-04:00",
				"url": "http://learnnocode.dev/2020/12/23/redesigning-with-softrio.html",
				"tags": ["Tools Website builders","Tools Web app builders","Website Redesign Project"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/23/redesigning-jenkramerorg-an.html",
				"title": "Redesigning jenkramer.org: an exercise",
				"content_html": "\n\n<p>The state of jenkramer.org is pretty horrible.</p>\n\n<p>I redesigned this site in 2014 using Bootstrap 3, LESS for styling, and PHP includes.</p>\n\n<p>You might be wondering why I chose those technologies, of all of the technologies that were out there.</p>\n\n<p>a. Keep in mind that while 2014 was only 7 years minus one week ago, <strong>the web has changed radically since then.</strong></p>\n\n<ul>\n  <li>The initial React release was in mid-2013. Angular was in 2016. We were in a period of \"framework flavor of the month\" at this point. Every conference seemed to have people desperate to dominate the next big thing in JavaScript. There were a lot of things coming out then.</li>\n\n<li><strong>jQuery was still very much a thing in 2014.</strong> jQuery Mobile was starting to decline with the availability (and superior responsive design) of Bootstrap. jQuery UI wasn't responsive and was declining as well, plus Bootstrap had its own UI components.</li>\n\n<li><strong>Bootstrap was a massive game-changer on the front-end.</strong> In 2014, people were only starting to transition to Flexbox for layouts from floats. People don't understand floats for layout. And people definitely don't understand CSS. Responsive design was still a mystery to many people, particularly how to code it by hand. And Bootstrap was HUGE in the bootcamps, which were thriving by this point. Indeed, that's often how CSS was taught: Here's Bootstrap. Use it.</li>\n\n<li>Grunt might have been a thing, with Gulp gaining traction. Webpack didn't exist. Node was out there, but only just getting started. </li>\n\n  <li>This sounds like my web stories from 20 years ago. <strong>Keep in mind it's only been SEVEN YEARS. </strong></li>\n  </ul>\n\n<p>b. <strong>Bootstrap only integrated with LESS at this point.</strong> Sass integration was coming, but not for a while.</p>\n\n<p>c. OK, PHP includes were old, even then. But they are super easy to configure, and they gave me some simple moving parts for repeated content on the site to make maintenance easier. <strong>Technology doesn&rsquo;t have to hurt to work, people.</strong></p>\n\n<p>d. It&rsquo;s only a 10 page website. I wasn&rsquo;t blogging. I wasn&rsquo;t trying to sell anything. No one was maintaining the site but me. I could have installed WordPress, but then I&rsquo;d have to maintain it. <strong>There wasn&rsquo;t any real reason to build anything but a static site.</strong></p>\n\n<h2 id=\"redesign-time\">Redesign time</h2>\n\n<p>So why does one need to redesign?\n<ul>\n<li><strong>The technology driving the site is old and dated. It&rsquo;s too hard to maintain, or it&rsquo;s a security threat. </strong><br>\nWell&hellip; yeah, OK, Bootstrap 3 is old, and so are PHP includes. But nothing is a security threat here, and I don&rsquo;t mind writing HTML to update content. Basically, I&rsquo;m &ldquo;meh&rdquo; on my tech stack, as long as the site is telling a good story. Honestly, I don&rsquo;t need to take hours to set up a development environment, or installing things, or figuring out why X in the stack isn&rsquo;t working. I don&rsquo;t have time for that. It&rsquo;s a simple website.</li></p>\n\n<p><li><strong>The content is dated and needs revising.</strong><br>\nTHIS is the reason the site needs a redesign. There&rsquo;s waaaaay too much blah blah on the site. Nothing is focused. It&rsquo;s all over the place, trying to be comprehensive. So time to focus the story.</li></p>\n\n<h2 id=\"focusing-the-story\">Focusing the story</h2>\n\n<p>I have a lot of writing to do before I&rsquo;m ready to redesign completely. Honestly, this is a separate post to explain what I&rsquo;m doing and why.</p>\n\n<p>But let&rsquo;s just say it&rsquo;s this, in a nutshell:</p>\n\n<p><ul>\n    <li>Cut the blah blah in half, or three-quarters.</li></p>\n\n<p><li>More showing, less telling.</li></p>\n\n<p><li>Use Donald Miller&rsquo;s Storybrand principles to drive layout.</li></p>\n\n<p><li>Reframe the site to the customer as hero, rather than I&rsquo;m the hero. (Also Donald Miller.)</li>\n  </ul></p>\n\n<h2 id=\"the-plan\">The Plan</h2>\n\n<p>Since I&rsquo;m pivoting to the no-code world (probably another story elsewhere), I&rsquo;m going to try out a bunch of no-code tools to see what I can learn and create in those environments.</p>\n\n<p>I&rsquo;ll try creating something once a week as possible.</p>\n\n<p>I&rsquo;ll post the results here, along with a review.</p>\n\n<p>These might not be the final versions of my site. Indeed, they&rsquo;re probably not. But they&rsquo;re a great way to try out the products, identify positives and negatives of each, and decide what I want to do going forward.</p>\n",
				"content_text": "The state of jenkramer.org is pretty horrible.\n\nI redesigned this site in 2014 using Bootstrap 3, LESS for styling, and PHP includes. \n\nYou might be wondering why I chose those technologies, of all of the technologies that were out there. \n\na. Keep in mind that while 2014 was only 7 years minus one week ago, **the web has changed radically since then.** \n\n<ul>\n  <li>The initial React release was in mid-2013. Angular was in 2016. We were in a period of \"framework flavor of the month\" at this point. Every conference seemed to have people desperate to dominate the next big thing in JavaScript. There were a lot of things coming out then.</li>\n\n<li><strong>jQuery was still very much a thing in 2014.</strong> jQuery Mobile was starting to decline with the availability (and superior responsive design) of Bootstrap. jQuery UI wasn't responsive and was declining as well, plus Bootstrap had its own UI components.</li>\n\n<li><strong>Bootstrap was a massive game-changer on the front-end.</strong> In 2014, people were only starting to transition to Flexbox for layouts from floats. People don't understand floats for layout. And people definitely don't understand CSS. Responsive design was still a mystery to many people, particularly how to code it by hand. And Bootstrap was HUGE in the bootcamps, which were thriving by this point. Indeed, that's often how CSS was taught: Here's Bootstrap. Use it.</li>\n\n<li>Grunt might have been a thing, with Gulp gaining traction. Webpack didn't exist. Node was out there, but only just getting started. </li>\n\n  <li>This sounds like my web stories from 20 years ago. <strong>Keep in mind it's only been SEVEN YEARS. </strong></li>\n  </ul>\n\nb. <strong>Bootstrap only integrated with LESS at this point.</strong> Sass integration was coming, but not for a while.\n\nc. OK, PHP includes were old, even then. But they are super easy to configure, and they gave me some simple moving parts for repeated content on the site to make maintenance easier. <strong>Technology doesn't have to hurt to work, people.</strong>\n\nd. It's only a 10 page website. I wasn't blogging. I wasn't trying to sell anything. No one was maintaining the site but me. I could have installed WordPress, but then I'd have to maintain it. **There wasn't any real reason to build anything but a static site.**\n\n\n\n\n## Redesign time\n\nSo why does one need to redesign?\n<ul>\n<li><strong>The technology driving the site is old and dated. It's too hard to maintain, or it's a security threat. </strong><br>\nWell... yeah, OK, Bootstrap 3 is old, and so are PHP includes. But nothing is a security threat here, and I don't mind writing HTML to update content. Basically, I'm \"meh\" on my tech stack, as long as the site is telling a good story. Honestly, I don't need to take hours to set up a development environment, or installing things, or figuring out why X in the stack isn't working. I don't have time for that. It's a simple website.</li>\n\n<li><strong>The content is dated and needs revising.</strong><br>\nTHIS is the reason the site needs a redesign. There's waaaaay too much blah blah on the site. Nothing is focused. It's all over the place, trying to be comprehensive. So time to focus the story.</li>\n\n## Focusing the story\n\nI have a lot of writing to do before I'm ready to redesign completely. Honestly, this is a separate post to explain what I'm doing and why.\n\nBut let's just say it's this, in a nutshell:\n\n  <ul>\n    <li>Cut the blah blah in half, or three-quarters.</li>\n\n<li>More showing, less telling.</li>\n\n<li>Use Donald Miller's Storybrand principles to drive layout.</li>\n\n<li>Reframe the site to the customer as hero, rather than I'm the hero. (Also Donald Miller.)</li>\n  </ul>\n\n  \n  \n## The Plan\n\nSince I'm pivoting to the no-code world (probably another story elsewhere), I'm going to try out a bunch of no-code tools to see what I can learn and create in those environments. \n\nI'll try creating something once a week as possible.\n\nI'll post the results here, along with a review.\n\nThese might not be the final versions of my site. Indeed, they're probably not. But they're a great way to try out the products, identify positives and negatives of each, and decide what I want to do going forward.\n",
				"date_published": "2020-12-23T10:29:00-04:00",
				"url": "http://learnnocode.dev/2020/12/23/redesigning-jenkramerorg-an.html",
				"tags": ["Website Redesign Project"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/16/theres-an-awful.html",
				"title": "There's an awful lot of code in no-code",
				"content_html": "<p>Code -&gt; no code:\n<ul>\n  <li>Authenticated -&gt; logged in</li></p>\n\n<p><li>Margin -&gt; spacing outside</li></p>\n\n<p><li>Padding -&gt; spacing inside</li></p>\n\n<p><li>Typography -&gt; Fonts (use Word terminology)</li>\n  </ul></p>\n\n<p>It&rsquo;s more than database -&gt; collection/base/etc.</p>\n\n<p>There&rsquo;s a pile of 20-somethings building no-code tools without realizing that many of these problems have been solved before. We&rsquo;ve all seen the movie already.</p>\n\n<p>In 2005, we had a battle between WordPress and Joomla. WordPress won. They had a great user interface. They tested it carefully and made sure it was &ldquo;intuitive.&rdquo;</p>\n\n<p>Today, no-code tools are &ldquo;intuitive and easy to use&rdquo; for the people who build them, or the people who are invested in learning them. They are not easy to pick up. User testing would show that these tools are still pretty uniformly horrible.</p>\n\n<p>No-code isn&rsquo;t getting rid of coding syntax, but keeping all of the names, labels, and requirements of coding.</p>\n\n<p>You have to take it a step further. If I still have to know how to think about an application, how to build it, where the data is going, which box is the right one to apply the class, then you haven&rsquo;t really solved my no-code problems.</p>\n\n<p>Start with terminology. Stop thinking like a coder.</p>\n",
				"content_text": "Code -> no code:\n<ul>\n  <li>Authenticated -> logged in</li>\n\n  <li>Margin -> spacing outside</li>\n\n  <li>Padding -> spacing inside</li>\n\n  <li>Typography -> Fonts (use Word terminology)</li>\n  </ul>\n\nIt's more than database -> collection/base/etc.\n\nThere's a pile of 20-somethings building no-code tools without realizing that many of these problems have been solved before. We've all seen the movie already.\n\nIn 2005, we had a battle between WordPress and Joomla. WordPress won. They had a great user interface. They tested it carefully and made sure it was \"intuitive.\"\n\nToday, no-code tools are \"intuitive and easy to use\" for the people who build them, or the people who are invested in learning them. They are not easy to pick up. User testing would show that these tools are still pretty uniformly horrible.\n\nNo-code isn't getting rid of coding syntax, but keeping all of the names, labels, and requirements of coding.\n\nYou have to take it a step further. If I still have to know how to think about an application, how to build it, where the data is going, which box is the right one to apply the class, then you haven't really solved my no-code problems.\n\nStart with terminology. Stop thinking like a coder.\n",
				"date_published": "2020-12-16T16:07:00-04:00",
				"url": "http://learnnocode.dev/2020/12/16/theres-an-awful.html",
				"tags": ["Rants"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/16/setting-goals-and.html",
				"title": "Setting Goals and Value Proposition: Formulas",
				"content_html": "\n\n<h2 id=\"setting-goals\">Setting Goals</h2>\n\n<blockquote>\n  <p>For people who believe _____, who want ____, my work creates ______.  </p>\n  <cite><a href=\"https://sethgodinwrites.medium.com/professionals-produce-with-intent-cc603f230a32\" target=\"_blank\">Seth Godin</a></cite>\n  </blockquote>\n\n<h2 id=\"value-proposition\">Value Proposition</h2>\n\n<blockquote>\n<p>[company name] makes it easy for [target customer] to [thing that product does] so that [benefit of the product].</p>\n  <cite><a href=\"https://twitter.com/TaraReed_\" target=\"_blank\">Tara Reed</a></cite>\n  </blockquote>\n  \n",
				"content_text": "## Setting Goals ##\n\n<blockquote>\n  <p>For people who believe _____, who want ____, my work creates ______.  </p>\n  <cite><a href=\"https://sethgodinwrites.medium.com/professionals-produce-with-intent-cc603f230a32\" target=\"_blank\">Seth Godin</a></cite>\n  </blockquote>\n\n## Value Proposition ##\n\n<blockquote>\n<p>[company name] makes it easy for [target customer] to [thing that product does] so that [benefit of the product].</p>\n  <cite><a href=\"https://twitter.com/TaraReed_\" target=\"_blank\">Tara Reed</a></cite>\n  </blockquote>\n  \n  \n",
				"date_published": "2020-12-16T09:29:00-04:00",
				"url": "http://learnnocode.dev/2020/12/16/setting-goals-and.html",
				"tags": ["Business and UX"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/15/nocode-links.html",
				"title": "No-code links",
				"content_html": "<p>Tools mentioned in a December 3 networking event&hellip;</p>\n\n<p><a href=\"https://www.glideapps.com/\">www.glideapps.com</a></p>\n\n<p><a href=\"https://www.adalo.com/\">www.adalo.com</a></p>\n\n<p><a href=\"https://www.metaranx.com/\">www.metaranx.com</a></p>\n\n<p><a href=\"https://webflow.com/\">webflow.com</a></p>\n\n<p><a href=\"https://carrd.co/\">carrd.co</a></p>\n\n<p><a href=\"https://bubble.io/\">bubble.io</a></p>\n\n<p><a href=\"https://airtable.com/\">airtable.com</a></p>\n\n<p><a href=\"https://coda.io/\">coda.io</a></p>\n\n<p><a href=\"https://www.notion.so/\">www.notion.so</a></p>\n\n<p><a href=\"https://zapier.com/\">zapier.com</a></p>\n\n<p><a href=\"https://www.softr.io/\">www.softr.io</a> + airtable</p>\n\n<p>www.notion.so/Notion-Advent-Calendar-e159dcd0e70c4e919e278a2f95ec125d</p>\n\n<p><a href=\"https://www.mightynetworks.com/\">www.mightynetworks.com</a></p>\n\n<p><a href=\"https://circle.so/\">circle.so</a></p>\n\n<p>Some products built with no-code (bubble mostly) <a href=\"https://www.getcuppa.io/\">www.getcuppa.io</a></p>\n\n<p><a href=\"https://beta.shoutout.so/\">beta.shoutout.so</a></p>\n\n<p>nutriso.so</p>\n\n<p>Gumroad for selling products <a href=\"https://gumroad.com/\">gumroad.com</a></p>\n\n<p>A look into how products are built <a href=\"http://sideprojectstack.com/\">sideprojectstack.com</a></p>\n\n<p><a href=\"https://www.sheet2site.com/\">www.sheet2site.com</a></p>\n\n<p><a href=\"https://pory.io/\">pory.io</a></p>\n\n<p>badunicorn.vc</p>\n",
				"content_text": "Tools mentioned in a December 3 networking event...\n\n[www.glideapps.com](https://www.glideapps.com/)\n\n[www.adalo.com](https://www.adalo.com/)\n\n[www.metaranx.com](https://www.metaranx.com/)\n\n[webflow.com](https://webflow.com/)\n\n[carrd.co](https://carrd.co/)\n\n[bubble.io](https://bubble.io/)\n\n[airtable.com](https://airtable.com/)\n\n[coda.io](https://coda.io/)\n\n[www.notion.so](https://www.notion.so/)\n\n[zapier.com](https://zapier.com/)\n\n[www.softr.io](https://www.softr.io/) + airtable\n\nwww.notion.so/Notion-Advent-Calendar-e159dcd0e70c4e919e278a2f95ec125d\n\n[www.mightynetworks.com](https://www.mightynetworks.com/)\n\n[circle.so](https://circle.so/)\n\nSome products built with no-code (bubble mostly) [www.getcuppa.io](https://www.getcuppa.io/)\n\n[beta.shoutout.so](https://beta.shoutout.so/)\n\nnutriso.so\n\nGumroad for selling products [gumroad.com](https://gumroad.com/)\n\nA look into how products are built [sideprojectstack.com](http://sideprojectstack.com/)\n\n[www.sheet2site.com](https://www.sheet2site.com/)\n\n[pory.io](https://pory.io/)\n\nbadunicorn.vc\n",
				"date_published": "2020-12-15T13:12:00-04:00",
				"url": "http://learnnocode.dev/2020/12/15/nocode-links.html",
				"tags": ["Tools General"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/as-lowcode-and.html",
				"title": "As low-code and no-code approaches rise, developers brace for new challenges",
				"content_html": "<p><a href=\"https://www.zdnet.com/article/as-low-code-and-no-code-approaches-rise-developers-brace-for-new-challenges/\">&lsquo;People rapidly create things, rapidly deploy things and rapidly regret things. Each subsequent generation of technology makes it easier to build bad solutions fast.&rsquo;</a></p>\n\n<p>One of the things that bothers me about no-code approaches is <a href=\"https://en.wikipedia.org/wiki/Technical_debt\">technical debt</a>.</p>\n\n<p><strong>It&rsquo;s 1996 in the No-Code Universe.</strong> As the web was in 1996, the No-Code Universe is at the phase where the tools are exploding, the money flows like kegs of beer at a frat party, and new companies are created, get bought, and go under every day.</p>\n\n<p>We will come out with some winners, but as we should have learned from the web, there will be far more losers than winners. The consolidation will be significant. Your data will slosh around all over Silicon Valley, and you may not even realize it&rsquo;s happening.</p>\n\n<p>Be sure you know how to get your data out of a system before you commit your business to running on it as a platform.</p>\n",
				"content_text": "['People rapidly create things, rapidly deploy things and rapidly regret things. Each subsequent generation of technology makes it easier to build bad solutions fast.'] (https://www.zdnet.com/article/as-low-code-and-no-code-approaches-rise-developers-brace-for-new-challenges/)\n\nOne of the things that bothers me about no-code approaches is [technical debt] (https://en.wikipedia.org/wiki/Technical_debt).\n\n**It's 1996 in the No-Code Universe.** As the web was in 1996, the No-Code Universe is at the phase where the tools are exploding, the money flows like kegs of beer at a frat party, and new companies are created, get bought, and go under every day.\n\nWe will come out with some winners, but as we should have learned from the web, there will be far more losers than winners. The consolidation will be significant. Your data will slosh around all over Silicon Valley, and you may not even realize it's happening.\n\nBe sure you know how to get your data out of a system before you commit your business to running on it as a platform.\n",
				"date_published": "2020-12-14T15:53:45-04:00",
				"url": "http://learnnocode.dev/2020/12/14/as-lowcode-and.html",
				"tags": ["NoCode Reading"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/is-nocode-going.html",
				"title": "Is No-Code Going To Steal Your Job?",
				"content_html": "<p><a href=\"https://builtin.com/software-engineering-perspectives/no-code-replace-programmers?es_id=b1380061cf\">Spoiler alert: No.</a></p>\n\n<p>When I started working as web professional in 2000, there were no &ldquo;tools.&rdquo; You used a text editor or you used Macromedia Dreamweaver (current version: 3).</p>\n\n<p>The #1 client request was to be able to edit their own website without having to go through their web designer. That&rsquo;s because most web designers SUCKED. They were utterly incapable of answering or returning phone calls or emails. The common story was the designer sitting on the client request for weeks at a time.</p>\n\n<p>Then in 2002, along came Macromedia Contribute. Designed to integrate with Dreamweaver templates, this simple&reg; software let clients make their own updates to their websites.</p>\n\n<p>Much handwringing ensued. OMG, there would soon be NO WORK for web designers!</p>\n\n<p>Of course, nothing could have been further from the truth. There was plenty of work for web designers. However, if &ldquo;work&rdquo; meant fixing typos or updating copy, yeah, you did lose out on some of that. But there was still a ridiculous amount of work for those wanting to build new websites.</p>\n\n<p>Fast forward to 2020. The latest round of no-code tools are allowing people to automate tasks, build forms, create their own simple websites, and integrate technologies without developers.</p>\n\n<p>Much handwringing ensued. OMG, there would soon be NO WORK for programmers!</p>\n\n<p>And just like before, nothing could be further from the truth.</p>\n\n<p>a. Who codes the no-code tools?&hellip;</p>\n\n<p>b. Who does one call when one pushes no-code to the limit, or wants that one feature that seems to be nowhere in the no-code space?</p>\n\n<p>c. The power of creation from nothing will still lie with programmers. But the junk work of building yet another form that emails the contents to the owner, or writes it to some spreadsheet? That stuff is going to go away.</p>\n\n<p>Trust me, you won&rsquo;t miss it.</p>\n",
				"content_text": "[Spoiler alert: No.] (https://builtin.com/software-engineering-perspectives/no-code-replace-programmers?es_id=b1380061cf)\n\nWhen I started working as web professional in 2000, there were no \"tools.\" You used a text editor or you used Macromedia Dreamweaver (current version: 3). \n\nThe #1 client request was to be able to edit their own website without having to go through their web designer. That's because most web designers SUCKED. They were utterly incapable of answering or returning phone calls or emails. The common story was the designer sitting on the client request for weeks at a time.\n\nThen in 2002, along came Macromedia Contribute. Designed to integrate with Dreamweaver templates, this simple(r) software let clients make their own updates to their websites. \n\nMuch handwringing ensued. OMG, there would soon be NO WORK for web designers! \n\nOf course, nothing could have been further from the truth. There was plenty of work for web designers. However, if \"work\" meant fixing typos or updating copy, yeah, you did lose out on some of that. But there was still a ridiculous amount of work for those wanting to build new websites.\n\nFast forward to 2020. The latest round of no-code tools are allowing people to automate tasks, build forms, create their own simple websites, and integrate technologies without developers.\n\nMuch handwringing ensued. OMG, there would soon be NO WORK for programmers! \n\nAnd just like before, nothing could be further from the truth.\n\na. Who codes the no-code tools?...\n\nb. Who does one call when one pushes no-code to the limit, or wants that one feature that seems to be nowhere in the no-code space?\n\nc. The power of creation from nothing will still lie with programmers. But the junk work of building yet another form that emails the contents to the owner, or writes it to some spreadsheet? That stuff is going to go away.\n\nTrust me, you won't miss it.\n",
				"date_published": "2020-12-14T14:26:04-04:00",
				"url": "http://learnnocode.dev/2020/12/14/is-nocode-going.html",
				"tags": ["NoCode Reading"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/web-app-builders.html",
				
				"content_html": "<p><em>Web app builders</em></p>\n\n<p><a href=\"https://www.ycode.com/\">Ycode</a></p>\n\n<p><a href=\"https://bubble.io/\">Bubble</a></p>\n",
				"content_text": "*Web app builders*\n\n[Ycode] (https://www.ycode.com/)\n\n[Bubble] (https://bubble.io/)\n\n",
				"date_published": "2020-12-14T09:58:00-04:00",
				"url": "http://learnnocode.dev/2020/12/14/web-app-builders.html",
				"tags": ["Tools Web app builders"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/descript-for-video.html",
				
				"content_html": "<p><a href=\"https://www.descript.com/\">Descript</a> for video editing, automatic transcripts, um removal</p>\n",
				"content_text": "[Descript] (https://www.descript.com/) for video editing, automatic transcripts, um removal\n",
				"date_published": "2020-12-14T09:52:11-04:00",
				"url": "http://learnnocode.dev/2020/12/14/descript-for-video.html",
				"tags": ["Video"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/notion-advent-calendar.html",
				
				"content_html": "<p><a href=\"https://www.notion.so/Notion-Advent-Calendar-e159dcd0e70c4e919e278a2f95ec125d\">Notion Advent Calendar</a></p>\n",
				"content_text": "[Notion Advent Calendar] (https://www.notion.so/Notion-Advent-Calendar-e159dcd0e70c4e919e278a2f95ec125d)\n",
				"date_published": "2020-12-14T09:49:55-04:00",
				"url": "http://learnnocode.dev/2020/12/14/notion-advent-calendar.html"
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/nice-list-of.html",
				
				"content_html": "<p><a href=\"https://twitter.com/digitalmakershq/status/1333414590168915968\">Nice list of no-code tools by category</a></p>\n",
				"content_text": "[Nice list of no-code tools by category] (https://twitter.com/digitalmakershq/status/1333414590168915968)\n",
				"date_published": "2020-12-14T09:25:00-04:00",
				"url": "http://learnnocode.dev/2020/12/14/nice-list-of.html",
				"tags": ["Tools General"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/days-of-maker.html",
				"title": "Website builders without code",
				"content_html": "<p>*Ones I know well: *</p>\n\n<p>🔹 Squarespace</p>\n\n<p>🔹 Wix (wizard version)</p>\n\n<p>🔹 WordPress (.org, .com) (also debatable if this is no-code)</p>\n\n<p>🔹 Webflow</p>\n\n<p><em>Learning:</em></p>\n\n<p>🔹 EditorX</p>\n\n<p><em>Need to look into:</em></p>\n\n<p>🔹 <a href=\"https://carrd.co/\">Carrd</a></p>\n\n<p>🔹 <a href=\"https://www.softr.io/\">Softr</a></p>\n\n<p>🔹 <a href=\"https://pory.io/\">Pory</a></p>\n\n<p>🔹 <a href=\"https://dorik.com/\">Dorik</a></p>\n\n<p>Several of these are Airtable integrators for web apps. Others are for single page sites.</p>\n",
				"content_text": "*Ones I know well: *\n\n🔹 Squarespace\n\n🔹 Wix (wizard version)\n\n🔹 WordPress (.org, .com) (also debatable if this is no-code)\n\n🔹 Webflow\n\n\n*Learning:*\n\n🔹 EditorX\n\n\n*Need to look into:*\n\n🔹 [Carrd] (https://carrd.co/)\n\n🔹 [Softr] (https://www.softr.io/)\n\n🔹 [Pory] (https://pory.io/)\n\n🔹 [Dorik] (https://dorik.com/)\n\nSeveral of these are Airtable integrators for web apps. Others are for single page sites.\n",
				"date_published": "2020-12-14T08:54:00-04:00",
				"url": "http://learnnocode.dev/2020/12/14/days-of-maker.html",
				"tags": ["Tools Website builders"]
			}
	]
}
