{
	"version": "https://jsonfeed.org/version/1",
	"title": "Jen Kramer",
	"icon": "https://micro.blog/jen4web/avatar.jpg",
	"home_page_url": "https://learnnocode.dev/",
	"feed_url": "https://learnnocode.dev/feed.json",
	"items": [
		
			{
				"id": "http://jen4web.micro.blog/2020/12/26/creating-a-home.html",
				"title": "Creating a home studio",
				"content_html": "\n\n<p>Super proud of how my studio is coming along.</p>\n\n<p>I never thought I&rsquo;d have a home recording studio. Then there was a pandemic.</p>\n\n<p>Where I&rsquo;d been traveling to California to record LinkedIn Learning courses 3-4 times per year, recording 2-3 courses per trip, I was suddenly reduced to no travel.</p>\n\n<p>I started recording at home, screencast recordings only, without me on camera. That&rsquo;s when we thought maybe we&rsquo;d be able to resume in-person recording in the fall.</p>\n\n<p>Now we&rsquo;re experimenting with on-camera recording. I know nothing about cameras, video, sound, lighting, or anything else in that realm. But now I have free consulting from some very talented LinkedIn Learning staff, who are able to recommend equipment, walk me through setting it up, and helping me look and sound the best I can.</p>\n\n<p>I can&rsquo;t imagine that we&rsquo;ll be back to 100% on-site recording at LinkedIn when the pandemic is over. A home studio becomes an asset that I can use in many other ways going forward.</p>\n\n<h2 id=\"about-the-shelf\">About the shelf</h2>\n\n<p><a href=\"https://www.wayfair.com/furniture/pdp/hashtag-home-dakota-geometric-bookcase-w001787825.html\">The shelf</a> has been so much fun to assemble. I bought it for this purpose, so it&rsquo;s fun and different. It&rsquo;s mounted on the wall with some brackets and a support board.</p>\n\n<p>The items on the shelf are things from around the house, plus a few items I bought especially for this purpose.</p>\n\n<p>Things bought specifically for the shelf:\n<ul>\n  <li><a href=\"https://www.amazon.com/gp/product/B07CW96RWW/\" target=\"_blank\">The light-up sign</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B08JHQL5TG/\" target=\"_blank\">The bonsai tree light</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B08JM77Q1F/\" target=\"_blank\">The music note &ldquo;neon&rdquo; (LED) sign</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B072MK3TSZ/\" target=\"_blank\">Fake succulent plants!</a></li>\n  </ul></p>\n\n<p>Other shelf additions:\n<ul>\n  <li>My Shattuck Teaching Award from Harvard, and an Extension School glass</li>\n    <li>A ceramic box from my maternal grandmother</li>\n  <li>Hulk and Thor USB drives, and a tiny pottery teapot ornament</li>\n  <li>Russian nesting dolls, brought home from the USSR by my paternal grandparents in the 80s</li>\n  <li>DVD versions of some old Lynda.com courses</li>\n    <li>Photo of my old German shepherds</li>\n  <li>Copies of all three of my books with a very cool lava rock</li>\n  <li>Pottery jug from North Carolina, bought while traveling with an old friend</li>\n  <li>A ceramic box from my parents and a handblown glass vase from an old friend</li>\n  </ul></p>\n\n<p><img src=\"uploads/2020/1fb0793a01.jpg\" width=\"600\" height=\"450\" alt=\"Shelf in my recording studio.\" /></p>\n",
				"content_text": "Super proud of how my studio is coming along.\n\nI never thought I'd have a home recording studio. Then there was a pandemic.\n\nWhere I'd been traveling to California to record LinkedIn Learning courses 3-4 times per year, recording 2-3 courses per trip, I was suddenly reduced to no travel. \n\nI started recording at home, screencast recordings only, without me on camera. That's when we thought maybe we'd be able to resume in-person recording in the fall.\n\nNow we're experimenting with on-camera recording. I know nothing about cameras, video, sound, lighting, or anything else in that realm. But now I have free consulting from some very talented LinkedIn Learning staff, who are able to recommend equipment, walk me through setting it up, and helping me look and sound the best I can. \n\nI can't imagine that we'll be back to 100% on-site recording at LinkedIn when the pandemic is over. A home studio becomes an asset that I can use in many other ways going forward. \n\n## About the shelf\n\n[The shelf] (https://www.wayfair.com/furniture/pdp/hashtag-home-dakota-geometric-bookcase-w001787825.html) has been so much fun to assemble. I bought it for this purpose, so it's fun and different. It's mounted on the wall with some brackets and a support board.\n\nThe items on the shelf are things from around the house, plus a few items I bought especially for this purpose.\n\nThings bought specifically for the shelf:\n<ul>\n  <li><a href=\"https://www.amazon.com/gp/product/B07CW96RWW/\" target=\"_blank\">The light-up sign</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B08JHQL5TG/\" target=\"_blank\">The bonsai tree light</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B08JM77Q1F/\" target=\"_blank\">The music note \"neon\" (LED) sign</a></li>\n  <li><a href=\"https://www.amazon.com/gp/product/B072MK3TSZ/\" target=\"_blank\">Fake succulent plants!</a></li>\n  </ul>\n\nOther shelf additions:\n<ul>\n  <li>My Shattuck Teaching Award from Harvard, and an Extension School glass</li>\n    <li>A ceramic box from my maternal grandmother</li>\n  <li>Hulk and Thor USB drives, and a tiny pottery teapot ornament</li>\n  <li>Russian nesting dolls, brought home from the USSR by my paternal grandparents in the 80s</li>\n  <li>DVD versions of some old Lynda.com courses</li>\n    <li>Photo of my old German shepherds</li>\n  <li>Copies of all three of my books with a very cool lava rock</li>\n  <li>Pottery jug from North Carolina, bought while traveling with an old friend</li>\n  <li>A ceramic box from my parents and a handblown glass vase from an old friend</li>\n  </ul>\n\n<img src=\"uploads/2020/1fb0793a01.jpg\" width=\"600\" height=\"450\" alt=\"Shelf in my recording studio.\" />\n",
				"date_published": "2020-12-26T17:10:59-05:00",
				"url": "https://learnnocode.dev/2020/12/26/creating-a-home.html",
				"tags": ["Website Redesign Project"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/23/redesigning-with-softrio.html",
				"title": "Redesigning with softr.io and Airtable",
				"content_html": "\n\n<h2 id=\"sidebar-preamble\">Sidebar Preamble</h2>\n\n<p>My <a href=\"https://www.jenkramer.org\">current website</a> is a total embarrassment.</p>\n\n<p>I&rsquo;ve needed to change it for years. In fact, it&rsquo;s been on my whiteboard &ldquo;things to do&rdquo; for <strong>five years.</strong></p>\n\n<p>As I move into the world of no-code, I&rsquo;m redesigning my site with many different no-code platforms. I&rsquo;ll be trying out different platforms and putting together some kind of website over the next several weeks.</p>\n\n<p><a href=\"https://learnnocode.dev/2020/12/23/redesigning-jenkramerorg-an.html\">Read more about the project</a></p>\n\n<p>&nbsp;</p>\n\n<h2 id=\"today-s-lovely-contestants\">Today&rsquo;s Lovely Contestants</h2>\n\n<p>I&rsquo;ve started with <a href=\"https://www.softr.io\">Softr.io</a>  and <a href=\"https://www.airtable.com/\">Airtable</a> because I&rsquo;ve heard a lot of buzz about Softr lately. As for Airtable, I already had a base available that I need to integrate into my site better.</p>\n\n<p>&nbsp;</p>\n\n<h3 id=\"airtable-base\">Airtable base</h3>\n\n<p>Earlier this year, I created a <a href=\"https://www.linkedin.com/learning/no-code-solutions-for-websites-and-apps/organize-data-with-airtable\">single video on Airtable for LinkedIn Learning</a>. It&rsquo;s a base of currently active video courses I&rsquo;ve created for different publishers.</p>\n\n<p><em>Base: Airtable&rsquo;s word for &ldquo;database.&rdquo; I guess database is too scary.</em></p>\n\n<p>The base, as it currently exists, is <a href=\"https://airtable.com/shrE6tr0nt0tPVhLi\">public and available for viewing</a>.</p>\n\n<p>I have this integrated on my current website via iframe. Again, easy, low maintenance, but there&rsquo;s more that can be done with Airtable.</p>\n\n<p>&nbsp;</p>\n\n<h3 id=\"softr\">Softr</h3>\n\n<p>Feels very much like Squarespace, but with fewer design features, less heavy lifting, and more integration with other tools.</p>\n\n<p>There are a few templates to choose from, but these are just assemblages of blocks with a certain theme. These templates seem to drive content in the no-code space. Probably another topic for another rant sometime&hellip; this is not exclusively a Softr thing.</p>\n\n<p>Choose from a series of &ldquo;blocks&rdquo; with fixed layouts to assemble the page. Populate with data. Limited ability for changes to colors, fonts, layouts.</p>\n\n<p>&nbsp;</p>\n\n<h2 id=\"the-big-reveal\">The Big Reveal</h2>\n\n<p><a href=\"https://jen4web.softr.io\">My Softr/Airtable website</a></p>\n\n<p>Money spent: $0 (free version of Airtable, free version of Softr)</p>\n",
				"content_text": "## Sidebar Preamble ##\nMy [current website] (https://www.jenkramer.org) is a total embarrassment.\n\nI've needed to change it for years. In fact, it's been on my whiteboard \"things to do\" for **five years.**\n\nAs I move into the world of no-code, I'm redesigning my site with many different no-code platforms. I'll be trying out different platforms and putting together some kind of website over the next several weeks.\n\n[Read more about the project] (https://learnnocode.dev/2020/12/23/redesigning-jenkramerorg-an.html)\n\n\n<p>&nbsp;</p>\n\n## Today's Lovely Contestants ##\n\nI've started with [Softr.io] (https://www.softr.io)  and [Airtable] (https://www.airtable.com/) because I've heard a lot of buzz about Softr lately. As for Airtable, I already had a base available that I need to integrate into my site better.\n\n<p>&nbsp;</p>\n\n\n### Airtable base\n\nEarlier this year, I created a [single video on Airtable for LinkedIn Learning] (https://www.linkedin.com/learning/no-code-solutions-for-websites-and-apps/organize-data-with-airtable). It's a base of currently active video courses I've created for different publishers.\n\n*Base: Airtable's word for \"database.\" I guess database is too scary.*\n\nThe base, as it currently exists, is [public and available for viewing] (https://airtable.com/shrE6tr0nt0tPVhLi).\n\nI have this integrated on my current website via iframe. Again, easy, low maintenance, but there's more that can be done with Airtable.\n\n<p>&nbsp;</p>\n\n\n### Softr\n\nFeels very much like Squarespace, but with fewer design features, less heavy lifting, and more integration with other tools.\n\nThere are a few templates to choose from, but these are just assemblages of blocks with a certain theme. These templates seem to drive content in the no-code space. Probably another topic for another rant sometime... this is not exclusively a Softr thing.\n\nChoose from a series of \"blocks\" with fixed layouts to assemble the page. Populate with data. Limited ability for changes to colors, fonts, layouts.\n\n<p>&nbsp;</p>\n\n\n## The Big Reveal\n\n[My Softr/Airtable website] (https://jen4web.softr.io)\n\nMoney spent: $0 (free version of Airtable, free version of Softr)\n\n\n",
				"date_published": "2020-12-23T09:53:00-05:00",
				"url": "https://learnnocode.dev/2020/12/23/redesigning-with-softrio.html",
				"tags": ["Tools Website builders","Tools Web app builders","Website Redesign Project"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/23/redesigning-jenkramerorg-an.html",
				"title": "Redesigning jenkramer.org: an exercise",
				"content_html": "\n\n<p>The state of jenkramer.org is pretty horrible.</p>\n\n<p>I redesigned this site in 2014 using Bootstrap 3, LESS for styling, and PHP includes.</p>\n\n<p>You might be wondering why I chose those technologies, of all of the technologies that were out there.</p>\n\n<p>a. Keep in mind that while 2014 was only 7 years minus one week ago, <strong>the web has changed radically since then.</strong></p>\n\n<ul>\n  <li>The initial React release was in mid-2013. Angular was in 2016. We were in a period of \"framework flavor of the month\" at this point. Every conference seemed to have people desperate to dominate the next big thing in JavaScript. There were a lot of things coming out then.</li>\n\n<li><strong>jQuery was still very much a thing in 2014.</strong> jQuery Mobile was starting to decline with the availability (and superior responsive design) of Bootstrap. jQuery UI wasn't responsive and was declining as well, plus Bootstrap had its own UI components.</li>\n\n<li><strong>Bootstrap was a massive game-changer on the front-end.</strong> In 2014, people were only starting to transition to Flexbox for layouts from floats. People don't understand floats for layout. And people definitely don't understand CSS. Responsive design was still a mystery to many people, particularly how to code it by hand. And Bootstrap was HUGE in the bootcamps, which were thriving by this point. Indeed, that's often how CSS was taught: Here's Bootstrap. Use it.</li>\n\n<li>Grunt might have been a thing, with Gulp gaining traction. Webpack didn't exist. Node was out there, but only just getting started. </li>\n\n  <li>This sounds like my web stories from 20 years ago. <strong>Keep in mind it's only been SEVEN YEARS. </strong></li>\n  </ul>\n\n<p>b. <strong>Bootstrap only integrated with LESS at this point.</strong> Sass integration was coming, but not for a while.</p>\n\n<p>c. OK, PHP includes were old, even then. But they are super easy to configure, and they gave me some simple moving parts for repeated content on the site to make maintenance easier. <strong>Technology doesn&rsquo;t have to hurt to work, people.</strong></p>\n\n<p>d. It&rsquo;s only a 10 page website. I wasn&rsquo;t blogging. I wasn&rsquo;t trying to sell anything. No one was maintaining the site but me. I could have installed WordPress, but then I&rsquo;d have to maintain it. <strong>There wasn&rsquo;t any real reason to build anything but a static site.</strong></p>\n\n<h2 id=\"redesign-time\">Redesign time</h2>\n\n<p>So why does one need to redesign?\n<ul>\n<li><strong>The technology driving the site is old and dated. It&rsquo;s too hard to maintain, or it&rsquo;s a security threat. </strong><br>\nWell&hellip; yeah, OK, Bootstrap 3 is old, and so are PHP includes. But nothing is a security threat here, and I don&rsquo;t mind writing HTML to update content. Basically, I&rsquo;m &ldquo;meh&rdquo; on my tech stack, as long as the site is telling a good story. Honestly, I don&rsquo;t need to take hours to set up a development environment, or installing things, or figuring out why X in the stack isn&rsquo;t working. I don&rsquo;t have time for that. It&rsquo;s a simple website.</li></p>\n\n<p><li><strong>The content is dated and needs revising.</strong><br>\nTHIS is the reason the site needs a redesign. There&rsquo;s waaaaay too much blah blah on the site. Nothing is focused. It&rsquo;s all over the place, trying to be comprehensive. So time to focus the story.</li></p>\n\n<h2 id=\"focusing-the-story\">Focusing the story</h2>\n\n<p>I have a lot of writing to do before I&rsquo;m ready to redesign completely. Honestly, this is a separate post to explain what I&rsquo;m doing and why.</p>\n\n<p>But let&rsquo;s just say it&rsquo;s this, in a nutshell:</p>\n\n<p><ul>\n    <li>Cut the blah blah in half, or three-quarters.</li></p>\n\n<p><li>More showing, less telling.</li></p>\n\n<p><li>Use Donald Miller&rsquo;s Storybrand principles to drive layout.</li></p>\n\n<p><li>Reframe the site to the customer as hero, rather than I&rsquo;m the hero. (Also Donald Miller.)</li>\n  </ul></p>\n\n<h2 id=\"the-plan\">The Plan</h2>\n\n<p>Since I&rsquo;m pivoting to the no-code world (probably another story elsewhere), I&rsquo;m going to try out a bunch of no-code tools to see what I can learn and create in those environments.</p>\n\n<p>I&rsquo;ll try creating something once a week as possible.</p>\n\n<p>I&rsquo;ll post the results here, along with a review.</p>\n\n<p>These might not be the final versions of my site. Indeed, they&rsquo;re probably not. But they&rsquo;re a great way to try out the products, identify positives and negatives of each, and decide what I want to do going forward.</p>\n",
				"content_text": "The state of jenkramer.org is pretty horrible.\n\nI redesigned this site in 2014 using Bootstrap 3, LESS for styling, and PHP includes. \n\nYou might be wondering why I chose those technologies, of all of the technologies that were out there. \n\na. Keep in mind that while 2014 was only 7 years minus one week ago, **the web has changed radically since then.** \n\n<ul>\n  <li>The initial React release was in mid-2013. Angular was in 2016. We were in a period of \"framework flavor of the month\" at this point. Every conference seemed to have people desperate to dominate the next big thing in JavaScript. There were a lot of things coming out then.</li>\n\n<li><strong>jQuery was still very much a thing in 2014.</strong> jQuery Mobile was starting to decline with the availability (and superior responsive design) of Bootstrap. jQuery UI wasn't responsive and was declining as well, plus Bootstrap had its own UI components.</li>\n\n<li><strong>Bootstrap was a massive game-changer on the front-end.</strong> In 2014, people were only starting to transition to Flexbox for layouts from floats. People don't understand floats for layout. And people definitely don't understand CSS. Responsive design was still a mystery to many people, particularly how to code it by hand. And Bootstrap was HUGE in the bootcamps, which were thriving by this point. Indeed, that's often how CSS was taught: Here's Bootstrap. Use it.</li>\n\n<li>Grunt might have been a thing, with Gulp gaining traction. Webpack didn't exist. Node was out there, but only just getting started. </li>\n\n  <li>This sounds like my web stories from 20 years ago. <strong>Keep in mind it's only been SEVEN YEARS. </strong></li>\n  </ul>\n\nb. <strong>Bootstrap only integrated with LESS at this point.</strong> Sass integration was coming, but not for a while.\n\nc. OK, PHP includes were old, even then. But they are super easy to configure, and they gave me some simple moving parts for repeated content on the site to make maintenance easier. <strong>Technology doesn't have to hurt to work, people.</strong>\n\nd. It's only a 10 page website. I wasn't blogging. I wasn't trying to sell anything. No one was maintaining the site but me. I could have installed WordPress, but then I'd have to maintain it. **There wasn't any real reason to build anything but a static site.**\n\n\n\n\n## Redesign time\n\nSo why does one need to redesign?\n<ul>\n<li><strong>The technology driving the site is old and dated. It's too hard to maintain, or it's a security threat. </strong><br>\nWell... yeah, OK, Bootstrap 3 is old, and so are PHP includes. But nothing is a security threat here, and I don't mind writing HTML to update content. Basically, I'm \"meh\" on my tech stack, as long as the site is telling a good story. Honestly, I don't need to take hours to set up a development environment, or installing things, or figuring out why X in the stack isn't working. I don't have time for that. It's a simple website.</li>\n\n<li><strong>The content is dated and needs revising.</strong><br>\nTHIS is the reason the site needs a redesign. There's waaaaay too much blah blah on the site. Nothing is focused. It's all over the place, trying to be comprehensive. So time to focus the story.</li>\n\n## Focusing the story\n\nI have a lot of writing to do before I'm ready to redesign completely. Honestly, this is a separate post to explain what I'm doing and why.\n\nBut let's just say it's this, in a nutshell:\n\n  <ul>\n    <li>Cut the blah blah in half, or three-quarters.</li>\n\n<li>More showing, less telling.</li>\n\n<li>Use Donald Miller's Storybrand principles to drive layout.</li>\n\n<li>Reframe the site to the customer as hero, rather than I'm the hero. (Also Donald Miller.)</li>\n  </ul>\n\n  \n  \n## The Plan\n\nSince I'm pivoting to the no-code world (probably another story elsewhere), I'm going to try out a bunch of no-code tools to see what I can learn and create in those environments. \n\nI'll try creating something once a week as possible.\n\nI'll post the results here, along with a review.\n\nThese might not be the final versions of my site. Indeed, they're probably not. But they're a great way to try out the products, identify positives and negatives of each, and decide what I want to do going forward.\n",
				"date_published": "2020-12-23T09:29:00-05:00",
				"url": "https://learnnocode.dev/2020/12/23/redesigning-jenkramerorg-an.html",
				"tags": ["Website Redesign Project"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/16/theres-an-awful.html",
				"title": "There's an awful lot of code in no-code",
				"content_html": "<p>Code -&gt; no code:\n<ul>\n  <li>Authenticated -&gt; logged in</li></p>\n\n<p><li>Margin -&gt; spacing outside</li></p>\n\n<p><li>Padding -&gt; spacing inside</li></p>\n\n<p><li>Typography -&gt; Fonts (use Word terminology)</li>\n  </ul></p>\n\n<p>It&rsquo;s more than database -&gt; collection/base/etc.</p>\n\n<p>There&rsquo;s a pile of 20-somethings building no-code tools without realizing that many of these problems have been solved before. We&rsquo;ve all seen the movie already.</p>\n\n<p>In 2005, we had a battle between WordPress and Joomla. WordPress won. They had a great user interface. They tested it carefully and made sure it was &ldquo;intuitive.&rdquo;</p>\n\n<p>Today, no-code tools are &ldquo;intuitive and easy to use&rdquo; for the people who build them, or the people who are invested in learning them. They are not easy to pick up. User testing would show that these tools are still pretty uniformly horrible.</p>\n\n<p>No-code isn&rsquo;t getting rid of coding syntax, but keeping all of the names, labels, and requirements of coding.</p>\n\n<p>You have to take it a step further. If I still have to know how to think about an application, how to build it, where the data is going, which box is the right one to apply the class, then you haven&rsquo;t really solved my no-code problems.</p>\n\n<p>Start with terminology. Stop thinking like a coder.</p>\n",
				"content_text": "Code -> no code:\n<ul>\n  <li>Authenticated -> logged in</li>\n\n  <li>Margin -> spacing outside</li>\n\n  <li>Padding -> spacing inside</li>\n\n  <li>Typography -> Fonts (use Word terminology)</li>\n  </ul>\n\nIt's more than database -> collection/base/etc.\n\nThere's a pile of 20-somethings building no-code tools without realizing that many of these problems have been solved before. We've all seen the movie already.\n\nIn 2005, we had a battle between WordPress and Joomla. WordPress won. They had a great user interface. They tested it carefully and made sure it was \"intuitive.\"\n\nToday, no-code tools are \"intuitive and easy to use\" for the people who build them, or the people who are invested in learning them. They are not easy to pick up. User testing would show that these tools are still pretty uniformly horrible.\n\nNo-code isn't getting rid of coding syntax, but keeping all of the names, labels, and requirements of coding.\n\nYou have to take it a step further. If I still have to know how to think about an application, how to build it, where the data is going, which box is the right one to apply the class, then you haven't really solved my no-code problems.\n\nStart with terminology. Stop thinking like a coder.\n",
				"date_published": "2020-12-16T15:07:00-05:00",
				"url": "https://learnnocode.dev/2020/12/16/theres-an-awful.html",
				"tags": ["Rants"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/16/setting-goals-and.html",
				"title": "Setting Goals and Value Proposition: Formulas",
				"content_html": "\n\n<h2 id=\"setting-goals\">Setting Goals</h2>\n\n<blockquote>\n  <p>For people who believe _____, who want ____, my work creates ______.  </p>\n  <cite><a href=\"https://sethgodinwrites.medium.com/professionals-produce-with-intent-cc603f230a32\" target=\"_blank\">Seth Godin</a></cite>\n  </blockquote>\n\n<h2 id=\"value-proposition\">Value Proposition</h2>\n\n<blockquote>\n<p>[company name] makes it easy for [target customer] to [thing that product does] so that [benefit of the product].</p>\n  <cite><a href=\"https://twitter.com/TaraReed_\" target=\"_blank\">Tara Reed</a></cite>\n  </blockquote>\n  \n",
				"content_text": "## Setting Goals ##\n\n<blockquote>\n  <p>For people who believe _____, who want ____, my work creates ______.  </p>\n  <cite><a href=\"https://sethgodinwrites.medium.com/professionals-produce-with-intent-cc603f230a32\" target=\"_blank\">Seth Godin</a></cite>\n  </blockquote>\n\n## Value Proposition ##\n\n<blockquote>\n<p>[company name] makes it easy for [target customer] to [thing that product does] so that [benefit of the product].</p>\n  <cite><a href=\"https://twitter.com/TaraReed_\" target=\"_blank\">Tara Reed</a></cite>\n  </blockquote>\n  \n  \n",
				"date_published": "2020-12-16T08:29:00-05:00",
				"url": "https://learnnocode.dev/2020/12/16/setting-goals-and.html",
				"tags": ["Business and UX"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/15/nocode-links.html",
				"title": "No-code links",
				"content_html": "<p>Tools mentioned in a December 3 networking event&hellip;</p>\n\n<p><a href=\"https://www.glideapps.com/\">www.glideapps.com</a></p>\n\n<p><a href=\"https://www.adalo.com/\">www.adalo.com</a></p>\n\n<p><a href=\"https://www.metaranx.com/\">www.metaranx.com</a></p>\n\n<p><a href=\"https://webflow.com/\">webflow.com</a></p>\n\n<p><a href=\"https://carrd.co/\">carrd.co</a></p>\n\n<p><a href=\"https://bubble.io/\">bubble.io</a></p>\n\n<p><a href=\"https://airtable.com/\">airtable.com</a></p>\n\n<p><a href=\"https://coda.io/\">coda.io</a></p>\n\n<p><a href=\"https://www.notion.so/\">www.notion.so</a></p>\n\n<p><a href=\"https://zapier.com/\">zapier.com</a></p>\n\n<p><a href=\"https://www.softr.io/\">www.softr.io</a> + airtable</p>\n\n<p>www.notion.so/Notion-Advent-Calendar-e159dcd0e70c4e919e278a2f95ec125d</p>\n\n<p><a href=\"https://www.mightynetworks.com/\">www.mightynetworks.com</a></p>\n\n<p><a href=\"https://circle.so/\">circle.so</a></p>\n\n<p>Some products built with no-code (bubble mostly) <a href=\"https://www.getcuppa.io/\">www.getcuppa.io</a></p>\n\n<p><a href=\"https://beta.shoutout.so/\">beta.shoutout.so</a></p>\n\n<p>nutriso.so</p>\n\n<p>Gumroad for selling products <a href=\"https://gumroad.com/\">gumroad.com</a></p>\n\n<p>A look into how products are built <a href=\"http://sideprojectstack.com/\">sideprojectstack.com</a></p>\n\n<p><a href=\"https://www.sheet2site.com/\">www.sheet2site.com</a></p>\n\n<p><a href=\"https://pory.io/\">pory.io</a></p>\n\n<p>badunicorn.vc</p>\n",
				"content_text": "Tools mentioned in a December 3 networking event...\n\n[www.glideapps.com](https://www.glideapps.com/)\n\n[www.adalo.com](https://www.adalo.com/)\n\n[www.metaranx.com](https://www.metaranx.com/)\n\n[webflow.com](https://webflow.com/)\n\n[carrd.co](https://carrd.co/)\n\n[bubble.io](https://bubble.io/)\n\n[airtable.com](https://airtable.com/)\n\n[coda.io](https://coda.io/)\n\n[www.notion.so](https://www.notion.so/)\n\n[zapier.com](https://zapier.com/)\n\n[www.softr.io](https://www.softr.io/) + airtable\n\nwww.notion.so/Notion-Advent-Calendar-e159dcd0e70c4e919e278a2f95ec125d\n\n[www.mightynetworks.com](https://www.mightynetworks.com/)\n\n[circle.so](https://circle.so/)\n\nSome products built with no-code (bubble mostly) [www.getcuppa.io](https://www.getcuppa.io/)\n\n[beta.shoutout.so](https://beta.shoutout.so/)\n\nnutriso.so\n\nGumroad for selling products [gumroad.com](https://gumroad.com/)\n\nA look into how products are built [sideprojectstack.com](http://sideprojectstack.com/)\n\n[www.sheet2site.com](https://www.sheet2site.com/)\n\n[pory.io](https://pory.io/)\n\nbadunicorn.vc\n",
				"date_published": "2020-12-15T12:12:00-05:00",
				"url": "https://learnnocode.dev/2020/12/15/nocode-links.html",
				"tags": ["Tools General"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/as-lowcode-and.html",
				"title": "As low-code and no-code approaches rise, developers brace for new challenges",
				"content_html": "<p><a href=\"https://www.zdnet.com/article/as-low-code-and-no-code-approaches-rise-developers-brace-for-new-challenges/\">&lsquo;People rapidly create things, rapidly deploy things and rapidly regret things. Each subsequent generation of technology makes it easier to build bad solutions fast.&rsquo;</a></p>\n\n<p>One of the things that bothers me about no-code approaches is <a href=\"https://en.wikipedia.org/wiki/Technical_debt\">technical debt</a>.</p>\n\n<p><strong>It&rsquo;s 1996 in the No-Code Universe.</strong> As the web was in 1996, the No-Code Universe is at the phase where the tools are exploding, the money flows like kegs of beer at a frat party, and new companies are created, get bought, and go under every day.</p>\n\n<p>We will come out with some winners, but as we should have learned from the web, there will be far more losers than winners. The consolidation will be significant. Your data will slosh around all over Silicon Valley, and you may not even realize it&rsquo;s happening.</p>\n\n<p>Be sure you know how to get your data out of a system before you commit your business to running on it as a platform.</p>\n",
				"content_text": "['People rapidly create things, rapidly deploy things and rapidly regret things. Each subsequent generation of technology makes it easier to build bad solutions fast.'] (https://www.zdnet.com/article/as-low-code-and-no-code-approaches-rise-developers-brace-for-new-challenges/)\n\nOne of the things that bothers me about no-code approaches is [technical debt] (https://en.wikipedia.org/wiki/Technical_debt).\n\n**It's 1996 in the No-Code Universe.** As the web was in 1996, the No-Code Universe is at the phase where the tools are exploding, the money flows like kegs of beer at a frat party, and new companies are created, get bought, and go under every day.\n\nWe will come out with some winners, but as we should have learned from the web, there will be far more losers than winners. The consolidation will be significant. Your data will slosh around all over Silicon Valley, and you may not even realize it's happening.\n\nBe sure you know how to get your data out of a system before you commit your business to running on it as a platform.\n",
				"date_published": "2020-12-14T14:53:45-05:00",
				"url": "https://learnnocode.dev/2020/12/14/as-lowcode-and.html",
				"tags": ["NoCode Reading"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/is-nocode-going.html",
				"title": "Is No-Code Going To Steal Your Job?",
				"content_html": "<p><a href=\"https://builtin.com/software-engineering-perspectives/no-code-replace-programmers?es_id=b1380061cf\">Spoiler alert: No.</a></p>\n\n<p>When I started working as web professional in 2000, there were no &ldquo;tools.&rdquo; You used a text editor or you used Macromedia Dreamweaver (current version: 3).</p>\n\n<p>The #1 client request was to be able to edit their own website without having to go through their web designer. That&rsquo;s because most web designers SUCKED. They were utterly incapable of answering or returning phone calls or emails. The common story was the designer sitting on the client request for weeks at a time.</p>\n\n<p>Then in 2002, along came Macromedia Contribute. Designed to integrate with Dreamweaver templates, this simple&reg; software let clients make their own updates to their websites.</p>\n\n<p>Much handwringing ensued. OMG, there would soon be NO WORK for web designers!</p>\n\n<p>Of course, nothing could have been further from the truth. There was plenty of work for web designers. However, if &ldquo;work&rdquo; meant fixing typos or updating copy, yeah, you did lose out on some of that. But there was still a ridiculous amount of work for those wanting to build new websites.</p>\n\n<p>Fast forward to 2020. The latest round of no-code tools are allowing people to automate tasks, build forms, create their own simple websites, and integrate technologies without developers.</p>\n\n<p>Much handwringing ensued. OMG, there would soon be NO WORK for programmers!</p>\n\n<p>And just like before, nothing could be further from the truth.</p>\n\n<p>a. Who codes the no-code tools?&hellip;</p>\n\n<p>b. Who does one call when one pushes no-code to the limit, or wants that one feature that seems to be nowhere in the no-code space?</p>\n\n<p>c. The power of creation from nothing will still lie with programmers. But the junk work of building yet another form that emails the contents to the owner, or writes it to some spreadsheet? That stuff is going to go away.</p>\n\n<p>Trust me, you won&rsquo;t miss it.</p>\n",
				"content_text": "[Spoiler alert: No.] (https://builtin.com/software-engineering-perspectives/no-code-replace-programmers?es_id=b1380061cf)\n\nWhen I started working as web professional in 2000, there were no \"tools.\" You used a text editor or you used Macromedia Dreamweaver (current version: 3). \n\nThe #1 client request was to be able to edit their own website without having to go through their web designer. That's because most web designers SUCKED. They were utterly incapable of answering or returning phone calls or emails. The common story was the designer sitting on the client request for weeks at a time.\n\nThen in 2002, along came Macromedia Contribute. Designed to integrate with Dreamweaver templates, this simple(r) software let clients make their own updates to their websites. \n\nMuch handwringing ensued. OMG, there would soon be NO WORK for web designers! \n\nOf course, nothing could have been further from the truth. There was plenty of work for web designers. However, if \"work\" meant fixing typos or updating copy, yeah, you did lose out on some of that. But there was still a ridiculous amount of work for those wanting to build new websites.\n\nFast forward to 2020. The latest round of no-code tools are allowing people to automate tasks, build forms, create their own simple websites, and integrate technologies without developers.\n\nMuch handwringing ensued. OMG, there would soon be NO WORK for programmers! \n\nAnd just like before, nothing could be further from the truth.\n\na. Who codes the no-code tools?...\n\nb. Who does one call when one pushes no-code to the limit, or wants that one feature that seems to be nowhere in the no-code space?\n\nc. The power of creation from nothing will still lie with programmers. But the junk work of building yet another form that emails the contents to the owner, or writes it to some spreadsheet? That stuff is going to go away.\n\nTrust me, you won't miss it.\n",
				"date_published": "2020-12-14T13:26:04-05:00",
				"url": "https://learnnocode.dev/2020/12/14/is-nocode-going.html",
				"tags": ["NoCode Reading"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/web-app-builders.html",
				
				"content_html": "<p><em>Web app builders</em></p>\n\n<p><a href=\"https://www.ycode.com/\">Ycode</a></p>\n\n<p><a href=\"https://bubble.io/\">Bubble</a></p>\n",
				"content_text": "*Web app builders*\n\n[Ycode] (https://www.ycode.com/)\n\n[Bubble] (https://bubble.io/)\n\n",
				"date_published": "2020-12-14T08:58:00-05:00",
				"url": "https://learnnocode.dev/2020/12/14/web-app-builders.html",
				"tags": ["Tools Web app builders"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/descript-for-video.html",
				
				"content_html": "<p><a href=\"https://www.descript.com/\">Descript</a> for video editing, automatic transcripts, um removal</p>\n",
				"content_text": "[Descript] (https://www.descript.com/) for video editing, automatic transcripts, um removal\n",
				"date_published": "2020-12-14T08:52:11-05:00",
				"url": "https://learnnocode.dev/2020/12/14/descript-for-video.html",
				"tags": ["Video"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/notion-advent-calendar.html",
				
				"content_html": "<p><a href=\"https://www.notion.so/Notion-Advent-Calendar-e159dcd0e70c4e919e278a2f95ec125d\">Notion Advent Calendar</a></p>\n",
				"content_text": "[Notion Advent Calendar] (https://www.notion.so/Notion-Advent-Calendar-e159dcd0e70c4e919e278a2f95ec125d)\n",
				"date_published": "2020-12-14T08:49:55-05:00",
				"url": "https://learnnocode.dev/2020/12/14/notion-advent-calendar.html"
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/nice-list-of.html",
				
				"content_html": "<p><a href=\"https://twitter.com/digitalmakershq/status/1333414590168915968\">Nice list of no-code tools by category</a></p>\n",
				"content_text": "[Nice list of no-code tools by category] (https://twitter.com/digitalmakershq/status/1333414590168915968)\n",
				"date_published": "2020-12-14T08:25:00-05:00",
				"url": "https://learnnocode.dev/2020/12/14/nice-list-of.html",
				"tags": ["Tools General"]
			},
			{
				"id": "http://jen4web.micro.blog/2020/12/14/days-of-maker.html",
				"title": "Website builders without code",
				"content_html": "<p>*Ones I know well: *</p>\n\n<p>🔹 Squarespace</p>\n\n<p>🔹 Wix (wizard version)</p>\n\n<p>🔹 WordPress (.org, .com) (also debatable if this is no-code)</p>\n\n<p>🔹 Webflow</p>\n\n<p><em>Learning:</em></p>\n\n<p>🔹 EditorX</p>\n\n<p><em>Need to look into:</em></p>\n\n<p>🔹 <a href=\"https://carrd.co/\">Carrd</a></p>\n\n<p>🔹 <a href=\"https://www.softr.io/\">Softr</a></p>\n\n<p>🔹 <a href=\"https://pory.io/\">Pory</a></p>\n\n<p>🔹 <a href=\"https://dorik.com/\">Dorik</a></p>\n\n<p>Several of these are Airtable integrators for web apps. Others are for single page sites.</p>\n",
				"content_text": "*Ones I know well: *\n\n🔹 Squarespace\n\n🔹 Wix (wizard version)\n\n🔹 WordPress (.org, .com) (also debatable if this is no-code)\n\n🔹 Webflow\n\n\n*Learning:*\n\n🔹 EditorX\n\n\n*Need to look into:*\n\n🔹 [Carrd] (https://carrd.co/)\n\n🔹 [Softr] (https://www.softr.io/)\n\n🔹 [Pory] (https://pory.io/)\n\n🔹 [Dorik] (https://dorik.com/)\n\nSeveral of these are Airtable integrators for web apps. Others are for single page sites.\n",
				"date_published": "2020-12-14T07:54:00-05:00",
				"url": "https://learnnocode.dev/2020/12/14/days-of-maker.html",
				"tags": ["Tools Website builders"]
			}
	]
}
